
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НЗ = РегистрыСведений.ЗагрузкаДанныхИзФулфилмент.СоздатьНаборЗаписей();
	НЗ.Отбор.ИмяФайла.Установить(Запись.ИмяФайла);
	НЗ.Отбор.Каталог.Установить(Запись.Каталог); 
	НЗ.Прочитать();
	
	
	
	Дд = НЗ[0].ДанныеФайла.Получить();
	ИмяФ = ПолучитьИмяВременногоФайла("xml");
	Дд.Записать(ИмяФ);
	ДанныеФайла.Прочитать(ИмяФ);//ДанныеФайла.УстановитьТекст();
	Попытка
		УдалитьФайлы(ИмяФ);
	Исключение
	    ЗаписьЖурналаРегистрации("РС_ЗагрузкаДанныхИзФулфилмент", 
			УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры
