
// Описание_метода
//
// Параметры:
//	СкладУПП 	- гуид (строка) или спр ссылка КСП_СкладыУПП - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ПоМэппингу(СкладУПП) Экспорт
	
	Если ТипЗнч(СкладУПП) = Тип("Строка") Тогда
		_СкладУПП = Справочники.КСП_СкладыУПП.ПолучитьСсылку(Новый УникальныйИдентификатор(СкладУПП));
		
	Иначе 
		_СкладУПП = СкладУПП;
	КонецЕсли;	
	
	Рез = Справочники.КСП_ВидыОперацийПоСкладамУПП.НайтиПоРеквизиту("СкладУПП", _СкладУПП);
	Если ЗначениеЗаполнено(Рез) Тогда
		Возврат Рез.СкладЕРП;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
