
&НаКлиенте
Процедура СоглашениеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда
		
		ТекСтрока = Элемент.ТекущаяСтрока;
		ИндексПредыдущейСтроки = Объект.Соглашение.Количество() - 2;
		
		Если ИндексПредыдущейСтроки >= 0 Тогда
			ПредыдущаяСтрока = Объект.Соглашение[ИндексПредыдущейСтроки];
			Если ЗначениеЗаполнено(ПредыдущаяСтрока.КурсДо) Тогда			
				Элемент.ТекущиеДанные.КурсОт = ПредыдущаяСтрока.КурсДо + 0.01;
			КонецЕсли;
		КонецЕсли;
		//ИндексТекСтроки = Объект.Товары.Индекс(ТекСтрока);
		//ВсегоСтрок = Объект.Товары.Количество();

		//ПредСтрока = ?(ИндексТекСтроки, Объект.Товары[ИндексТекСтроки-1], Неопределено);
		//СледСтрока = ?(ИндексТекСтроки < ВсегоСтрок-1, Объект.Товары[ИндексТекСтроки+1], Неопределено);
		//
		//а = Элемент.ТекущиеДанные;		
		//а.Сумма = 100;
	КонецЕсли;
	
КонецПроцедуры
