
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ПоМэппингу(ГУИД, ВнешняяСистема) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рег.СтатусЗаказа КАК СтатусЗаказа
		|ИЗ
		|	РегистрСведений.ксп_МэппингСтатусЗаказовНаПеремещение КАК Рег
		|ГДЕ
		|	Рег.GUID = &ГУИД
		|	И Рег.ВнешняяСистема = &ВнешняяСистема";
	
	Если ГУИД = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ГУИД) Тогда
		Возврат Неопределено;
	КонецЕсли;    
	
	Запрос.УстановитьПараметр("ГУИД", ГУИД);
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СтатусЗаказа;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции




//Функция ЕстьЗначение(Значение, ВнешняяСистема) Экспорт
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ 1
//		|ИЗ
//		|	РегистрСведений.ксп_МэппингВидыНоменклатуры КАК Рег
//		|ГДЕ
//		|	Рег.GUID = &GUID
//		|	И Рег.ВнешняяСистема = &ВнешняяСистема";
//	
//	Запрос.УстановитьПараметр("GUID", GUID);
//	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
//	
//	РезультатЗапроса = Запрос.Выполнить(); 
//	
//	Возврат НЕ РезультатЗапроса.Пустой();
//		
//КонецФункции


//// Описание_метода
////
//// Параметры:
////	Параметр1 	- Тип1 - 
////
//Процедура ДобавитьЗначение(GUID, Наименование, ВнешняяСистема) Экспорт
//	
//	НЗ = РегистрыСведений.ксп_МэппингВидыНоменклатуры.СоздатьНаборЗаписей();
//	НЗ.Отбор.GUID.Установить(GUID);
//	НЗ.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
//	стрк = НЗ.Добавить();
//	стрк.GUID = GUID;
//	стрк.Наименование = Наименование;  
//	стрк.ВнешняяСистема = ВнешняяСистема;	
//	НЗ.Записать();
//		
//КонецПроцедуры

//Процедура ДобавитьЗапись(GUID, Наименование, ВнешняяСистема, Ссылка) Экспорт
//	
//	НЗ = РегистрыСведений.ксп_МэппингВидыНоменклатуры.СоздатьНаборЗаписей();
//	НЗ.Отбор.GUID.Установить(GUID);
//	НЗ.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
//	стрк = НЗ.Добавить();
//	стрк.GUID = GUID;
//	стрк.Наименование = Наименование;  
//	стрк.ВнешняяСистема = ВнешняяСистема;	
//	
//	стрк.ВидНоменклатуры = Ссылка;
//	
//	НЗ.Записать();
//		
//КонецПроцедуры