Функция ПоМэппингу (ТипСоответствия, Соответствие, ВнешняяСистема) Экспорт

 Запрос = Новый запрос;
 Запрос.Текст = 
 "ВЫБРАТЬ
 |	ксп_МэппингСправочникВидыНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры
 |ИЗ
 |	РегистрСведений.ксп_МэппингСправочникВидыНоменклатуры КАК ксп_МэппингСправочникВидыНоменклатуры
 |ГДЕ
 |	ксп_МэппингСправочникВидыНоменклатуры.ТипСоответствия = &ТипСоответствия
 |	И ксп_МэппингСправочникВидыНоменклатуры.Соответствие = &Соответствие
 |	И ксп_МэппингСправочникВидыНоменклатуры.ВнешняяСистема = &ВнешняяСистема";
 
 Запрос.УстановитьПараметр("ТипСоответствия", ТипСоответствия);
 Запрос.УстановитьПараметр("Соответствие", Соответствие);
 Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
 
 Результат = Запрос.Выполнить(); 
 
 Выборка = Результат.Выбрать(); 
 
 Пока Выборка.Следующий() Цикл
	 
	 Возврат Выборка.ВидНоменклатуры;
	 
 КонецЦикла; 
 
 Возврат Справочники.ВидыНоменклатуры.ПустаяСсылка();
 
КонецФункции