
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ВыполнитьКод(ИдВызова,Код) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	логгер = мис_ЛоггерСервер.getLogger(ИдВызова, "ВыполнитьКод");
	
	Выполнить(Код);
	
	логгер.инфо("Выполнен код: " + Код);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры




// proxy-метод для обработки пакета в фоне. Загружает объекты в базу.
// Параметры
//	ТЗРекордсет - таблица значений - данные из SQL сервера
//	НомерЗадания - число - обязательный. Порядковый номер фонового задания.
//	ДопПараметры - структура - приходит сюда из метода-обертки, из которого передается управление
//
// Описание
//	Принимает на вход структуру ДопПараметры, в которой должны быть определены поля, используемые в 
//	ОбработатьПакет_Фон() конкретной обработки.
//	Обязательные поля:
//		* ИмяВнешнейОбработки - строка - имя обработки, которая будет вызвана отсюда
//
Процедура ОбработатьПакет_Фон(Знач ИдВызова, ТЗРекордсет, НомерЗадания, ДопПараметры) Экспорт
	
	ИмяВнешнейОбработки = ДопПараметры.ИмяВнешнейОбработки;
	
	ц = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ИмяВнешнейОбработки,Истина);
	ДополнительныеОтчетыИОбработки.ПодключитьВнешнююОбработку(ц);
	ф = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ц);
	ф.ОбработатьПакет_Фон(ИдВызова, ТЗРекордсет, НомерЗадания, ДопПараметры);

	
КонецПроцедуры
