
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ)
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(КСП_НастройкиРаспределенияДоступногоОстатка.ПроцентРаспределения) КАК ПроцентРаспределения
	               |ИЗ
	               |	РегистрСведений.КСП_НастройкиРаспределенияДоступногоОстатка КАК КСП_НастройкиРаспределенияДоступногоОстатка
	               |ГДЕ
	               |	КСП_НастройкиРаспределенияДоступногоОстатка.Подразделение.Родитель = &Родитель
	               |	И КСП_НастройкиРаспределенияДоступногоОстатка.Подразделение <> &Подразделение
	               |	И КСП_НастройкиРаспределенияДоступногоОстатка.Сезон = &Сезон
	               |	И ГОД(КСП_НастройкиРаспределенияДоступногоОстатка.Период) = ГОД(&Период)";    
	
	Запрос.Параметры.Вставить("Подразделение", ЭтотОбъект.Запись.Подразделение);
	Запрос.Параметры.Вставить("Сезон", ЭтотОбъект.Запись.Сезон);
	Запрос.Параметры.Вставить("Период", ЭтотОбъект.Запись.Период);
	Запрос.Параметры.Вставить("Родитель", ЭтотОбъект.Запись.Подразделение.Родитель);

	ТаблицаПроцентов = Запрос.Выполнить().Выгрузить();
	
	СуммаПроцент = ЭтотОбъект.Запись.ПроцентРаспределения;
	
	Для каждого СтрокаНастроек из  ТаблицаПроцентов Цикл 
		
		СуммаПроцент = СуммаПроцент + СтрокаНастроек.ПроцентРаспределения;
	
	КонецЦикла;
	
	Если СуммаПроцент > 100 Тогда
		Сообщить("Не возможно записать настройку распределения. Общий процент по группе превышает 100%");
		Отказ = Истина;
		//Возврат;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере(Отказ);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры
