&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Сообщить("Документ должен быть введен на основании чек листа проверки качества тестовых отвязов", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;  
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаОснованииНаСервере(Основание)
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.КСП_АктПриемкиПоКачеству"));
	ДокументОбъект.Заполнить(Основание);
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованию(Команда)
	Ответ = Вопрос("Заполнить документ на основании документа " + Объект.ДокументОснование + "?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	Если Объект.ДокументОснование.Пустая() Тогда
		Сообщить("Сначала необходимо выбрать документ основание", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	ЗаполнитьНаОснованииНаСервере(Объект.ДокументОснование);
	ТоварыПриАктивизацииСтроки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	СтрокаТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	КлючСтроки = СтрокаТекущиеДанные.КлючСтроки;
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", КлючСтроки);
	Элементы.КонтрольКачества.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
КонецПроцедуры

&НаКлиенте
Процедура КонтрольКачестваПриАктивизацииСтроки(Элемент)
	СтрокаТекущиеДанные = Элементы.КонтрольКачества.ТекущиеДанные;
	Если СтрокаТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	КлючСтроки = СтрокаТекущиеДанные.КлючСтроки;
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", КлючСтроки);
	СтрокаОписаниеНедостатков = Объект.ОписаниеНедостатков.НайтиСтроки(Отбор);
	Если СтрокаОписаниеНедостатков.Количество() > 0 Тогда
		ТекущееОписаниеНедостатка = СтрокаОписаниеНедостатков[0].ОписаниеВыявленныхНедостатковПродукции;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТекущееОписаниеНедостаткаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтрокаТекущиеДанные = Элементы.КонтрольКачества.ТекущиеДанные;
	Если СтрокаТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	КлючСтроки = СтрокаТекущиеДанные.КлючСтроки;
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", КлючСтроки);
	СтрокаОписаниеНедостатков = Объект.ОписаниеНедостатков.НайтиСтроки(Отбор);
	Если СтрокаОписаниеНедостатков.Количество() > 0 Тогда
		СтрокаОписаниеНедостатков[0].ОписаниеВыявленныхНедостатковПродукции = Текст;
	Иначе
		СтрокаОписаниеНедостатков = Объект.ОписаниеНедостатков.Добавить();
		СтрокаОписаниеНедостатков.ОписаниеВыявленныхНедостатковПродукции = Текст;
		СтрокаОписаниеНедостатков.КлючСтроки = КлючСтроки;
	КонецЕсли;
	ТекущееОписаниеНедостатка = Текст;
КонецПроцедуры     
// СтандартныеПодсистемы.Печать 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.Печать 
// СтандартныеПодсистемы.ПодключаемыеКоманды 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда) 
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект); 
КонецПроцедуры 
&НаСервере 
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) 
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат); 
КонецПроцедуры 
&НаКлиенте 
Процедура Подключаемый_ОбновитьКоманды() 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды     
