&НаСервере
Функция ПолучитьТаблицуПланПродаж()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПланыПродаж.Номенклатура КАК Номенклатура,
				   |	ПланыПродаж.Характеристика КАК ХарактеристикаНоменклатуры,
				   |	ПланыПродаж.Количество КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ПланыПродаж КАК ПланыПродаж
	               |ГДЕ
	               |	ПланыПродаж.Период МЕЖДУ &ДатаНачала И &ДатаОкончания   
				   |	И ПланыПродаж.Подразделение = &Подразделение
				   |	И ПланыПродаж.Статус = &Статус      
				   |	И ПланыПродаж.Сценарий = &Сценарий"; 
	
	//|	И ПланыПродаж.Склад = &Склад
	
	Запрос.Параметры.Вставить("ДатаНачала", Объект.ДатаНачала);
	Запрос.Параметры.Вставить("ДатаОкончания", Объект.ДатаОкончания);
	Запрос.Параметры.Вставить("Сценарий", Объект.Сценарий);
	Запрос.Параметры.Вставить("Подразделение", Объект.Подразделение); 
	//Запрос.Параметры.Вставить("Склад", Объект.Склад);
	Запрос.Параметры.Вставить("Статус", Объект.Статус);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 

&НаСервере
Функция ПолучитьПредыдущееРаспределение()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КСП_НастройкиРаспределенияДоступногоОстатка.Номенклатура КАК Номенклатура,
	               |	КСП_НастройкиРаспределенияДоступногоОстатка.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	КСП_НастройкиРаспределенияДоступногоОстатка.ПроцентРаспределения КАК Количество
	               |ИЗ
	               |	РегистрСведений.КСП_НастройкиРаспределенияДоступногоОстатка КАК КСП_НастройкиРаспределенияДоступногоОстатка
	               |ГДЕ
	               |	КСП_НастройкиРаспределенияДоступногоОстатка.Подразделение = &Подразделение
				   |	И КСП_НастройкиРаспределенияДоступногоОстатка.Сценарий = &Сценарий
				   |	И КСП_НастройкиРаспределенияДоступногоОстатка.Коллекция = &Коллекция
	               |	И КСП_НастройкиРаспределенияДоступногоОстатка.Организация = &Организация
	               |	И КСП_НастройкиРаспределенияДоступногоОстатка.Склад = &Склад"; 
	
	
	Запрос.Параметры.Вставить("ДатаНачала", Объект.ДатаНачала);
	Запрос.Параметры.Вставить("ДатаОкончания", Объект.ДатаОкончания);
	Запрос.Параметры.Вставить("Сценарий", Объект.Сценарий);
	Запрос.Параметры.Вставить("Подразделение", Объект.Подразделение);
	Запрос.Параметры.Вставить("Коллекция", Объект.Коллекция);
	Запрос.Параметры.Вставить("Организация", Объект.Организация);
	Запрос.Параметры.Вставить("Склад", Объект.Склад);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 

 &НаСервере
Процедура РассчитатьДолиДляРаспределенияНаСервере()
	 
	ВсегоПоПлану = Объект.ПланПродаж.Итог("Количество");
	
	Объект.ДолиРаспределенияПоНоменкалтуре.Очистить();
	
	Для Каждого СтрокаТЧ из Объект.ПланПродаж Цикл  
		
		НоваяСтрокаРаспределения = Объект.ДолиРаспределенияПоНоменкалтуре.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРаспределения, СтрокаТЧ, "Номенклатура, ХарактеристикаНоменклатуры"); 
		НоваяСтрокаРаспределения.Количество = СтрокаТЧ.Количество/ВсегоПоПлану*100; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДолиДляРаспределения(Команда)
	
	Если Объект.ДолиРаспределенияПоНоменкалтуре.Количество()>0 Тогда  
		
		Режим = РежимДиалогаВопрос.ДаНет;
    	Ответ = Вопрос("По данному набору параметров уже было выполнено автоматическое распределение долей. Обновить распределение?", Режим, 0);
		
		Если Ответ =КодВозвратаДиалога.Да Тогда
			РассчитатьДолиДляРаспределенияНаСервере();
		КонецЕсли;    
		
	Иначе
		
		РассчитатьДолиДляРаспределенияНаСервере();
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ДолиРаспределенияПоНоменкалтуреПроцентРаспределенияПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ДолиРаспределенияПоНоменкалтуреПроцентРаспределенияПриИзменении(Элемент)
	
	//Если Объект.ДолиРаспределенияПоНоменкалтуре.Итог("ПроцентРаспределения")>0 Тогда
	//	Сообщить("Общий процент по группе превышает 100%");	
	//КонецЕсли;
	
КонецПроцедуры    

Функция ПроверитьПроцентРаспределения()

	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(КСП_НастройкиРаспределенияДоступногоОстатка.ПроцентРаспределения) КАК ПроцентРаспределения
	               |ИЗ
	               |	РегистрСведений.КСП_НастройкиРаспределенияДоступногоОстатка КАК КСП_НастройкиРаспределенияДоступногоОстатка
	               |ГДЕ
	               |	КСП_НастройкиРаспределенияДоступногоОстатка.Подразделение = &Подразделение
	               |	И КСП_НастройкиРаспределенияДоступногоОстатка.Коллекция = &Коллекция
	               |	И КСП_НастройкиРаспределенияДоступногоОстатка.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И КСП_НастройкиРаспределенияДоступногоОстатка.Сценарий = &Сценарий
	               |	И КСП_НастройкиРаспределенияДоступногоОстатка.Склад = &Склад
	               |	И КСП_НастройкиРаспределенияДоступногоОстатка.Номенклатура <> &Номенклатура
	               |	И КСП_НастройкиРаспределенияДоступногоОстатка.ХарактеристикаНоменклатуры <> &ХарактеристикаНоменклатуры";    
	      
	
	Запрос.Параметры.Вставить("Подразделение", Объект.Подразделение);
	Запрос.Параметры.Вставить("Коллекция", Объект.Коллекция);
	Запрос.Параметры.Вставить("ДатаНачала", Объект.ДатаНачала);
	Запрос.Параметры.Вставить("ДатаОкончания", Объект.ДатаОкончания);
	Запрос.Параметры.Вставить("Номенклатура", Объект.Номенклатура);
	Запрос.Параметры.Вставить("ХарактеристикаНоменклатуры", Объект.ХарактеристикаНоменклатуры);


	ТаблицаПроцентов = Запрос.Выполнить().Выгрузить();
	
	СуммаПроцент = ЭтотОбъект.Запись.ПроцентРаспределения;
	
	Для каждого СтрокаНастроек из  ТаблицаПроцентов Цикл 
		
		СуммаПроцент = СуммаПроцент + СтрокаНастроек.ПроцентРаспределения;
	
	КонецЦикла;
	
	Если СуммаПроцент > 100 Тогда
		Сообщить("Общий процент по группе превышает 100%");
		Возврат Истина;
	КонецЕсли;
КонецФункции


&НаСервере
Процедура ЗаписатьПроцентыРаспределенияНаСервере()

	//Удаляем предыдущие записи в регистре   
	
	Для каждого СтрокаРаспределения из Объект.ДолиРаспределенияПоНоменкалтуре Цикл
		
		МенеджерЗаписи = РегистрыСведений.КСП_НастройкиРаспределенияДоступногоОстатка.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Объект, "Подразделение, Коллекция, Организация, Сценарий, Склад");
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаРаспределения, "Номенклатура, ХарактеристикаНоменклатуры"); 
		
		//МенеджерЗаписи.Подразделение = Объект.Подразделение;
		//МенеджерЗаписи.Коллекция = Объект.Коллекция;
		//МенеджерЗаписи.Номенклатура = СтрокаРаспределения.Номенклатура;
		//МенеджерЗаписи.Организация = Объект.Организация;
		//МенеджерЗаписи.ХарактеристикаНоменклатуры = СтрокаРаспределения.ХарактеристикаНоменклатуры;
		//МенеджерЗаписи.Сценарий = Объект.Сценарий;
		//МенеджерЗаписи.Склад = Объект.Склад;

		МенеджерЗаписи.Удалить();
		
		//МенеджерЗаписи = РегистрыСведений.КСП_НастройкиРаспределенияДоступногоОстатка_ARMДиспетчер.СоздатьМенеджерЗаписи();
		//МенеджерЗаписи.Коллекция = Объект.Коллекция;
		//МенеджерЗаписи.Номенклатура = СтрокаРаспределения.Номенклатура;
		//МенеджерЗаписи.Организация = Объект.Организация;
		//МенеджерЗаписи.ХарактеристикаНоменклатуры = СтрокаРаспределения.ХарактеристикаНоменклатуры;
		//МенеджерЗаписи.Сценарий = Объект.Сценарий;
		//МенеджерЗаписи.Склад = Объект.Склад; 
		МенеджерЗаписи.ПроцентРаспределения = СтрокаРаспределения.Количество; 
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Объект, "Подразделение, Коллекция, Организация, Сценарий, Склад");
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаРаспределения, "Номенклатура, ХарактеристикаНоменклатуры");

		МенеджерЗаписи.Записать();
	
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьПроцентыРаспределения(Команда)
	
	Если Объект.ДолиРаспределенияПоНоменкалтуре.Итог("Количество")>100 Тогда
		Сообщить("Общий процент по группе превышает 100%");	
		Отказ = Истина;
	КонецЕсли;
	
	ЗаписатьПроцентыРаспределенияНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьПланПродажНаСервере()
	
	ТаблицаПланПродаж = ПолучитьТаблицуПланПродаж();
	ЗаполнитьТаблицу(ТаблицаПланПродаж, Объект.ПланПродаж);
		
	ТаблицаДолиРаспределения = ПолучитьПредыдущееРаспределение();
    ЗаполнитьТаблицу(ТаблицаДолиРаспределения, Объект.ДолиРаспределенияПоНоменкалтуре);

КонецПроцедуры 

Процедура ЗаполнитьТаблицу(ИсходныеДанные, ТаблицаЗаполнения)
	
	ТаблицаЗаполнения.Очистить();
	
	Для Каждого СтрокаТЧ из ИсходныеДанные Цикл  
		
		НоваяСтрокаРаспределения = ТаблицаЗаполнения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРаспределения, СтрокаТЧ, "Номенклатура, ХарактеристикаНоменклатуры, Количество"); 
				
	КонецЦикла;  
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьПланПродаж(Команда)
	
	ЗагрузитьПланПродажНаСервере(); 
		
КонецПроцедуры

