
&НаКлиенте
Процедура ВыгрузитьНеуспешныеВУПП(Команда)
	ВыгрузитьНеуспешныеВУППНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНеуспешныеВУППНаСервере()
	Если не ЗначениеЗаполнено(ВидДокументов) Тогда
		ВызватьИсключение "Нужно выбрать вид документов!";
	КонецЕсли;                                           
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КСП_УПП_ОшибкиИмпорта.ГУИДДокументаУПП КАК ГУИДДокументаУПП
		|ИЗ
		|	РегистрСведений.КСП_УПП_ОшибкиИмпорта КАК КСП_УПП_ОшибкиИмпорта
		|ГДЕ
		|	КСП_УПП_ОшибкиИмпорта.ВидДокумента = &ВидДокумента
		|	И КСП_УПП_ОшибкиИмпорта.ОшибкаИсправлена = &ОшибкаИсправлена";
	
	Запрос.УстановитьПараметр("ВидДокумента", Строка(ВидДокументов));
	Запрос.УстановитьПараметр("ОшибкаИсправлена", Ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	_ВидДокументов = Строка(ВидДокументов);
	
	массивГУИДОВ = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		массивГУИДов.Добавить(
			Новый Структура("type,guid",
				_ВидДокументов,
				ВыборкаДетальныеЗаписи.ГУИДДокументаУПП));	
		
	КонецЦикла;
	
	ВыполнитьЭкспорт_Гуидов(МассивГУИДов);

КонецПроцедуры 

// Параметры
//	МассивГУИДов - массив - элементы: структура, тип+ГУИД объекта
// 				http://localhost:9090/pages/viewpage.action?pageId=67764256
Процедура ВыполнитьЭкспорт_Гуидов(МассивГУИДов) Экспорт

	Если МассивГУИДов.Количество() > 0 Тогда  
		
		// сформируем json-array
		ЗаписьJson = Новый ЗаписьJson;
		ЗаписьJson.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJson, МассивГУИДов);
		jsonGoods = ЗаписьJson.Закрыть();
		
		// добавим json-array в массив и выгрузим
		МассивОбъектовJson = Новый Массив;
		МассивОбъектовJson.Добавить(jsonGoods);
		 
		Попытка
		    ксп_ЭкспортСлужебный.ВыполнитьЭкспорт_СписокJsonИзМассива( 
				МассивОбъектовJson, "docs.export" );
		Исключение
		    т=ОписаниеОшибки();
		    ЗаписьЖурналаРегистрации("ИмпортИзУПП.НеуспешныеДокументыРеэкспорт", УровеньЖурналаРегистрации.Предупреждение,,,
		        "Ошибка экспорта массива ГУИДов из ЕРП в УПП. Подробности: "+т);
		КонецПопытки;
	КонецЕсли;

	
КонецПроцедуры


