Перем ИдВызова Экспорт;

// Возвращает этот объект, если запись в приемник возможна. Иначе - возвращает Неопределено.
Функция Конструктор(ИдВызова_, Знач ИмяЛога = Неопределено) Экспорт
	Если Метаданные.Справочники.Найти("мис_ЛогСообщений") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ИдВызова = ИдВызова_;
	Возврат ЭтотОбъект;
КонецФункции

//Параметры:
//	КраткоеОписание  	- Строка - Заголовок сообщения
//	ВидСообщения 		- ПеречислениеСсылка.мис_СтатусыСообщений - Статус сообщения. Если строка, то это шаблон поиска в типовых сообщениях по шаблону
//							СправочникСсылка.ТиповыеСообщения, 
//							Строка 
//	ДетальноеОписание 	- Строка - Подробное сообщение
//	Уровень - число - уровень логов. 1-дебаг,2-инфо,3-варн,4-ерр,5-крит,9-офф
//Возвращаемое значение:
//	Нет
Процедура ЗаписатьСообщение(Знач КраткоеОписание = "ИНФО", 
						ВидСообщения = Неопределено, 
						Знач ДетальноеОписание="",
						Знач Уровень = 2) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Спр 					= Справочники.мис_ЛогСообщений.СоздатьЭлемент();
	Спр.Наименование		= КраткоеОписание;
	Спр._Владелец			= ИдВызова;
	Спр.ВидСообщения 		= ВидСообщения;
	Спр.ДетальноеОписание	= ДетальноеОписание;
	Спр.ДатаВремя			= ТекущаяДатаСеанса(); 
	Попытка 
		Спр.Записать(); 
	Исключение
		ЗаписьЖурналаРегистрации(КраткоеОписание, 
			mis_LoggerServer.ВидСообщенияЖР(ВидСообщения), , , ДетальноеОписание,);
	КонецПопытки; 
		
КонецПроцедуры

 

