#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение) 
	
	Узел = КСП_ЭкспортСлужебныйПовтИсп.Константы_ксп_УзелОбменаRabbit();  
	
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		Возврат;
	КонецЕсли;

	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.status = "dostavlen-v-magazin" ИЛИ Запись.status = "send-to-delivery" Тогда 
						
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Запись.ЗаказКлиента);
			
		КонецЕсли;
	
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли