// Инициализация параметров сеанса.
// Параметры
//  ИменаПараметровСеанса - массив, неопределено - 
//                         в массиве имена параметров сеанса для инициализации
//
//  Возвращает массив имен установленных параметров сеанса
//
Функция УстановкаПараметровСеанса(ИменаПараметровСеанса) Экспорт
	
	// Параметры сеанса, инициализация которых требует обращения к одним и тем же данным
	// следует инициализировать сразу группой. Для того, чтобы избежать их повторной инициализации,
	// имена уже установленных параметров сеанса сохраняются в массиве УстановленныеПараметры
	УстановленныеПараметры = Новый Массив;
	
	//Если ИменаПараметровСеанса = Неопределено Тогда
	//	
	//	ПараметрыСеанса.СУУ_СохранитьЛоги = Ложь;
	//	УстановленныеПараметры.Добавить("СУУ_СохранитьЛоги");
	//	ПараметрыСеанса.СУУ_ИнтерактивныйНомерСоединенияСБД = НомерСоединенияИнформационнойБазы();
	//	УстановленныеПараметры.Добавить("СУУ_ИнтерактивныйНомерСоединенияСБД");
	//	
	//	Возврат УстановленныеПараметры;
	//	
	//Иначе
	//	
	//	Если ИменаПараметровСеанса.Найти("СУУ_СохранитьЛоги") <> Неопределено Тогда
	//	
	//		ПараметрыСеанса.СУУ_СохранитьЛоги = Ложь;
	//		УстановленныеПараметры.Добавить("СУУ_СохранитьЛоги");
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;

	мис_УправлениеЗаданиямиСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	
	mis_LoggerServer.УстановкаПараметровСеанса(ИменаПараметровСеанса);

	Возврат УстановленныеПараметры;
	
КонецФункции

