
&НаКлиенте
Процедура ОК(Команда)
	ЭтаФорма.Закрыть(СписокЗначений);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВБуфер(Команда)
	Значения = ПреобразоватьВXML(СписокЗначений.ВыгрузитьЗначения());
	ЗаписатьТекстВБуферОбмена(Значения);
КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзБуфера(Команда)
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьТекстВБуферОбмена (пСтрока)
	хОбъект = Новый COMОбъект("htmlfile");
	хОбъект.ParentWindow.ClipboardData.Setdata("Text", пСтрока);
	Возврат;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекстИзБуфераОбмена()
	Результат = Неопределено;
	хОбъект = Новый COMОбъект("htmlfile");
	Результат = хОбъект.ParentWindow.ClipboardData.Getdata("Text");
	Возврат Результат;
КонецФункции

Функция ПреобразоватьВXML(Значение)
	стр = XMLСтрока(Новый ХранилищеЗначения(Значение));
	Возврат стр;
КонецФункции

Функция ВернутьИЗXML(XML)
	Попытка
		Значение = XMLЗначение(Тип("ХранилищеЗначения"),XML).Получить();
	Исключение
		Значение = XML;
	КонецПопытки;
	Возврат Значение;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.СписокЗначений = Параметры.СписокЗначений;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если СписокЗначений.ДоступныеЗначения = Неопределено Тогда
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Тип") Тогда
			ТипЗначения = ВыбранноеЗначение;
		Иначе
			ТипЗначения = ТипЗнч(ВыбранноеЗначение);
			Возврат;
		КонецЕсли;
		Типы = Новый массив;
		Типы.Добавить(ТипЗначения);
		ЭтаФорма.СписокЗначений.ТипЗначения = Новый ОписаниеТипов(Типы);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Типы=ОпределитьТипЗначенийДляСпискаПоПервомуЭлементу();
	Если НЕ Типы = Неопределено Тогда
		ЭтаФорма.СписокЗначений.ТипЗначения = Новый ОписаниеТипов(Типы);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ОпределитьТипЗначенийДляСпискаПоПервомуЭлементу()
	// Определим тип списка по первому элементу
	Если СписокЗначений.Количество() >0 Тогда
		ПервыйЭлемент = СписокЗначений.Получить(0);
		Типы = Новый массив;
		Типы.Добавить(ТипЗнч(ПервыйЭлемент.Значение));
		Возврат Типы;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура Добавить_СУУ(Команда)
	// Вставить содержимое обработчика.

	Типы=ОпределитьТипЗначенийДляСпискаПоПервомуЭлементу();
	
	Если Типы = Неопределено Тогда
	
		спЗначений = Новый СписокЗначений();
		спЗначений.Добавить("Справочник");
		спЗначений.Добавить("Документ");
		спЗначений.Добавить("Перечисление");
		спЗначений.Добавить("План видов характеристик");
		спЗначений.Добавить("План счетов");
		элСписка = спЗначений.ВыбратьЭлемент("Выберите тип данных");
		
		Если элСписка=Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Типы = СоздатьТипыНаСервере(элСписка.Значение);
	КонецЕсли;
	
	ОписаниеТ = Новый ОписаниеТипов(Типы);
	
	а = Неопределено;
	Рез = ВвестиЗначение(а, "выберите значение", ОписаниеТ);
	
	Если Рез Тогда
		СписокЗначений.Добавить(а);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция СоздатьТипыНаСервере(ТипДанных)

	Типы = Новый Массив;
	
	Если ТипДанных = "Справочник" Тогда
		Для сч = 0 По Метаданные.Справочники.Количество()-1 Цикл
			Типы.Добавить(Тип("СправочникСсылка."+Метаданные.Справочники.Получить(сч).Имя));
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипДанных = "Документ" Тогда
		Для сч = 0 По Метаданные.Документы.Количество()-1 Цикл
			Типы.Добавить(Тип("ДокументСсылка."+Метаданные.Документы.Получить(сч).Имя));
		КонецЦикла;
	КонецЕсли;
	
	Если ТипДанных = "Перечисление" Тогда
		Для сч = 0 По Метаданные.Перечисления.Количество()-1 Цикл
			Типы.Добавить(Тип("ПеречислениеСсылка."+Метаданные.Перечисления.Получить(сч).Имя));
		КонецЦикла;
	КонецЕсли;
	
	Если ТипДанных = "План видов характеристик" Тогда
		Для сч = 0 По Метаданные.ПланыВидовХарактеристик.Количество()-1 Цикл
			Типы.Добавить(Тип("ПланВидовХарактеристикСсылка."+Метаданные.ПланыВидовХарактеристик.Получить(сч).Имя));
		КонецЦикла;
	КонецЕсли;
	
	Если ТипДанных = "План счетов" Тогда
		Для сч = 0 По Метаданные.ПланыСчетов.Количество()-1 Цикл
			Типы.Добавить(Тип("ПланСчетовСсылка."+Метаданные.ПланыСчетов.Получить(сч).Имя));
		КонецЦикла;
	КонецЕсли;
	
	Возврат Типы;
КонецФункции
