

&НаСервере
Процедура СоздатьСчетНаСервере(Заказ)
	Если не ЗначениеЗаполнено(ЭтотОбъект.Счет) Тогда
		НовыйСчет = Документы.СчетНаОплатуКлиенту.СоздатьДокумент();
		НовыйСчет.Дата = ТекущаяДата();
	Иначе
		НовыйСчет = ЭтотОбъект.Счет.ПолучитьОбъект();
	КонецЕсли;
	
	НовыйСчет.СуммаДокумента = ЭтотОбъект.Товары.Итог("Сумма");
	НовыйСчет.Записать();
	Для каждого текСтрока Из ЭтотОбъект.Товары Цикл
		Запись = РегистрыСведений.КСП_ВыставленныеСчетаПоСтрокамЗаказа.СоздатьМенеджерЗаписи();
		Запись.Заказ = Заказ;
		Запись.Счет = Счет;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СоздатьСчет(Команда)
	СоздатьСчетНаСервере(ЭтаФорма.ВладелецФормы.Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для каждого текСтрока Из ЭтаФорма.ВладелецФормы.Объект.Товары Цикл
		НоваяСтрока = ЭтаФорма.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, текСтрока);
	КонецЦикла;
КонецПроцедуры

