Функция СгенерироватьНовыйШтрихкодСертификата() Экспорт   
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МАКСИМУМ(ПодарочныеСертификаты.КСП_ШтрихкодЧисловой) КАК КСП_ШтрихкодЧисловой
		|ПОМЕСТИТЬ ВТ_МаксимальныйНомер
		|ИЗ
		|	Справочник.ПодарочныеСертификаты КАК ПодарочныеСертификаты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МаксимальныйНомер.КСП_ШтрихкодЧисловой + 1 КАК НовыйНомер
		|ИЗ
		|	ВТ_МаксимальныйНомер КАК ВТ_МаксимальныйНомер";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.НовыйНомер;
	КонецЦикла; 
	
КонецФункции