
&Перед("ПередЗаписью")
Процедура КСП_ПередЗаписью(Отказ)  
	
	Если НЕ ЗначениеЗаполнено(КСП_ШтрихкодЧисловой) Тогда 
		
		Если ЗначениеЗаполнено(ЭтотОбъект.Штрихкод) Тогда 
			
			КСП_ШтрихкодЧисловой = Число(ЭтотОбъект.Штрихкод);
			
		Иначе
			
			КСП_ШтрихкодЧисловой = Справочники.ПодарочныеСертификаты.СгенерироватьНовыйШтрихкодСертификата();
			
			ЭтотОбъект.Штрихкод = Строка(КСП_ШтрихкодЧисловой);
			
		КонецЕсли;		
		
	Иначе 
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Штрихкод) Тогда 
			
			ЭтотОбъект.Штрихкод = Строка(КСП_ШтрихкодЧисловой);
			
		КонецЕсли;
		
		
	КонецЕсли;


		
			
КонецПроцедуры 

&Перед("ОбработкаПроверкиЗаполнения")
Процедура КСП_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	
	
КонецПроцедуры
