
// Если в регистре есть запись, возвращает значение ресурса
// Иначе - возвращает ЛОЖЬ
//
// Параметры:
//	ВидДокументаУПП 	- спр ссыклка ксп_ВидыДокументовУПП - 
//	СкладПолучатель 	- спр ссыклка ксп_СкладыУПП - 
//	СкладОтправитель 	- спр ссыклка ксп_СкладыУПП - 
//
// Возвращаемое значение:
//	Тип: Булево
//
// Пример кода
//	Если Вычислить("РегистрыСведений.КСП_ОграниченияИмпортаДокументовУПП.РазрешитьИмпорт(ВидДокументаУППСсылка, СкладУПП, Неопределено)") = ЛОЖЬ Тогда
//		мЛоггер.инфо("Импорт документа запрещен в регистре %1. Документ : %2", "КСП_ОграниченияИмпортаДокументовУПП", ПредставлениеДокументаУПП);
//		Возврат
//
Функция РазрешитьИмпорт(ВидДокументаУПП, СкладПолучатель, СкладОтправитель = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рег.РазрешитьИмпорт КАК РазрешитьИмпорт
		|ИЗ
		|	РегистрСведений.КСП_ОграниченияИмпортаДокументовУПП КАК Рег
		|ГДЕ
		|	Рег.ВидДокументаУПП = &ВидДокументаУПП
		|	И Рег.СкладУПП = &СкладУПП
		|	";
	
	Запрос.УстановитьПараметр("ВидДокументаУПП", ВидДокументаУПП);
	Запрос.УстановитьПараметр("СкладУПП", СкладПолучатель);
	Если ЗначениеЗаполнено(СкладОтправитель) Тогда
		Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
		Запрос.Текст = Запрос.Текст + " И Рег.СкладОтправитель = &СкладОтправитель ";
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.РазрешитьИмпорт;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции
