
// Если в регистре есть запись, возвращает значение ресурса
// Иначе - возвращает ЛОЖЬ
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Булево
//
Функция ЗапретитьИмпорт(ВидДокументаУПП, СкладПолучатель, СкладОтправитель = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рег.ЗапретитьИмпорт КАК ЗапретитьИмпорт
		|ИЗ
		|	РегистрСведений.КСП_ОграниченияИмпортаДокументовУПП КАК Рег
		|ГДЕ
		|	Рег.ВидДокументаУПП = &ВидДокументаУПП
		|	И Рег.СкладУПП = &СкладУПП
		|	";
	
	Запрос.УстановитьПараметр("ВидДокументаУПП", ВидДокументаУПП);
	Запрос.УстановитьПараметр("СкладУПП", СкладПолучатель);
	Если ЗначениеЗаполнено(СкладОтправитель) Тогда
		Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
		Запрос.Текст = Запрос.Текст + " И Рег.СкладОтправитель = &СкладОтправитель ";
	КонецЕсли;
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ЗапретитьИмпорт;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции
