
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// регистр КСП_КурсовыеСоглашения
	Движения.КСП_КурсовыеСоглашения.Записывать = Истина;
	
	Для Каждого ТекСтрокаСоглашение Из Соглашение Цикл

		// Цена1
		Движение = Движения.КСП_КурсовыеСоглашения.Добавить();
		
		Движение.Период = Дата;
		Движение.Коллекция = Коллекция;
		Движение.КурсОт = ТекСтрокаСоглашение.КурсОт;
		Движение.КурсДо = ТекСтрокаСоглашение.КурсДо;
		Движение.ПроцентПредоплаты = ПроцентПредоплаты1;		
		Движение.ПроцентНаценки = ТекСтрокаСоглашение.Цена1;
		
		// Цена2
		Движение = Движения.КСП_КурсовыеСоглашения.Добавить();

		Движение.Период = Дата;
		Движение.Коллекция = Коллекция;
		Движение.КурсОт = ТекСтрокаСоглашение.КурсОт;
		Движение.КурсДо = ТекСтрокаСоглашение.КурсДо;
		Движение.ПроцентПредоплаты = ПроцентПредоплаты2;		
		Движение.ПроцентНаценки = ТекСтрокаСоглашение.Цена2;
		
		// Цена3
		Движение = Движения.КСП_КурсовыеСоглашения.Добавить();

		Движение.Период = Дата;
		Движение.Коллекция = Коллекция;
		Движение.КурсОт = ТекСтрокаСоглашение.КурсОт;
		Движение.КурсДо = ТекСтрокаСоглашение.КурсДо;
		Движение.ПроцентПредоплаты = ПроцентПредоплаты3;
		Движение.ПроцентНаценки = ТекСтрокаСоглашение.Цена3;
		
		// Цена ПроцентПредоплатыСоСвободногоСклада
		Движение = Движения.КСП_КурсовыеСоглашения.Добавить();

		Движение.Период = Дата;
		Движение.Коллекция = Коллекция;
		Движение.КурсОт = ТекСтрокаСоглашение.КурсОт;
		Движение.КурсДо = ТекСтрокаСоглашение.КурсДо;
		Движение.ПроцентПредоплаты = 0;
		Движение.ПроцентНаценки = ТекСтрокаСоглашение.ПроцентПредоплатыСоСвободногоСклада;
		
	КонецЦикла;

КонецПроцедуры
