
Процедура ОткрытьОтчетПоЛогу(ИдВызова, ТолькоОшибки = Ложь, Владелец = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(ИдВызова) Тогда
		Возврат;
	КонецЕсли;
	
	УсловияОтбора = Новый Структура("Индекс", ИдВызова);
	
	ПараметрыФормы = Новый Структура("СформироватьПриОткрытии, ИндексЛога, ТолькоОшибки",
		Истина, ИдВызова, ТолькоОшибки);
		
	ОткрытьФорму("Отчет.мис_ОтчетПоЛогу.ФормаОбъекта", ПараметрыФормы, Владелец, ИдВызова);

КонецПроцедуры

Процедура ОткрытьОтчетПоЛогуФайлы(ИдВызова, ТолькоОшибки = Ложь) Экспорт

	Если НЕ ЗначениеЗаполнено(ИдВызова) Тогда
		Возврат;
	КонецЕсли;
	
	УсловияОтбора = Новый Структура("Индекс", ИдВызова);
	
	ПараметрыФормы = Новый Структура("СформироватьПриОткрытии, ИндексЛога, ТолькоОшибки",
		Истина, ИдВызова, ТолькоОшибки);
		
	ОткрытьФорму("Отчет.ОтчетПоФайловомуЛогу.ФормаОбъекта", ПараметрыФормы, , ИдВызова);

КонецПроцедуры

