
// +++ РАБОТА С КОНСТАНТАМИ +++
Функция ПолучитьЗначениеКонстанты(имяКонстанты) Экспорт
	
	таб = crm_RetailCRMПовтИсп.ПолучитьКонстанты()["константы"];
	ЗначениеКонстанты = Неопределено;
	СтрокаТЗ = таб.Найти(ИмяКонстанты,"Название");
	Если СтрокаТЗ <> Неопределено Тогда 
		ЗначениеКонстанты = СтрокаТЗ.Значение 
	КонецЕсли;
	
	Возврат ЗначениеКонстанты;
	
КонецФункции

Функция ПолучитьКонстанты() Экспорт
	
	Настройки = ХранилищеОбщихНастроек.Загрузить("retailCRM_константы", "КонстантыОбмена");
	
	Если Не Настройки = Неопределено И ТипЗнч(Настройки) = Тип("Структура") Тогда
	Иначе
		ВызватьИсключение "Настройки RetailCRM восстановить не удалось";
	КонецЕсли;
	
	Возврат  Настройки;
	
КонецФункции

