
// +++ РАБОТА С КОНСТАНТАМИ +++
Функция ПолучитьЗначениеКонстанты(имяКонстанты) Экспорт
	
	//таб = crm_RetailCRMПовтИсп.ПолучитьКонстанты()["константы"];
	Настройки = crm_RetailCRMПовтИсп.ПолучитьКонстанты();
	
	//ЗначениеКонстанты = Неопределено;
	//СтрокаТЗ = таб.Найти(ИмяКонстанты,"Название");
	//Если СтрокаТЗ <> Неопределено Тогда 
	//	ЗначениеКонстанты = СтрокаТЗ.Значение 
	//КонецЕсли;
	
	Если Настройки.Свойство(имяКонстанты) Тогда
		Возврат Настройки[имяКонстанты];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	//Возврат Настройка;
	
КонецФункции

Функция ПолучитьКонстанты() Экспорт
	
	//Настройки = ХранилищеОбщихНастроек.Загрузить("retailCRM_константы", "КонстантыОбмена");
	
	Настройки = ПланыВидовХарактеристик.КСП_НастройкиRetailCRM.ПолучитьНастройкиГруппы("elis");
	
	//Если Не Настройки = Неопределено И ТипЗнч(Настройки) = Тип("Структура") Тогда
	//Иначе
	//	ВызватьИсключение "Настройки RetailCRM восстановить не удалось";
	//КонецЕсли;
	
	Возврат  Настройки;
	
КонецФункции

Функция ПолучитьДоговорКонтрагента(ХозОперация, Валюта, Контрагент, Организация) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Контрагент = &Контрагент
		|	И ДоговорыКонтрагентов.Организация = &Организация
		|	И ДоговорыКонтрагентов.ХозяйственнаяОперация = &ХозяйственнаяОперация
		|	И ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов
		|	И ДоговорыКонтрагентов.Статус = &Статус
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозОперация);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", Валюта);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДоговоровКонтрагентов.Действует);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Договор = Неопределено;
	Пока Выборка.Следующий() Цикл
		Договор = Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Договор;	
	
КонецФункции
