#Область НастройкиПоУмолчанию

// Заполняет настройки, влияющие на использование плана обмена.
//
// Параметры:
//   Настройки - Структура - настройки плана обмена по умолчанию, см. ОбменДаннымиСервер.НастройкиПланаОбменаПоУмолчанию,
//                           описание возвращаемого значения функции.
//
Процедура ПриПолученииНастроек(Настройки) Экспорт
	
	Настройки.ИмяКонфигурацииИсточника = "УправлениеПредприятием";

	Настройки.ИмяКонфигурацииПриемника.Вставить("УПП", Неопределено);
	
	Настройки.ПредупреждатьОНесоответствииВерсийПравилОбмена	= Ложь;
	Настройки.ПланОбменаИспользуетсяВМоделиСервиса				= Истина;
	
	Настройки.Алгоритмы.ПриПолученииВариантовНастроекОбмена				= Истина;
	Настройки.Алгоритмы.ПриПолученииОписанияВариантаНастройки			= Истина;
	Настройки.Алгоритмы.НастроитьИнтерактивнуюВыгрузку					= Истина;
	Настройки.Алгоритмы.НастроитьИнтерактивнуюВыгрузкуВМоделиСервиса	= Истина;
	Настройки.Алгоритмы.ПредставлениеОтбораИнтерактивнойВыгрузки		= Истина;
	
КонецПроцедуры

// Заполняет набор параметров, определяющих вариант настройки обмена.
//
// Параметры:
//   ОписаниеВарианта       - Структура - набор варианта настройки по умолчанию,
//                                        см. ОбменДаннымиСервер.ОписаниеВариантаНастройкиОбменаПоУмолчанию,
//                                        описание возвращаемого значения.
//   ИдентификаторНастройки - Строка    - идентификатор варианта настройки обмена.
//   ПараметрыКонтекста     - Структура - см. ОбменДаннымиСервер.ПараметрыКонтекстаПолученияОписанияВариантаНастройки,
//                                        описание возвращаемого значения функции.
//
Процедура ПриПолученииОписанияВариантаНастройки(ОписаниеВарианта, ИдентификаторНастройки, ПараметрыКонтекста) Экспорт
	
	ОписаниеВарианта.ИмяКонфигурацииКорреспондента = "УПП";
	
	ОписаниеВарианта.ИмяФайлаНастроекДляПриемника = НСтр("ru = 'Настройки обмена УП-УПП';
														|en = 'ERP-UPP exchange settings'");
	
	ОписаниеВарианта.ЗаголовокКомандыДляСозданияНовогоОбменаДанными	= ЗаголовокКомандыДляСозданияНовогоОбменаДанными();
	ОписаниеВарианта.НаименованиеКонфигурацииКорреспондента			= ЗаголовокКомандыДляСозданияНовогоОбменаДанными();
	ОписаниеВарианта.ИспользоватьПомощникСозданияОбменаДанными		= Истина;
	ОписаниеВарианта.ИспользуемыеТранспортыСообщенийОбмена =
		ОбменДаннымиСервер.ВсеТранспортыСообщенийОбменаКонфигурации();
	ОписаниеВарианта.КраткаяИнформацияПоОбмену = 
		НСтр("ru = 'Данная настройка позволит синхронизировать данные между программами 
		|""1С:ERP Управление предприятием, редакция 2"", и ""1С:УПП, редакция 1.3"".';
		|en = 'With this setting, you can synchronize data between 
		|1C:ERP 2 (Enterprise Resource Management) and 1C:UPP 1.3.'");
	ОписаниеВарианта.ПодробнаяИнформацияПоОбмену =
		"ПланОбмена.КСП_ИнтеграцияУПП13.Форма.ПодробнаяИнформация";
	ОписаниеВарианта.ЗаголовокПомощникаСозданияОбмена =
		НСтр("ru = 'Настройка синхронизации с 1С:УПП, ред. 1.3';
			|en = 'Setting of synchronization with 1C:UPP 1.3'");
	ОписаниеВарианта.ЗаголовокУзлаПланаОбмена = НСтр("ru = 'Синхронизация с 1С:УПП, ред. 1.3';
													|en = 'Synchronization with 1C:UPP 1.3'");
	
КонецПроцедуры

#КонецОбласти

// Возвращает представление команды создания нового обмена данными.
//
// Возвращаемое значение:
//   Строка - представление команды, выводимое в пользовательском интерфейсе.
//
// Пример:
//	Возврат НСтр("ru = 'Создать обмен в распределенной информационной базе'");
//
Функция ЗаголовокКомандыДляСозданияНовогоОбменаДанными() Экспорт
	
	Возврат НСтр("ru = '1С:УПП, ред. 1.3';
				|en = '1C:UPP, ver. 1.3'");
	
КонецФункции


#Область Прочее

// Заполняет коллекцию вариантов настроек, предусмотренных для плана обмена.
//
// Параметры:
//   ВариантыНастроекОбмена - ТаблицаЗначений - коллекция вариантов настроек обмена, см. описание возвращаемого значения
//                                        функции НастройкиПланаОбменаПоУмолчанию общего модуля ОбменДаннымиСервер.
//   ПараметрыКонтекста     - Структура - см. ОбменДаннымиСервер.ПараметрыКонтекстаПолученияВариантовНастроек,
//                                        описание возвращаемого значения функции.
//
Процедура ПриПолученииВариантовНастроекОбмена(ВариантыНастроекОбмена, ПараметрыКонтекста) Экспорт
	
	ВариантНастройки = ВариантыНастроекОбмена.Добавить();
	
	ВариантНастройки.КорреспондентВМоделиСервиса   = Истина;
	ВариантНастройки.КорреспондентВЛокальномРежиме = Истина;
	
	ВариантНастройки.ИдентификаторНастройки = "ER";
	
КонецПроцедуры

#КонецОбласти

