
Процедура ксп_ПриЗаписиДокументаПриЗаписи(Источник, Отказ) Экспорт

	ВыполнитьРегистрацию = Ложь;
	НеРегистрироватьКОбменуRabbitMQ = Неопределено;
	Успешно = Источник.ДополнительныеСвойства.Свойство("НеРегистрироватьКОбменуRabbitMQ", НеРегистрироватьКОбменуRabbitMQ);
	Если Успешно Тогда
		Если НеРегистрироватьКОбменуRabbitMQ = Истина Тогда
			//Свойство есть, там Истина - не выполняем регистрацию в плане обмена
			Возврат; 
		Иначе 
			ВыполнитьРегистрацию = Истина;
		КонецЕсли;
	Иначе 
		//Свойства нет - регистрируем
		ВыполнитьРегистрацию = Истина;
	КонецЕсли;

	Если ВыполнитьРегистрацию = Истина Тогда
		Узел = ксп_ЭкспортСлужебныйПовтИсп.Константы_ксп_УзелОбменаRabbit();
		Если НЕ ЗначениеЗаполнено(Узел) Тогда
			
			ЗаписьЖурналаРегистрации("Экспорт_из_ЕРП", УровеньЖурналаРегистрации.Предупреждение,,Источник.Ссылка,
				"Не установлена константа ксп_УзелОбменаRabbit! Регистрация справочника в плане обмена Кодерлайн_интеграция не выполнена!");
			Возврат;
		КонецЕсли;

		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Источник.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ксп_ПриЗаписиСправочникаПриЗаписи(Источник, Отказ) Экспорт
	
	ВыполнитьРегистрацию = Ложь;
	НеРегистрироватьКОбменуRabbitMQ = Неопределено;
	Успешно = Источник.ДополнительныеСвойства.Свойство("НеРегистрироватьКОбменуRabbitMQ", НеРегистрироватьКОбменуRabbitMQ);
	Если Успешно Тогда
		Если НеРегистрироватьКОбменуRabbitMQ = Истина Тогда
			//Свойство есть, там Истина - не выполняем регистрацию в плане обмена
			Возврат; 
		Иначе 
			ВыполнитьРегистрацию = Истина;
		КонецЕсли;
	Иначе 
		//Свойства нет - регистрируем
		ВыполнитьРегистрацию = Истина;
	КонецЕсли;

	Если ВыполнитьРегистрацию = Истина Тогда
		Узел = ксп_ЭкспортСлужебныйПовтИсп.Константы_ксп_УзелОбменаRabbit();
		Если НЕ ЗначениеЗаполнено(Узел) Тогда
			
			ЗаписьЖурналаРегистрации("Экспорт_из_ЕРП", УровеньЖурналаРегистрации.Предупреждение,,Источник.Ссылка,
				"Не установлена константа ксп_УзелОбменаRabbit! Регистрация справочника в плане обмена Кодерлайн_интеграция не выполнена!");
			Возврат;
		КонецЕсли;

		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Источник.Ссылка);
	КонецЕсли;
	
КонецПроцедуры
