
&НаСервере
Процедура КСП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ЭлементОтбора = Расшифровка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
      

     ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Регистратор"); 
      

     ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
      

     ЭлементОтбора.Использование = Истина; 
      

     ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
      

     ЭлементОтбора.ПравоеЗначение = Объект.Ссылка; 
КонецПроцедуры
