
&После("ПриОпределенииОбъектовСКомандамиПечати")
Процедура КСП_ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов)
	
	СписокОбъектов.Добавить(Документы.ТаможеннаяДекларацияЭкспорт);
	// < Кодерлайн Софт-портал 2024.07.16 Добрыгин Михаил
	// Добавил для появление кнопок печати в своих объектах
	СписокОбъектов.Добавить(Документы.КСП_ЧекЛистПроверкиКачестваПряжи);
	СписокОбъектов.Добавить(Документы.КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов);
	СписокОбъектов.Добавить(Документы.КСП_АктПриемкиПоКачеству); 
	СписокОбъектов.Добавить(Документы.КСП_ПроверочнаяВедомость);
	// >  Кодерлайн Софт-портал 2024.07.16 Добрыгин Михаил   
	
	
КонецПроцедуры
