// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт   
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ПустаяСсылка()));
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = ВРЕГ("РезультатыТестовогоОтвяза");
	КомандаПечати.Представление = "Результаты тестового отвяза";
	КомандаПечати.МенеджерПечати    = ОбъектМетаданных.ПолноеИмя();
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.Порядок = 10; 	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт    	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;                                                            	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РезультатыТестовогоОтвяза") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РезультатыТестовогоОтвяза", "Чек Лист", ПечатьРезультатовТестовогоОтвяза(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПечатьРезультатовТестовогоОтвяза(МассивСсылок, ОбъектыПечати = Неопределено) Экспорт
	Ссылка= МассивСсылок.Получить(0);
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 10;
	ТабДок.ПолеСлева = 20;
	ТабДок.ПолеСнизу = 10;
	ТабДок.ПолеСправа = 10;
	ТабДок.ТолькоПросмотр = Истина;
	
	Макет = ПолучитьМакет("РезультатыТестовогоОтвяза");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицыПоОтвязам = Макет.ПолучитьОбласть("ШапкаТаблицыПоОтвязам");
	ОбластьСтрокаТаблицыПоОтвязам = Макет.ПолучитьОбласть("СтрокаТаблицыПоОтвязам");
	ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель");
	ОбластьШапкаТаблицыКонтрольКачества = Макет.ПолучитьОбласть("ШапкаТаблицыКонтрольКачества");
	ОбластьСтрокаТаблицыКонтрольКачества = Макет.ПолучитьОбласть("СтрокаТаблицыКонтрольКачества");
	ОбластьИзображенияДефектов = Макет.ПолучитьОбласть("ИзображенияДефектов");
	
	ПутьКПапкеИзображенийПоЧекЛистамПроверкиТестовыхОтвязов = Константы.ксп_ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваТестовыхОтвязов.Получить();
	ПустаяКартинка = Новый Картинка;
	ФИОПроверил = ФизическиеЛицаУТ.ФамилияИмяОтчество(Ссылка.Проверил.ФизическоеЛицо, Ссылка.Дата);
	ОбластьЗаголовок.Параметры.Проверил = ФИОПроверил.Фамилия + " " + ФИОПроверил.Имя + " " + ФИОПроверил.Отчество;
	ТоварыИзПоступления = Ссылка.ДокументОснование.ДокументОснование.ДокументОснование.Товары;
	ТоварыИзЧекЛистаПряжи = Ссылка.ДокументОснование.Товары;
	Для Каждого СтрокаТовары Из Ссылка.Товары Цикл
		Если СтрокаТовары.НомерСтроки <> 1 Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабДок.Вывести(ОбластьЗаголовок);
		ТабДок.Вывести(ОбластьШапкаТаблицыПоОтвязам);
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОбластьСтрокаТаблицыПоОтвязам);
		ОбластьСтрокаТаблицыПоОтвязам.Параметры.Заполнить(Ссылка);   		
		ОбластьСтрокаТаблицыПоОтвязам.Параметры.Заполнить(СтрокаТовары);
		//СтруктураПоискаТовара = Новый Структура;
		//СтруктураПоискаТовара.Вставить("Номенклатура", СтрокаТовары.Номенклатура);
		//СтруктураПоискаТовара.Вставить("ХарактеристикаНоменклатуры", СтрокаТовары.ХарактеристикаНоменклатуры.ХарактеристикаОснование);
		//СтруктураПоискаТовара.Вставить("ЕдиницаИзмерения", СтрокаТовары.ЕдиницаИзмерения);
		//СтрокаТоварИзПоступления = ТоварыИзПоступления.НайтиСтроки(СтруктураПоискаТовара);
		//Если СтрокаТоварИзПоступления.Количество() = 0 Тогда
		//	Сообщить("В поступлении не найдена номенклатура " + СтрокаТовары.Номенклатура + " " + СтрокаТовары.ХарактеристикаНоменклатуры.ХарактеристикаОснование + " с единицей измерения " + СтрокаТовары.ЕдиницаИзмерения, СтатусСообщения.Важное);
		//Иначе
		//	ОбластьСтрокаТаблицыПоОтвязам.Параметры.КоличествоВПоставке = СтрокаТоварИзПоступления[0].Количество;
		//КонецЕсли;
		СтруктураПоискаТовара = Новый Структура;
		СтруктураПоискаТовара.Вставить("Номенклатура", СтрокаТовары.Номенклатура);
		СтруктураПоискаТовара.Вставить("Характеристика", СтрокаТовары.Характеристика);
		СтруктураПоискаТовара.Вставить("ЕдиницаИзмерения", СтрокаТовары.ЕдиницаИзмерения);
		СтрокаТоварИзЧекЛистаПряжи = ТоварыИзЧекЛистаПряжи.НайтиСтроки(СтруктураПоискаТовара);
		Если СтрокаТоварИзЧекЛистаПряжи.Количество() = 0 Тогда
			Сообщить("В чек листе проверки качества пряжи не найдена номенклатура " + СтрокаТовары.Номенклатура + " " + СтрокаТовары.ХарактеристикаНоменклатуры.ХарактеристикаОснование + " с единицей измерения " + СтрокаТовары.ЕдиницаИзмерения, СтатусСообщения.Важное);
		Иначе
			ОбластьСтрокаТаблицыПоОтвязам.Параметры.ДатаВизуальногоОсмотра = СтрокаТоварИзЧекЛистаПряжи[0].ВизуальныйОсмотрДатаЗавершенияПроверки;
		КонецЕсли;
		ТабДок.Вывести(ОбластьСтрокаТаблицыПоОтвязам);
		ТабДок.Вывести(ОбластьРазделитель);
		ТабДок.Вывести(ОбластьШапкаТаблицыКонтрольКачества);
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОбластьСтрокаТаблицыКонтрольКачества);
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("КлючСтроки", СтрокаТовары.КлючСтроки); 		
		ПунктыПроверкиКонтроляКачества = Ссылка.КонтрольКачества.НайтиСтроки(СтруктураОтбора);
		Для Каждого СтрокаКонтрольКачества Из ПунктыПроверкиКонтроляКачества Цикл			
			ОбластьСтрокаТаблицыКонтрольКачества.Параметры.Заполнить(СтрокаКонтрольКачества);
			Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок, МассивОбластейДляПроверки) Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДок.Вывести(ОбластьШапкаТаблицыКонтрольКачества);
			КонецЕсли;
			ТабДок.Вывести(ОбластьСтрокаТаблицыКонтрольКачества);
		КонецЦикла;
		
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОбластьИзображенияДефектов);
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("КлючСтроки", СтрокаТовары.КлючСтроки); 
		ФотоДефектов = Ссылка.ФотоДефектов.НайтиСтроки(СтруктураОтбора);
		ИндексФото = 1;
		Для Каждого СтрокаФотоДефектов Из ФотоДефектов Цикл
			Файл = ПутьКПапкеИзображенийПоЧекЛистамПроверкиТестовыхОтвязов + СтрЗаменить(СтрокаФотоДефектов.ПутьКФайлу, ".\\", "\");
			Выполнить("ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта" + ИндексФото + ".Картинка = Новый Картинка(Файл)");
			Если ИндексФото < 4 Тогда
				ИндексФото = ИндексФото + 1;
			Иначе
				ИндексФото = 1;
				ТабДок.Вывести(ОбластьИзображенияДефектов);
			КонецЕсли;
		КонецЦикла;
		Если ИндексФото <= 4 Тогда
			Для ТекущийИндексФото = ИндексФото По 4 Цикл
				Выполнить("ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта" + ТекущийИндексФото + ".Картинка = Новый Картинка");
			КонецЦикла;
			ТабДок.Вывести(ОбластьИзображенияДефектов);
		КонецЕсли;
	КонецЦикла; 
		
	Возврат ТабДок;
КонецФункции
