Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	РегламентированнаяОтчетность.ДобавитьПрефиксОрганизации(ЭтотОбъект, Префикс);
КонецПроцедуры 

Функция ПолучитьПунктыПроверкиДляАвтозаполнения(ЭтапПроверки)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПунктыПроверкиКачестваПоЧекЛистам.Ссылка КАК ПунктПроверки
		|ИЗ
		|	Справочник.КСП_ПунктыПроверкиКачестваПоЧекЛистам КАК ПунктыПроверкиКачестваПоЧекЛистам
		|ГДЕ
		|	ПунктыПроверкиКачестваПоЧекЛистам.ПометкаУдаления = ЛОЖЬ
		|	И ПунктыПроверкиКачестваПоЧекЛистам.АвтоматическиВключатьВЧекЛисты = ИСТИНА
		|	И ПунктыПроверкиКачестваПоЧекЛистам.ЭтапПроверки = &ЭтапПроверки";
	
	Запрос.УстановитьПараметр("ЭтапПроверки", ЭтапПроверки);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьДанныеДляЗаполненияТовары(ЧекЛистПроверкиКачестваПряжи)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекЛистПроверкиКачестваПряжиТовары.Номенклатура,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Характеристика,
		|	ЧекЛистПроверкиКачестваПряжиТовары.ЕдиницаИзмерения,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Коэффициент,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Количество,
		|	ЧекЛистПроверкиКачестваПряжиТовары.ПоЛотам
		|ИЗ
		|	Документ.КСП_ЧекЛистПроверкиКачестваПряжи.Товары КАК ЧекЛистПроверкиКачестваПряжиТовары
		|ГДЕ
		|	ЧекЛистПроверкиКачестваПряжиТовары.Ссылка = &ЧекЛистПроверкиКачестваПряжи";
	
	Запрос.УстановитьПараметр("ЧекЛистПроверкиКачестваПряжи", ЧекЛистПроверкиКачестваПряжи);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПроверкаЗавершенностиКонтроляКачестваПряжи(ЧекЛистПроверкиКачестваПряжи)
	ПроверкаКачестваПряжиЗавершена = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекЛистПроверкиКачестваПряжиТовары.Номенклатура,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Характеристика,
		|	ЧекЛистПроверкиКачестваПряжиТовары.НомерСтроки,
		|	""Визуальный осмотр"" КАК ЭтапКонтроля
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.КСП_ЧекЛистПроверкиКачестваПряжи.Товары КАК ЧекЛистПроверкиКачестваПряжиТовары
		|ГДЕ
		|	ЧекЛистПроверкиКачестваПряжиТовары.Ссылка = &ЧекЛистПроверкиКачестваПряжи
		|	И ЧекЛистПроверкиКачестваПряжиТовары.ВизуальныйОсмотрПроверкаЗавершена = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекЛистПроверкиКачестваПряжиТовары.Номенклатура,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Характеристика,
		|	ЧекЛистПроверкиКачестваПряжиТовары.НомерСтроки,
		|	""Контрольная перемотка""
		|ИЗ
		|	Документ.КСП_ЧекЛистПроверкиКачестваПряжи.Товары КАК ЧекЛистПроверкиКачестваПряжиТовары
		|ГДЕ
		|	ЧекЛистПроверкиКачестваПряжиТовары.Ссылка = &ЧекЛистПроверкиКачестваПряжи
		|	И ВЫБОР
		|			КОГДА ЧекЛистПроверкиКачестваПряжиТовары.Ссылка.КонтрольнаяПеремоткаНеПроводилась
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ЧекЛистПроверкиКачестваПряжиТовары.КонтрольнаяПеремоткаПроверкаЗавершена = ЛОЖЬ
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Номенклатура,
		|	ВТ.Характеристика,
		|	ВТ.НомерСтроки КАК НомерСтроки,
		|	ВТ.ЭтапКонтроля КАК ЭтапКонтроля
		|ИЗ
		|	ВТ КАК ВТ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтапКонтроля,
		|	НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ";
	
	Запрос.УстановитьПараметр("ЧекЛистПроверкиКачестваПряжи", ЧекЛистПроверкиКачестваПряжи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПроверкаКачестваПряжиЗавершена = Ложь;
		Сообщить("В документе основании по номенклатуре " + ВыборкаДетальныеЗаписи.Номенклатура + " " + ВыборкаДетальныеЗаписи.Характеристика + " в строке " + ВыборкаДетальныеЗаписи.НомерСтроки + " не был выполнен контроль качества на этапе " + ВыборкаДетальныеЗаписи.ЭтапКонтроля + ".", СтатусСообщения.Внимание);
	КонецЦикла;
	
	Если Не ПроверкаКачестваПряжиЗавершена Тогда
		Сообщить("Ввод на основании невозможен. Сначала завершите контроль качества!", СтатусСообщения.Важное);
	КонецЕсли;
	
	Возврат ПроверкаКачестваПряжиЗавершена;
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КСП_ЧекЛистПроверкиКачестваПряжи") Тогда
		Если Не ПроверкаЗавершенностиКонтроляКачестваПряжи(ДанныеЗаполнения) Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения;
		Комментарий = "Введен на основании документа " + ДанныеЗаполнения; 
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ДатаПоступления = ДанныеЗаполнения.ДокументОснование.ДокументОснование.Дата;
		ПунктыПроверкиДляАвтозаполнения = ПолучитьПунктыПроверкиДляАвтозаполнения(Перечисления.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.ТестовыйОтвяз);
        Товары.Загрузить(ПолучитьДанныеДляЗаполненияТовары(ДанныеЗаполнения));
		КонтрольКачества.Очистить();
		ФотоДефектов.Очистить();
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			ТекСтрокаТовары.КлючСтроки = Новый УникальныйИдентификатор;
			Для Каждого ПунктПроверкиДляАвтозаполнения Из ПунктыПроверкиДляАвтозаполнения Цикл
				СтрокаПунктКонтроляКачества = КонтрольКачества.Добавить();
				СтрокаПунктКонтроляКачества.КлючСтроки = ТекСтрокаТовары.КлючСтроки;
				СтрокаПунктКонтроляКачества.ПунктПроверки = ПунктПроверкиДляАвтозаполнения.ПунктПроверки;
				СтрокаПунктКонтроляКачества.КлючСтрокиДляСвязиСФото = Новый УникальныйИдентификатор;
			КонецЦикла;
		КонецЦикла;   
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТаблицуПроверкаКачестваТестовыхОтвязовПоЧекЛистам()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Ссылка.Организация,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Ссылка.Контрагент,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Ссылка.ДатаПоступления,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Ссылка.ПлановаяДатаЗавершенияПретензионнойРаботы,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Ссылка.ДатаПотребности,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Номенклатура,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Характеристика,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Количество * ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Коэффициент КАК Количество,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.КоличествоДляТестовогоОтвяза * ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Коэффициент КАК КоличествоДляТестовогоОтвяза,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.КоличествоБрака * ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Коэффициент КАК КоличествоБрака,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.ПроцентИзмененияНормыВремениВязания,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.ПроцентИзмененияНормыВремениПошива,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.ПроцентИзмененияНормыРасходаПряжи,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.СогласованиеОтклонения,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Комментарий,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.ПроверкаЗавершена,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.ДатаЗавершенияПроверки,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.ПроцентПотерьНаВходномКонтроле,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.СуммаПотерьНаВходномКонтроле,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов.Товары КАК ЧекЛистПроверкиКачестваТестовыхОтвязовТовары
		|ГДЕ
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборДвижений = Движения.КСП_ПроверкаКачестваТестовыхОтвязовПоЧекЛистам;  
	НаборДвижений.мТаблицаДвижений   = ПолучитьТаблицуПроверкаКачестваТестовыхОтвязовПоЧекЛистам();
	НаборДвижений.ВыполнитьДвижения();
КонецПроцедуры
