
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.СценарииОбменовДанными.Форма.НастройкаРасписанияОбменовДанными"
	//,ПараметрыФормы
	//,ПараметрыВыполненияКоманды.Источник
	//,ПараметрыВыполненияКоманды.Уникальность
	//,ПараметрыВыполненияКоманды.Окно
	//,ПараметрыВыполненияКоманды.НавигационнаяСсылка,
	//,РежимОткрытияОкнаФормы.Независимый);
	
	ОткрытьФорму("Справочник.СценарииОбменовДанными.Форма.НастройкаРасписанияОбменовДанными"
	,,,,,,,РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры 

