
&НаКлиенте
Процедура ДобавитьСчет(Команда)
	//ОткрытьФорму("Документ.ЗаказКлиента.Форма.КСП_ВыборНомменклатуры");
	ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Заказ",ЭтаФорма.Заказ);
	//ПараметрыФормы.Вставить("Счет",ЭтаФорма.Элементы.Счета.ТекущаяСтрока.Счет);
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.КСП_ВыборНоменклатуры", ПараметрыФормы, ЭтаФорма.ВладелецФормы);
КонецПроцедуры

&НаСервере
Процедура ИзменитьСчетНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСчет(Команда)
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.КСП_ВыборНоменклатуры");
	ИзменитьСчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуКлиенту.Ссылка КАК Счет
		|ИЗ
		|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ЭтотОбъект.Счета.Загрузить(РезультатЗапроса);

КонецПроцедуры
