
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ДобавитьНовыйДокумент(ДокСсылка) Экспорт
	
	НЗ = РегистрыСведений.КСП_ОчередьОбменаСЧестнымЗнаком.СоздатьНаборЗаписей();
	НЗ.Отбор.ДвиженияКМ.Установить(ДокСсылка);
	
	МоментВремениМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	НЗ.Отбор.МоментВремениМС.Установить(МоментВремениМС);
	
	НовСтр = НЗ.Добавить();
	НовСтр.ДвиженияКМ = ДокСсылка;
	НовСтр.МоментВремениМС = МоментВремениМС;
	НовСтр.ДатаВремяСобытия = ТекущаяДатаСеанса();
	НовСтр.Операция = "Новый";
	НовСтр.Состояние = "Новый";
	
	НЗ.Записать();
		
КонецПроцедуры


// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ГУИДДокумента(ДвиженияКМСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рег.ГУИДвЧестномЗнаке КАК ГУИДвЧестномЗнаке
		|ИЗ
		|	РегистрСведений.КСП_ОчередьОбменаСЧестнымЗнаком КАК Рег
		|ГДЕ
		|	Рег.ДвиженияКМ = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Рег.МоментВремениМС УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", ДвиженияКМСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
		
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ГУИДвЧестномЗнаке) Тогда
			Возврат Выборка.ГУИДвЧестномЗнаке;
		КонецЕсли;
    КонецЦикла;
		
	Возврат "";
	
КонецФункции
