
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ПоМэппингу(МагазинГУИД, ВнешняяСистема) Экспорт
	
	Если ТипЗнч(МагазинГУИД) = Тип("Строка") Тогда
		ГуИД = МагазинГУИД;
	ИначеЕсли ТипЗнч(МагазинГУИД) = Тип("Структура") Тогда
		Если МагазинГУИД.Свойство("Ref") Тогда
			ГУИД = МагазинГУИД.Ref;
		Иначе 
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ксп_МэппингМагазинСклад.Склад КАК Склад
		|ИЗ
		|	РегистрСведений.ксп_МэппингМагазинСклад КАК ксп_МэппингМагазинСклад
		|ГДЕ
		|	ксп_МэппингМагазинСклад.МагазинГУИД = &МагазинГУИД
		|	И ксп_МэппингМагазинСклад.ВнешняяСистема = &ВнешняяСистема";
	
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	Запрос.УстановитьПараметр("МагазинГУИД", ГУИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Склад;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	Возврат Неопределено;
	
КонецФункции





Функция ЕстьГУИД(GUID, ВнешняяСистема) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ 1
		|ИЗ
		|	РегистрСведений.ксп_МэппингМагазинСклад КАК Рег
		|ГДЕ
		|	Рег.МагазинГУИД = &GUID
		|	И Рег.ВнешняяСистема = &ВнешняяСистема";
	
	Запрос.УстановитьПараметр("GUID", GUID);
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Возврат НЕ РезультатЗапроса.Пустой();
		
КонецФункции


// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ДобавитьГУИД(GUID, Наименование, ВнешняяСистема) Экспорт
	
	НЗ = РегистрыСведений.ксп_МэппингМагазинСклад.СоздатьНаборЗаписей();
	НЗ.Отбор.МагазинГУИД.Установить(GUID);
	НЗ.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
	стрк = НЗ.Добавить();
	стрк.МагазинГУИД = GUID;
	стрк.МагазинНаименование = Наименование;  
	стрк.ВнешняяСистема = ВнешняяСистема;	
	НЗ.Записать();
		
КонецПроцедуры


Функция НаименованиеМагазина(МагазинГУИД, ВнешняяСистема) Экспорт
	
	Если ТипЗнч(МагазинГУИД) = Тип("Строка") Тогда
		ГуИД = МагазинГУИД;
	ИначеЕсли ТипЗнч(МагазинГУИД) = Тип("Структура") Тогда
		Если МагазинГУИД.Свойство("Ref") Тогда
			ГУИД = МагазинГУИД.Ref;
		Иначе 
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ксп_МэппингМагазинСклад.МагазинНаименование КАК МагазинНаименование
		|ИЗ
		|	РегистрСведений.ксп_МэппингМагазинСклад КАК ксп_МэппингМагазинСклад
		|ГДЕ
		|	ксп_МэппингМагазинСклад.МагазинГУИД = &МагазинГУИД
		|	И ксп_МэппингМагазинСклад.ВнешняяСистема = &ВнешняяСистема";
	
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	Запрос.УстановитьПараметр("МагазинГУИД", ГУИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.МагазинНаименование;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
