#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

&НаСервере
Функция ПечатьСписанияНаСервере() 
	МассивОбъектов = Новый Массив;
    МассивОбъектов.Добавить(Объект.Ссылка); 
	Возврат Документы.КСП_ПроверочнаяВедомость.ПечатьНакладнаяНаФурнитуру(МассивОбъектов, Новый СписокЗначений);
КонецФункции

&НаКлиенте
Процедура ПечатьСписания(Команда)
	Если ЗначениеЗаполнено(Объект.ДокументСписания) Тогда
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Объект.Ссылка); 
		ТабДок = ПечатьСписанияНаСервере();; 	
		// 2. Открытие сформированной печатной формы
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("НАКЛАДНАЯНАФУРНИТУРУ");
		КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок; 
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,, ЭтотОбъект);
	Иначе
		Сообщить("Документ списания ещё не сделан");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьЛотНаСервере()
	КонецПроцедуры

&НаКлиенте
Процедура СоздатьЛот(Команда)
	Если Не Объект.СпецТипНакладной=ПредопределенноеЗначение("Перечисление.КСП_СпецТипНакладной.ПряжаЛот") тогда 
		Сообщить("Действует только для типа документа Пряжа(Лот)",60);
		возврат;
	КонецЕсли;
	//ОбработкаПряжа=Обработки.КСП_СозданиеХарактеристикСерий.Создать();
	//ОбработкаПряжа.СтрокаВладельца=Элементы.Товары.ТекущаяСтрока;
	ПараметрыФормы = Новый Структура("Номенклатура,Характеристика",Объект.Номенклатура,Объект.Характеристика);
	ФормаПряжаЛот=ПолучитьФорму("Обработка.КСП_СозданиеХарактеристикСерий.Форма.ПряжаЛот",ПараметрыФормы);
	ФормаПряжаЛот.Открыть();

	СоздатьЛотНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПересчетЕдИзмНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПересчетЕдИзм(Команда)
	ПересчетЕдИзмНаСервере();
КонецПроцедуры

&НаСервере
Процедура РаспределитьКвоПоставщикаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьКвоПоставщика(Команда)
	РаспределитьКвоПоставщикаНаСервере();
КонецПроцедуры

&НаСервере
Функция ПечатьПВНаСервере()
	//ТабДок=Новый ТабличныйДокумент ;
	//ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПроверочнаяВедомость";	
	//Макет=РеквизитФормыВЗначение("Объект").ПолучитьМакет("ПроверочнаяВедомость") ;
	////Заполнение основной шапки
	//Шапка1=Макет.ПолучитьОбласть("Шапка1");
	//ОблСтрока=Макет.ПолучитьОбласть("Строка");
	//ОблПодвал=Макет.ПолучитьОбласть("Подвал");
	//
	//Шапка1.Параметры.Фирма=Организация;
	//Шапка1.Параметры.Номер=сокрлп(Номер);
	//Шапка1.Параметры.ДокументОснованиеНомер=сокрлп(ДокументОснование.Номер);
	//Шапка1.Параметры.ДокументОснованиеДата=сокрлп(ДокументОснование.Дата);
	//Шапка1.Параметры.Номенклатура=Номенклатура;
	//Шапка1.Параметры.ХарактеристикаНоменклатуры=ХарактеристикаНоменклатуры;
	//Шапка1.Параметры.Контрагент=Контрагент;
	//Отбор=новый Структура;
	//Отбор.Вставить("Номенклатура",Номенклатура);
	//Отбор.Вставить("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	//Отбор.Вставить("ЕдиницаИзмерения",ЕдиницаИзмерения);
	//НайдСтрока=ДокументОснование.Товары.НайтиСтроки(Отбор);
	//ОбщееКоличествоПоНакладной=НайдСтрока[0].Количество;
	//Шапка1.Параметры.ОбщееКоличествоПоНакладной=ОбщееКоличествоПоНакладной;
	//Шапка1.Параметры.ОбщееКоличество=ОбщееКоличество;
	//Шапка1.Параметры.ДатаПромера=сокрлп(Дата);
	//ПостуПТоваров= ДокументОснование.ПолучитьОбъект().ВернутьПоступлениеТоваровУслуг();
	//Если  ЗначениеЗаполнено(ПостуПТоваров) тогда
	//	//Попытаемся найти счет фактуру
	//	СчетФактура = УчетНДС.НайтиПодчиненныйДокумент(ПостуПТоваров.Ссылка,"СчетФактураПолученный",Истина);
	//	Если ЗначениеЗаполнено(СчетФактура) Тогда
	//		Шапка1.Параметры.СчФ = СчетФактура.НомерВходящегоДокумента+" от "+СчетФактура.ДатаВходящегоДокумента;
	//	КонецЕсли;	                                              
	//КонецЕсли;
	//Шапка1.Параметры.КондиционныйПроц="";
	////}Курдюмов А.Н.
	//Если ДокументОснование.СпецТипНакладной=Перечисления.СпецТипНакладной.ПряжаЛот Тогда
	//	СтрокаОрдера=ПолучитьСтрокуПриходногоОрдера();
	//	ДопустимыйМинимум=СтрокаОрдера.КоличествоНакладной*(1-ПроцентКондиции/100);
	//	ПроцентКолОтОбщегоКондиционногоОбъема=Окр(100-ОбщееКоличество*100/ДопустимыйМинимум,1);
	//	СуммаНедостачи= Окр(ПолучитьСуммуПоступленияПоНоменклатуре(СтрокаОрдера.Номенклатура,СтрокаОрдера.ХарактеристикаНоменклатуры)*ПроцентКолОтОбщегоКондиционногоОбъема/100,2);
	//	Шапка1.Параметры.КондиционныйПроц="% кондиционности "+СокрЛП(ПроцентКондиции)+"%. Допустимый мин.="+СокрЛП(Окр(ОбщееКоличествоПоНакладной*(1-ПроцентКондиции/100),3))+"кг.";
	//КонецЕсли; 
	//
	//
	//
	//ТабДок.Вывести(Шапка1) ;
	////Заполнение  шапки табл части
	//Шапка=Макет.ПолучитьОбласть("Шапка");
	//ТабДок.Вывести(Шапка) ;
	//Для каждого ТекСтрока Из Товары Цикл
	//	ОблСтрока.Параметры.Заполнить(ТекСтрока);
	//	ОблСтрока.Параметры.Проц="";
	//	ТабДок.Вывести(ОблСтрока) ;
	//КонецЦикла;
	//ПроцентКолОтОбщегоОбъема=Окр(100-ОбщееКоличество*100/ОбщееКоличествоПоНакладной,1);
	//СуммаНедостачи= Окр(ПолучитьСуммуПоступленияПоНоменклатуре(Номенклатура,ХарактеристикаНоменклатуры)*ПроцентКолОтОбщегоОбъема/100,2);
	//ОблПодвал.Параметры.Проц=ПроцентКолОтОбщегоОбъема;
	//ОблПодвал.Параметры.КоличествоПоставщика=ОбщееКоличествоПоНакладной;
	//ОблПодвал.Параметры.Количество=ОбщееКоличество;
	//ОблПодвал.Параметры.КоличествоБрак=Товары.Итог("КоличествоБрак");
	//ОблПодвал.Параметры.ИзлишкиФакт=0;
	//ОблПодвал.Параметры.НедостачаФакт=0;
	//ОблПодвал.Параметры.НедостачаСверхНормы=0;
	//ОблПодвал.Параметры.СуммаПретензии=0;
	//ДопустимыйМинимум=ОбщееКоличествоПоНакладной*(1-ПроцентКондиции/100);
	//
	//Если ОбщееКоличествоПоНакладной<ОбщееКоличество Тогда
	//	ОблПодвал.Параметры.ИзлишкиФакт=ОбщееКоличество-ОбщееКоличествоПоНакладной;	
	//иначеЕсли ОбщееКоличествоПоНакладной>ОбщееКоличество Тогда
	//	ОблПодвал.Параметры.НедостачаФакт=ОбщееКоличествоПоНакладной-ОбщееКоличество;
	//	Если ДокументОснование.СпецТипНакладной=Перечисления.СпецТипНакладной.ПряжаЛот Тогда
	//		ДопустимыйМинимум=ОбщееКоличествоПоНакладной*(1-ПроцентКондиции/100);
	//		Если ОбщееКоличество<ДопустимыйМинимум Тогда
	//			ПроцентКолОтОбщегоОбъема=Окр(100-ОбщееКоличество*100/ОбщееКоличествоПоНакладной,1);
	//			ПроцентКолОтОбщегоОбъема=Макс(ПроцентКолОтОбщегоОбъема-ПроцентКондиции,0);
	//			СуммаНедостачи= Окр(ПолучитьСуммуПоступленияПоНоменклатуре(Номенклатура,ХарактеристикаНоменклатуры)*ПроцентКолОтОбщегоОбъема/100,2);
	//		КонецЕсли; 
	//	иначе	
	//		Если ПроцентКолОтОбщегоОбъема>2  Тогда
	//			ОблПодвал.Параметры.НедостачаСверхНормы=ОбщееКоличествоПоНакладной-ОбщееКоличество;
	//			ОблПодвал.Параметры.СуммаПретензии=СуммаНедостачи;
	//		КонецЕсли; 
	//	КонецЕсли; 
	//КонецЕсли; 
	//ТабДок.Вывести(ОблПодвал) ;
	//Возврат ТабДок;	
КонецФункции

&НаКлиенте
Процедура ПечатьПВ(Команда)  
	Если Не Объект.Завершена Тогда
		Предупреждение("Проверочная ведомость должна быть Завершена и проведена",60);
		возврат ;
	КонецЕсли; 
	
	ТабДок = ПечатьПВНаСервере(); 
	ТабДок.Показать() ;
КонецПроцедуры


// СтандартныеПодсистемы.Печать 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.Печать 
// СтандартныеПодсистемы.ПодключаемыеКоманды 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда) 
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект); 
КонецПроцедуры 
&НаСервере 
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) 
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат); 
КонецПроцедуры 
&НаКлиенте 
Процедура Подключаемый_ОбновитьКоманды() 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды       
&НаКлиенте 
Процедура ПриОткрытии(Отказ) 
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
КонецПроцедуры 
&НаСервере 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Если ТипЗнч(Объект.ДокументОснование.Распоряжение) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
			 Объект.Распоряжение =Объект.ДокументОснование.Распоряжение;
		КонецЕсли;
	КонецЕсли; 
	ИспользоватьУпаковочныеЛисты = ложь;
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаТовары;
	КонецЕсли;
	 
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма);
	
	//
	НоменклатураСервер.УстановитьУсловноеОформлениеСерийНоменклатуры(ЭтаФорма,
																		"СерииВсегдаВТЧТовары");
	//

	НоменклатураСервер.УстановитьУсловноеОформлениеСтатусовУказанияСерий(ЭтаФорма,
																			Истина);
	//


КонецПроцедуры 
&НаСервере 
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	СтруктураДляПараметров = Новый Структура("Дата,Склад",Объект.Дата,Объект.ДокументОснование.Склад);
	ПараметрыУказанияСерий =Документы.КСП_ПроверочнаяВедомость.ПараметрыУказанияСерий(СтруктураДляПараметров);
	//ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.КСП_ПроверочнаяВедомость));
	УстановитьВидимостьЭлементовСерий();
	

КонецПроцедуры 
&НаСервере
Процедура ПодготовитьЗаполнитьУстановитьВидимостьСерий()
	
	//ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.КСП_ПроверочнаяВедомость));
	//ПараметрыУказанияСерий.Вставить("Склад",Объект.ДокументОснование.Склад);
	СтруктураДляПараметров = Новый Структура("Дата,Склад",Объект.Дата,Объект.ДокументОснование.Склад);
	ПараметрыУказанияСерий =Документы.КСП_ПроверочнаяВедомость.ПараметрыУказанияСерий(СтруктураДляПараметров);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	УстановитьВидимостьЭлементовСерий();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовСерий()
	
	Элементы.ТоварыСтатусУказанияСерий.Видимость = ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры;
	Элементы.ТоварыУказатьСерии.Видимость = ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияПриИзменении(Элемент)
	ВыбранноеЗначение = НоменклатураКлиентСервер.ВыбраннаяСерия();
	
	ВыбранноеЗначение.Значение            		 = Элементы.Товары.ТекущиеДанные.Серия;
	ВыбранноеЗначение.ИдентификаторТекущейСтроки = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
	
	НоменклатураКлиент.ОбработатьУказаниеСерии(ЭтаФорма, ПараметрыУказанияСерий, ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерий(Элемент.ТекстРедактирования);
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСерииПоРаспоряжениюСервер(КэшированныеЗначения)
	
	Заполнены = Документы.ПриходныйОрдерНаТовары.ЗаполнитьСерииПоРаспоряжению(Объект, Истина);	
	Если Заполнены Тогда
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
		ЗаполнитьСлужебныеРеквизитыТЧТовары(Истина,КэшированныеЗначения);
	КонецЕсли;
	
	Возврат Заполнены;
КонецФункции      
&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыТЧТовары(Перенумеровать = Истина, КэшированныеЗначения = Неопределено)
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьВесОбъем");
	СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
		Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры",
		Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул",
		Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействий.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	
	УпаковочныеЛистыСервер.ЗаполнитьСлужебныеРеквизиты(ЭтаФорма, Объект.Товары, СтруктураДействий, ,Перенумеровать, КэшированныеЗначения);
	
	// Для заполнения признака ШтрихкодНеОпределен получим данные по штрихкодам
	ТЗШтрихкоды = Объект.Товары.Выгрузить(,"Штрихкод");
	ТЗШтрихкоды.Свернуть("Штрихкод");
	МассивШтрихкодов = ТЗШтрихкоды.ВыгрузитьКолонку("Штрихкод");
	
	КешированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодам(КешированныеЗначения, МассивШтрихкодов);
	
	Если Объект.Товары.НайтиСтроки(Новый Структура("ЭтоУпаковочныйЛист", Истина)).Количество() > 0 Тогда
		Документы.УпаковочныйЛист.ДополнитьДанныеПоШтрихкодам(КешированныеЗначения, МассивШтрихкодов);
	КонецЕсли;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакТовМестаТребуетсяОбработка");
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Штрихкод)
			Или ЗначениеЗаполнено(КешированныеЗначения.Штрихкоды[СтрокаТЧ.Штрихкод])
				И КешированныеЗначения.Штрихкоды[СтрокаТЧ.Штрихкод].Количество() > 0 Тогда
			СтрокаТЧ.ШтрихкодНеОпределен = 0;
		Иначе
			СтрокаТЧ.ШтрихкодНеОпределен = 1;
		КонецЕсли;
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, Неопределено);
	КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьПодборСерий(Текст = "", ТекущиеДанные = Неопределено)
	
	Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма, ПараметрыУказанияСерий, Текст, ТекущиеДанные)Тогда
		
		Если ТекущиеДанные = Неопределено Тогда
			ТекущиеДанныеИдентификатор = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
		Иначе
			ТекущиеДанныеИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
		КонецЕсли;

		ПараметрыФормыУказанияСерий = ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор);
		
		ЗначениеВозврата = Неопределено;

		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьПодборСерийЗавершение",
														ЭтотОбъект,
														Новый Структура("ПараметрыФормыУказанияСерий", ПараметрыФормыУказанияСерий));
		
		ОткрытьФорму(ПараметрыФормыУказанияСерий.ИмяФормы,
						ПараметрыФормыУказанияСерий,
						ЭтаФорма
						,
						,
						,
						,
						ОписаниеОповещения,
						РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборСерийЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ПараметрыФормыУказанияСерий = ДополнительныеПараметры.ПараметрыФормыУказанияСерий;
    
    
    ЗначениеВозврата = Результат;
    
    Если ЗначениеВозврата <> Неопределено Тогда
        ОбработатьУказаниеСерийСервер(ПараметрыФормыУказанияСерий);
    КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура ОткрытьПодборСерийПриСканированииШтрихкодаНоменклатуры()
	
	Если ТекущиеДанныеИдентификатор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(ТекущиеДанныеИдентификатор);
	ОткрытьПодборСерий(,ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор)
	
	Возврат НоменклатураСервер.ПараметрыФормыУказанияСерий(Объект, ПараметрыУказанияСерий, ТекущиеДанныеИдентификатор, ЭтаФорма);
	
КонецФункции


&НаСервере
Процедура ОбработатьУказаниеСерийСервер(ПараметрыФормыУказанияСерий)
	
	Действия = Новый Структура;
	Действия.Вставить("ОбновлятьКоличествоТоваровПриРегистрацииСерий", Истина);
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ЭтотОбъект, Действия);
	Действия.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	Действия.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	Действия.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	Действия.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
	Действия.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	Действия.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	Действия.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	Действия.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	Действия.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	Действия.Вставить("ПересчитатьВесОбъем");
	
	НоменклатураСервер.ОбработатьУказаниеСерий(Объект, ПараметрыУказанияСерий, ПараметрыФормыУказанияСерий, Действия);
	
	УпаковочныеЛистыСервер.ПеренумероватьСтроки(ЭтотОбъект, Объект.Товары);
	
КонецПроцедуры
 &НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(Форма, Действия)
	
	Действия.Вставить("ПересчитатьКоличествоЕдиниц");
	Действия.Вставить("ПересчитатьВесОбъем");
	Действия.Вставить("ПроверитьСериюРассчитатьСтатус",
			Новый Структура("Склад, ПараметрыУказанияСерий", Форма.Объект.ДокументОснование.Склад, Форма.ПараметрыУказанияСерий));
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьСерии(Команда)
	
	ОткрытьПодборСерий();
	
КонецПроцедуры
