
// Создает запись при загрузке КМ от оператора фулфилмента (Profashion solutions)
//
// Параметры:
//	ДокДвиженияКМФулфилмент 	- док ссылка  - ДвиженияКМФулфилмент
//
Процедура ДобавитьЗаписьСПустымВыводомИзОборота(ДокДвиженияКМФулфилмент) Экспорт
	
	НЗ = РегистрыСведений.ксп_ВыводИзОборотаИСМП.СоздатьНаборЗаписей();
	НЗ.Отбор.ДвиженияКМФулфилмент.Установить(ДокДвиженияКМФулфилмент);
	НЗ.Отбор.ВыводИзОборотаИСМП.Установить(Неопределено);
	
	НовСтр = НЗ.Добавить();
	НовСтр.ДвиженияКМФулфилмент = ДокДвиженияКМФулфилмент;
	НовСтр.ВыводИзОборотаИСМП = Неопределено;
	НовСтр.ВремяСоздания = ТекущаяДатаСеанса();
	
	НЗ.Записать();
		
КонецПроцедуры


// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ДобавитьВыводИзОборота(ДокДвиженияКМФулфилмент, ВыводИзОборотаИСМП) Экспорт

	НЗ = РегистрыСведений.ксп_ВыводИзОборотаИСМП.СоздатьНаборЗаписей();
	НЗ.Отбор.ДвиженияКМФулфилмент.Установить(ДокДвиженияКМФулфилмент);
	НЗ.Очистить();
	
	НовСтр = НЗ.Добавить();
	НовСтр.ДвиженияКМФулфилмент = ДокДвиженияКМФулфилмент;
	НовСтр.ВыводИзОборотаИСМП = ВыводИзОборотаИСМП;
	НовСтр.ВремяСоздания = ТекущаяДатаСеанса();
	
	НЗ.Записать();
	
КонецПроцедуры
