
// Создает запись при загрузке КМ от оператора фулфилмента (Profashion solutions)
//
// Параметры:
//	ДокДвиженияКМФулфилмент 	- док ссылка  - ДвиженияКМФулфилмент
//
Процедура ДобавитьЗаписьСПустымВыводомИзОборота(ДокДвиженияКМФулфилмент) Экспорт
	
	НЗ = РегистрыСведений.ксп_ВыводИзОборотаИСМП.СоздатьНаборЗаписей();
	НЗ.Отбор.ДвиженияКМФулфилмент.Установить(ДокДвиженияКМФулфилмент);
		
	НовСтр = НЗ.Добавить();
	НовСтр.ДвиженияКМФулфилмент = ДокДвиженияКМФулфилмент;
	
	НовСтр.ВыводИзОборотаИСМП = Неопределено;
	
	НовСтр.ВремяСобытия = ТекущаяДатаСеанса();
	НовСтр.СтатусДокумента = Перечисления.КСП_СтатусыЗаказовДляВыводаИзОборота.Новый;
	
	НЗ.Записать();
		
КонецПроцедуры


// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ДобавитьВыводИзОборота(ДокДвиженияКМФулфилмент, ВыводИзОборотаИСМП) Экспорт

	МЗ = РегистрыСведений.ксп_ВыводИзОборотаИСМП.СоздатьМенеджерЗаписи();
	МЗ.ДвиженияКМФулфилмент = ДокДвиженияКМФулфилмент;
	МЗ.Прочитать();
	Если НЕ МЗ.Выбран() Тогда
		Возврат;
	КонецЕсли;

	МЗ.ДвиженияКМФулфилмент = ДокДвиженияКМФулфилмент;
	МЗ.ВыводИзОборотаИСМП 	= ВыводИзОборотаИСМП;
	МЗ.ВремяСобытия 		= ТекущаяДатаСеанса();
	МЗ.СтатусДокумента 		= Перечисления.КСП_СтатусыЗаказовДляВыводаИзОборота.ВыводИзОборотаСоздан;
	
	МЗ.Записать();
	
КонецПроцедуры
