
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ПоМэппингу(ВнешняяСистема, Контрагент, Договор) Экспорт
	
	Запрос = Новый Запрос;        
	
	Если НЕ ЗначениеЗаполнено(Договор) Тогда

		Запрос.Текст = 
			"ВЫБРАТЬ
			|	рег.Соглашение КАК Соглашение
			|ИЗ
			|	РегистрСведений.ксп_СоглашенияСПартнерамиДляИнтеграций КАК рег
			|ГДЕ
			|	рег.Контрагент = &Контрагент
			|	И рег.ВнешняяСистема = &ВнешняяСистема";
		
	Иначе 
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	рег.Соглашение КАК Соглашение
			|ИЗ
			|	РегистрСведений.ксп_СоглашенияСПартнерамиДляИнтеграций КАК рег
			|ГДЕ
			|	рег.Контрагент = &Контрагент
			|	И рег.Договор = &Договор
			|	И рег.ВнешняяСистема = &ВнешняяСистема";

	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("ВнешняяСистема", СокрЛП(ВнешняяСистема));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		возврат ВыборкаДетальныеЗаписи.Соглашение;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
