
Функция НаименованиеСПризнаками(СокрКод = "") Экспорт
	
	//Если НЕ ПроверкаПКНаЗадвоенность() тогда
	//СокрКод = ?(ЗначениеЗаполнено(Оттенок),СокрЛП(Оттенок),"0")+"-";	
	
	Для каждого Стр из ПризнакиКачества Цикл
		СокрКод = СокрКод+СокрЛП(Стр.Признак.Код);
	КонецЦикла;	
	
	Возврат СокрКод;
	
	//КонецЕсли;	
	
КонецФункции	

Функция ПроверкаПКНаЗадвоенность(Отказ = Ложь) экспорт
	
	ТЗ = ПризнакиКачества.Выгрузить();    	          
	ТЗ.Свернуть("Признак");
	Если ПризнакиКачества.Количество()<>ТЗ.Количество() тогда
		#Если Клиент Тогда
			Предупреждение("В табличной части ""Признаки качества"" задвоен признак! ",10);
		#КонецЕсли	
		Отказ = Истина;
	КонецЕсли;    	 
	Возврат Отказ;
	
КонецФункции	

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	//чтобы пользователи не создавали новые группы
	Если ЭтоНовый() И ЭтоГруппа тогда
		Отказ = Истина;
		Возврат;
	ИначеЕсли Предопределенный  тогда
		Если Не РольДоступна("ПолныеПрава") тогда
			Отказ = Истина;
		КонецЕсли;
		Возврат;		
	//ИначеЕсли РольДоступна("КомплектовщикТкани") тогда  //ДМВ в ерп нет такой роли
	//		Родитель = Справочники.Качество.ПризнакиКачества;
	КонецЕсли;	 
	
	Если Не ЭтоНовый() И (Ссылка.Родитель<>Родитель) И Не РольДоступна("ПолныеПрава") Тогда
		#Если Клиент Тогда
		Предупреждение("Нельзя изменять родителя!") ;
		#КонецЕсли			
		Отказ = Истина ;
		Возврат ;
	КонецЕсли;
	
	// Курмак А.В. ++ 13.01.2023 г.
	//Если Не ЭтоГруппа тогда
	Если Не ЭтоГруппа И Не РольДоступна("ПолныеПрава") тогда
	// Курмак А.В. --
		Если ПризнакиКачества.Количество() = 0 тогда
			#Если Клиент Тогда
				Предупреждение("В табличной части ""Признаки качества"" не заполнены признаки! ",10);
			#КонецЕсли			
			Отказ = Истина;
			Возврат;
		Иначе
			ПризнакиКачества.Сортировать("Признак Возр");
			Отказ        = ПроверкаПКНаЗадвоенность();   	
			Код 		 = НаименованиеСПризнаками(); 
			Наименование = Код;
		КонецЕсли;	
	КонецЕсли;		
	
КонецПроцедуры



