
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура КСП_ПриОткрытииПосле(Отказ)
	
	УстановитьВидимостьЭлементовФормыНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КСП_КСП_УровеньПриИзмененииПосле(Элемент)
	
	УстановитьВидимостьЭлементовФормыНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИмяТаблицы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементовФормыНаКлиенте()
	
	Если Объект.КСП_Уровень = ПредопределенноеЗначение("Перечисление.КСП_УровениКоллекций.Год") Тогда
		
		Элементы.ГруппаДатаНачалаОкончания.Видимость = Ложь;
		Элементы.ГруппаУправлениеКоллекцией.Видимость = Ложь;
		Элементы.ГруппаДополнительныеРеквизиты.Видимость = Ложь;
		Элементы.ГруппаЦветаФирменногоСтиля.Видимость = Ложь;
		
	ИначеЕсли Объект.КСП_Уровень = ПредопределенноеЗначение("Перечисление.КСП_УровениКоллекций.Сезон") Тогда
		
		Элементы.ГруппаДатаНачалаОкончания.Видимость = Ложь;
		Элементы.ГруппаУправлениеКоллекцией.Видимость = Ложь;
		Элементы.ГруппаДополнительныеРеквизиты.Видимость = Ложь;
		Элементы.ГруппаЦветаФирменногоСтиля.Видимость = Ложь;
		
	ИначеЕсли Объект.КСП_Уровень = ПредопределенноеЗначение("Перечисление.КСП_УровениКоллекций.Проект") Тогда
		
		Элементы.ГруппаДатаНачалаОкончания.Видимость = Ложь;
		Элементы.ГруппаУправлениеКоллекцией.Видимость = Ложь;
		Элементы.ГруппаДополнительныеРеквизиты.Видимость = Истина;
		Элементы.ГруппаЦветаФирменногоСтиля.Видимость = Ложь;
		
	ИначеЕсли Объект.КСП_Уровень = ПредопределенноеЗначение("Перечисление.КСП_УровениКоллекций.Коллекция") Тогда
		
		Элементы.ГруппаДатаНачалаОкончания.Видимость = Ложь;
		Элементы.ГруппаУправлениеКоллекцией.Видимость = Ложь;
		Элементы.ГруппаДополнительныеРеквизиты.Видимость = Ложь;
		Элементы.ГруппаЦветаФирменногоСтиля.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаДатаНачалаОкончания.Видимость = Ложь;
		Элементы.ГруппаУправлениеКоллекцией.Видимость = Ложь;
		Элементы.ГруппаДополнительныеРеквизиты.Видимость = Ложь;
		Элементы.ГруппаЦветаФирменногоСтиля.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
