
&НаСервере
Процедура КСП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	КСП_ПрограммноеДобавлениеИзменениеРеквизитовЭлементов();
	
КонецПроцедуры

Процедура КСП_ПрограммноеДобавлениеИзменениеРеквизитовЭлементов()

	// Добавление новых элементов
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КСП_РежимРасчетаКурсовогоКоэффициента", Тип("ПолеФормы"), Элементы.ГруппаДополнительныеРеквизиты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.КСП_РежимРасчетаКурсовогоКоэффициента";

КонецПроцедуры

