// +++ УваровДС 14/12/2023
// заново добавил кнопку печать

#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
&После("ДобавитьКомандыПечати")
Процедура КСП_ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Декларация
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ТаможеннаяДекларацияЭкспорт";
	КомандаПечати.Идентификатор = "Декларация";                     
	//КомандаПечати.МестоРазмещения = "<ИмяПодменюНаФорме>";
	КомандаПечати.Представление = НСтр("ru = 'Декларация о происхождении товара'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Выписка из прайс-листа продукции
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ТаможеннаяДекларацияЭкспорт";
	КомандаПечати.Идентификатор = "ВыпискаИзПрайсЛиста";                     
	//КомандаПечати.МестоРазмещения = "<ИмяПодменюНаФорме>";
	КомандаПечати.Представление = НСтр("ru = 'Выписка из прайс-листа продукции'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Реализация товаров штрих-коды
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ТаможеннаяДекларацияЭкспорт";
	КомандаПечати.Идентификатор = "РеализацияТоваровШтрихКоды";                     
	//КомандаПечати.МестоРазмещения = "<ИмяПодменюНаФорме>";
	КомандаПечати.Представление = НСтр("ru = 'Реализация товаров штрих-коды'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Реализация товаров
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ТаможеннаяДекларацияЭкспорт";
	КомандаПечати.Идентификатор = "РеализацияТоваров";                     
	//КомандаПечати.МестоРазмещения = "<ИмяПодменюНаФорме>";
	КомандаПечати.Представление = НСтр("ru = 'Реализация товаров'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Спецификация
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ТаможеннаяДекларацияЭкспорт";
	КомандаПечати.Идентификатор = "Спецификация";                     
	//КомандаПечати.МестоРазмещения = "<ИмяПодменюНаФорме>";
	КомандаПечати.Представление = НСтр("ru = 'Спецификация'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

#КонецОбласти


// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати – Структура – дополнительные настройки печати;
//  КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
//  ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
//                                            представление – имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Декларация") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"Декларация",
		НСтр("ru = 'КСП ПФ MXL Декларация'"),
		ПечатьДекларация(МассивОбъектов, ОбъектыПечати), ,
		"Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_Декларация");
		
		ПараметрыВывода.ЗаголовокФормы = "Декларация " + Строка(МассивОбъектов[0].Ссылка);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВыпискаИзПрайсЛиста") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ВыпискаИзПрайсЛиста",
		НСтр("ru = 'КСП ПФ MXL Выписка из прайс листа'"),
		ПечатьВыпискаИзПрайсЛиста(МассивОбъектов, ОбъектыПечати), ,
		"Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_ВыпискаИзПрайсЛиста");	
		
		ПараметрыВывода.ЗаголовокФормы = "Выписка из прайс-листа " + Строка(МассивОбъектов[0].Ссылка);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеализацияТоваровШтрихКоды") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"РеализацияТоваровШтрихКоды",
		НСтр("ru = 'КСП ПФ MXL Реализация товаров штрих коды'"),
		ПечатьРеализацияТоваровШтрихКоды(МассивОбъектов, ОбъектыПечати), ,
		"Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_РеализацияТоваровШтрихКоды");	
		
		ПараметрыВывода.ЗаголовокФормы = "Реализация товаров штрих-коды " + Строка(МассивОбъектов[0].Ссылка);	
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеализацияТоваров") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"РеализацияТоваров",
		НСтр("ru = 'КСП ПФ MXL Реализация товаров'"),
		ПечатьРеализацияТоваров(МассивОбъектов, ОбъектыПечати), ,
		"Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_РеализацияТоваров");
		
		ПараметрыВывода.ЗаголовокФормы = "Реализация товаров " + Строка(МассивОбъектов[0].Ссылка);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Спецификация") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"Спецификация",
		НСтр("ru = 'КСП ПФ MXL Спецификация'"),
		ПечатьСпецификация(МассивОбъектов, ОбъектыПечати), ,
		"Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_Спецификация");
		
		ПараметрыВывода.ЗаголовокФормы = "Спецификация " + Строка(МассивОбъектов[0].Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры      

Функция ПечатьДекларация(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Декларация";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_Декларация");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьРеквизиты = Макет.ПолучитьОбласть("Реквизиты");
	
	ОбластьНаименование = Макет.ПолучитьОбласть("Наименование");
	
	ОбластьФутер = Макет.ПолучитьОбласть("Футер");
	
	ДокументПередачаТоваров = МассивОбъектов[0].ДокументОснование;
	
	// Получаем запросом необходимые данные.
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.НаименованиеПолное КАК НаименованиеПолное,
	|	Организации.КПП КАК КПП,
	|	Организации.ИНН КАК ИНН,
	|	Организации.ОГРН КАК ОГРН,
	|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	БанковскиеСчетаОрганизаций.НомерСчета КАК НомерСчета,
	|	БанковскиеСчетаОрганизаций.КоррСчетБанка КАК КоррСчетБанка,
	|	БанковскиеСчетаОрганизаций.Банк КАК Банк,
	|	БанковскиеСчетаОрганизаций.БИКБанка КАК БИКБанка,
	|	БанковскиеСчетаОрганизаций.Ссылка КАК СчетСсылка
	|ПОМЕСТИТЬ втОргИБанкЭлис
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ПО (Организации.Ссылка = БанковскиеСчетаОрганизаций.Владелец)
	|ГДЕ
	|	Организации.ИНН = &ИННЭлис
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.Тип КАК Тип,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
	|	ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втКонт
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОргИБанкЭлис.Ссылка КАК Ссылка,
	|	втОргИБанкЭлис.НаименованиеПолное КАК ПолноеЮрНаименование,
	|	втОргИБанкЭлис.КПП КАК КПП,
	|	втОргИБанкЭлис.ИНН КАК ИНН,
	|	втОргИБанкЭлис.ОГРН КАК ОГРН,
	|	втОргИБанкЭлис.НаименованиеСокращенное КАК СокрЮрНаименование,
	|	втОргИБанкЭлис.СчетСсылка КАК СчетСсылка,
	|	втОргИБанкЭлис.СчетСсылка.Представление КАК СчетПредставление,
	|	втОргИБанкЭлис.НомерСчета КАК РасчСчет,
	|	втОргИБанкЭлис.КоррСчетБанка КАК КоррСчет,
	|	втОргИБанкЭлис.Банк.Наименование КАК НаименованиеБанка,
	|	втОргИБанкЭлис.БИКБанка КАК БИК,
	|	Адрес.Представление КАК Адрес,
	|	ВебСтраница.Представление КАК ВебСтраница,
	|	Телефон.Представление КАК Телефон,
	|	Факс.Представление КАК Факс,
	|	ЭлПочта.Представление КАК ЭлПочта
	|ПОМЕСТИТЬ втШапка
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Телефон
	|		ПО втОргИБанкЭлис.Ссылка = Телефон.Ссылка
	|			И (Телефон.Тип = &Телефон)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Адрес
	|		ПО втОргИБанкЭлис.Ссылка = Адрес.Ссылка
	|			И (Адрес.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Факс
	|		ПО втОргИБанкЭлис.Ссылка = Факс.Ссылка
	|			И (Факс.Тип = &Факс)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ВебСтраница
	|		ПО втОргИБанкЭлис.Ссылка = ВебСтраница.Ссылка
	|			И (ВебСтраница.Тип = &ВебСтраница)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ЭлПочта
	|		ПО втОргИБанкЭлис.Ссылка = ЭлПочта.Ссылка
	|			И (ЭлПочта.Тип = &ЭлПочта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииПрисоединенныеФайлы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втЛоготипОрганизации
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОрганизацииПрисоединенныеФайлы КАК ОрганизацииПрисоединенныеФайлы
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииПрисоединенныеФайлы.ВладелецФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаможеннаяДекларацияЭкспорт.Ссылка КАК Ссылка,
	|	ТаможеннаяДекларацияЭкспорт.Дата КАК Дата,
	|	ТаможеннаяДекларацияЭкспорт.КСП_ТаможенныйОрган КАК КСП_ТаможенныйОрган
	|ПОМЕСТИТЬ втТаможенная
	|ИЗ
	|	Документ.ТаможеннаяДекларацияЭкспорт КАК ТаможеннаяДекларацияЭкспорт
	|ГДЕ
	|	ТаможеннаяДекларацияЭкспорт.Ссылка = &СсылкаТаможенная
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация КАК Грузоотправитель,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.НаименованиеСокращенное КАК ГрузоотправительНаименование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ИНН КАК ГрузоотправительИНН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.КПП КАК ГрузоотправительКПП,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ОГРН КАК ГрузоотправительОГРН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель КАК Получатель,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.НаименованиеСокращенное КАК ПолучательНаименование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.ИНН КАК ПолучательИНН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.КПП КАК ПолучательКПП,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.ОГРН КАК ПолучательОГРН,
	|	ОрганизацияОтпрКонт.Представление КАК ГрузоотправительАдреc,
	|	ОрганизацияПолКонт.Представление КАК ПолучательАдрес,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка КАК ТаможеннаяСсылка
	|ПОМЕСТИТЬ втПередачи
	|ИЗ
	|	Документ.ТаможеннаяДекларацияЭкспорт.ДокументыОснования КАК ТаможеннаяДекларацияЭкспортДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацияПолКонт
	|		ПО ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель = ОрганизацияПолКонт.Ссылка
	|			И (ОрганизацияПолКонт.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацияОтпрКонт
	|		ПО ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация = ОрганизацияОтпрКонт.Ссылка
	|			И (ОрганизацияОтпрКонт.Тип = &Адрес)
	|ГДЕ
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка В
	|			(ВЫБРАТЬ
	|				втТаможенная.Ссылка КАК Ссылка
	|			ИЗ
	|				втТаможенная КАК втТаможенная)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданный.ДокументОснование КАК ДокументОснование,
	|	СчетФактураВыданный.Ссылка КАК Ссылка,
	|	СчетФактураВыданный.Номер КАК Номер,
	|	СчетФактураВыданный.Дата КАК Дата
	|ПОМЕСТИТЬ втСчетФактуры
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.ДокументОснование В
	|			(ВЫБРАТЬ
	|				втПередачи.ДокументОснование
	|			ИЗ
	|				втПередачи КАК втПередачи)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПередачи.ДокументОснование КАК ДокументОснование,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура КАК Номенклатура,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура.ВидНоменклатуры КАК НоменклатураВидНоменклатуры,
	|	СУММА(ПередачаТоваровМеждуОрганизациямиТовары.Количество) КАК Количество,
	|	СУММА(ПередачаТоваровМеждуОрганизациямиТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(ПередачаТоваровМеждуОрганизациямиТовары.СуммаСНДС) КАК СуммаСНДС
	|ПОМЕСТИТЬ втПердачиТовары
	|ИЗ
	|	втПередачи КАК втПередачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями.Товары КАК ПередачаТоваровМеждуОрганизациямиТовары
	|		ПО втПередачи.ДокументОснование = ПередачаТоваровМеждуОрганизациямиТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура.ВидНоменклатуры,
	|	втПередачи.ДокументОснование,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСчетФактуры.Номер КАК Номер,
	|	втСчетФактуры.Дата КАК Дата,
	|	втПердачиТовары.Количество КАК Количество,
	|	втПердачиТовары.СуммаСНДС КАК Сумма
	|ПОМЕСТИТЬ втВыводСтрокиСФ
	|ИЗ
	|	втПердачиТовары КАК втПердачиТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСчетФактуры КАК втСчетФактуры
	|		ПО втПердачиТовары.ДокументОснование = втСчетФактуры.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПердачиТовары.НоменклатураВидНоменклатуры КАК ВидНоменклатуры,
	|	СУММА(втПердачиТовары.Количество) КАК Кол
	|ПОМЕСТИТЬ втВыводСтрокиВидНоменклатуры
	|ИЗ
	|	втПердачиТовары КАК втПердачиТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втПердачиТовары.НоменклатураВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПередачи.ТаможеннаяСсылка КАК ТаможеннаяСсылка,
	|	втПередачи.ДокументОснование КАК ДокументОснование,
	|	втПередачи.ТаможеннаяСсылка.Дата КАК Дата,
	|	втПередачи.ТаможеннаяСсылка.КСП_ТаможенныйОрган КАК ТаможенныйОрган,
	|	втПередачи.Грузоотправитель.СтранаПостоянногоМестонахождения.Представление КАК СтранаПроисхождения,
	|	втПередачи.ТаможеннаяСсылка.КСП_ОтветственныйСклада.ФизическоеЛицо.Фамилия + "" "" + втПередачи.ТаможеннаяСсылка.КСП_ОтветственныйСклада.ФизическоеЛицо.Инициалы КАК Сотрудник 
	|ПОМЕСТИТЬ втДопДанные
	|ИЗ
	|	втПередачи КАК втПередачи";
	
	Запрос.УстановитьПараметр("СсылкаТаможенная", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("ИННЭлис", "6152001000");
	Запрос.УстановитьПараметр("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Факс", Перечисления.ТипыКонтактнойИнформации.Факс);
	Запрос.УстановитьПараметр("ВебСтраница", Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	Запрос.УстановитьПараметр("ЭлПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	РезультатыЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ДопДанныеТЗ = РезультатыЗапросов[10].Выгрузить();
	
	Для Каждого СтрокаТЗ ИЗ ДопДанныеТЗ Цикл	
		Если СтрокаТЗ.ДокументОснование <> Неопределено Тогда 
			ОбластьРеквизиты.Параметры.ТаможенныйОрган = СтрокаТЗ.ТаможенныйОрган;
			ОбластьФутер.Параметры.Заполнить(СтрокаТЗ);	
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	
	ФайлХранилищеЛого = Неопределено; 
	
	Шапка = РезультатыЗапросов[2].Выбрать();
	Если РезультатыЗапросов[3].Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Логотип организации не установлен!";
		Сообщение.Сообщить();                                 
	Иначе
		ЛоготипВыборка = РезультатыЗапросов[3].Выбрать();
		Если ЛоготипВыборка.Следующий() Тогда
			ФайлХранилищеЛого = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(ЛоготипВыборка.Ссылка), Ложь);	
		КонецЕсли;	
	КонецЕсли;
	
	Пока Шапка.Следующий() Цикл
		
		//Начало вывода документа
		// склонение банка
		ФорматнаяСтрока = "ПД=Предложный";
		РезультатСколнения = ПолучитьСклоненияСтроки(Шапка.НаименованиеБанка, ,ФорматнаяСтрока);
		
		ОбластьШапка.Параметры.Заполнить(Шапка);
		ОбластьШапка.Параметры.Логотип = ФайлХранилищеЛого;
		
		ОбластьШапка.Параметры.НаименованиеБанка = РезультатСколнения[0];
		ОбластьШапка2.Параметры.Заполнить(Шапка);
		
		ОбластьРеквизиты.Параметры.Заполнить(Шапка);
		//Конец вывода документа
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьШапка2);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	РеквизитыВыборка = РезультатыЗапросов[5].Выбрать();
	
	Пока РеквизитыВыборка.Следующий() Цикл
		
		ОбластьРеквизиты.Параметры.Заполнить(РеквизитыВыборка);	
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьРеквизиты);
	
	СтрокаСФВыборка = РезультатыЗапросов[8].Выбрать();
	
	Пока СтрокаСФВыборка.Следующий() Цикл
		
		ОбластьСтрокаСФ = Макет.ПолучитьОбласть("СтрокаСФ");
		ОбластьСтрокаСФ.Параметры.Заполнить(СтрокаСФВыборка);	
		ТабличныйДокумент.Вывести(ОбластьСтрокаСФ);
		
	КонецЦикла;
	
	
	ТабличныйДокумент.Вывести(ОбластьНаименование);
	
	СтрокаВидВыборка = РезультатыЗапросов[9].Выбрать();
	
	Пока СтрокаВидВыборка.Следующий() Цикл
		
		ОбластьСтрокаНаименование = Макет.ПолучитьОбласть("СтрокаНаименование");
		ОбластьСтрокаНаименование.Параметры.Заполнить(СтрокаВидВыборка);	
		ТабличныйДокумент.Вывести(ОбластьСтрокаНаименование);
		
	КонецЦикла;
	
	
	ТабличныйДокумент.Вывести(ОбластьФутер);	
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатьВыпискаИзПрайсЛиста(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ВыпискаИзПрайсЛиста";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_ВыпискаИзПрайсЛиста");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.НаименованиеПолное КАК НаименованиеПолное,
	|	Организации.КПП КАК КПП,
	|	Организации.ИНН КАК ИНН,
	|	Организации.ОГРН КАК ОГРН,
	|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	БанковскиеСчетаОрганизаций.НомерСчета КАК НомерСчета,
	|	БанковскиеСчетаОрганизаций.КоррСчетБанка КАК КоррСчетБанка,
	|	БанковскиеСчетаОрганизаций.Банк КАК Банк,
	|	БанковскиеСчетаОрганизаций.БИКБанка КАК БИКБанка,
	|	БанковскиеСчетаОрганизаций.Ссылка КАК СчетСсылка
	|ПОМЕСТИТЬ втОргИБанкЭлис
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ПО (Организации.Ссылка = БанковскиеСчетаОрганизаций.Владелец)
	|ГДЕ
	|	Организации.ИНН = &ИННЭлис
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.Тип КАК Тип,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
	|	ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втКонт
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОргИБанкЭлис.Ссылка КАК Ссылка,
	|	втОргИБанкЭлис.НаименованиеПолное КАК ПолноеЮрНаименование,
	|	втОргИБанкЭлис.КПП КАК КПП,
	|	втОргИБанкЭлис.ИНН КАК ИНН,
	|	втОргИБанкЭлис.ОГРН КАК ОГРН,
	|	втОргИБанкЭлис.НаименованиеСокращенное КАК СокрЮрНаименование,
	|	втОргИБанкЭлис.СчетСсылка КАК СчетСсылка,
	|	втОргИБанкЭлис.СчетСсылка.Представление КАК СчетПредставление,
	|	втОргИБанкЭлис.НомерСчета КАК РасчСчет,
	|	втОргИБанкЭлис.КоррСчетБанка КАК КоррСчет,
	|	втОргИБанкЭлис.Банк.Наименование КАК НаименованиеБанка,
	|	втОргИБанкЭлис.БИКБанка КАК БИК,
	|	Адрес.Представление КАК Адрес,
	|	ВебСтраница.Представление КАК ВебСтраница,
	|	Телефон.Представление КАК Телефон,
	|	Факс.Представление КАК Факс,
	|	ЭлПочта.Представление КАК ЭлПочта
	|ПОМЕСТИТЬ втШапка
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Телефон
	|		ПО втОргИБанкЭлис.Ссылка = Телефон.Ссылка
	|			И (Телефон.Тип = &Телефон)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Адрес
	|		ПО втОргИБанкЭлис.Ссылка = Адрес.Ссылка
	|			И (Адрес.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Факс
	|		ПО втОргИБанкЭлис.Ссылка = Факс.Ссылка
	|			И (Факс.Тип = &Факс)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ВебСтраница
	|		ПО втОргИБанкЭлис.Ссылка = ВебСтраница.Ссылка
	|			И (ВебСтраница.Тип = &ВебСтраница)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ЭлПочта
	|		ПО втОргИБанкЭлис.Ссылка = ЭлПочта.Ссылка
	|			И (ЭлПочта.Тип = &ЭлПочта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииПрисоединенныеФайлы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втЛоготипОрганизации
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОрганизацииПрисоединенныеФайлы КАК ОрганизацииПрисоединенныеФайлы
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииПрисоединенныеФайлы.ВладелецФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаможеннаяДекларацияЭкспорт.Ссылка КАК Ссылка,
	|	ТаможеннаяДекларацияЭкспорт.Дата КАК Дата,
	|	ТаможеннаяДекларацияЭкспорт.КСП_ТаможенныйОрган КАК КСП_ТаможенныйОрган
	|ПОМЕСТИТЬ втТаможенная
	|ИЗ
	|	Документ.ТаможеннаяДекларацияЭкспорт КАК ТаможеннаяДекларацияЭкспорт
	|ГДЕ
	|	ТаможеннаяДекларацияЭкспорт.Ссылка = &СсылкаТаможенная
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация КАК Грузоотправитель,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.НаименованиеСокращенное КАК ГрузоотправительНаименование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ИНН КАК ГрузоотправительИНН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.КПП КАК ГрузоотправительКПП,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ОГРН КАК ГрузоотправительОГРН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель КАК Получатель,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.НаименованиеСокращенное КАК ПолучательНаименование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.ИНН КАК ПолучательИНН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.КПП КАК ПолучательКПП,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.ОГРН КАК ПолучательОГРН,
	|	ОрганизацияОтпрКонт.Представление КАК ГрузоотправительАдреc,
	|	ОрганизацияПолКонт.Представление КАК ПолучательАдрес,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка КАК ТаможеннаяСсылка
	|ПОМЕСТИТЬ втПередачи
	|ИЗ
	|	Документ.ТаможеннаяДекларацияЭкспорт.ДокументыОснования КАК ТаможеннаяДекларацияЭкспортДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацияПолКонт
	|		ПО ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель = ОрганизацияПолКонт.Ссылка
	|			И (ОрганизацияПолКонт.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацияОтпрКонт
	|		ПО ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация = ОрганизацияОтпрКонт.Ссылка
	|			И (ОрганизацияОтпрКонт.Тип = &Адрес)
	|ГДЕ
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка В
	|			(ВЫБРАТЬ
	|				втТаможенная.Ссылка КАК Ссылка
	|			ИЗ
	|				втТаможенная КАК втТаможенная)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втПередачиТовары
	|ИЗ
	|	втПередачи КАК втПередачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями.Товары КАК ПередачаТоваровМеждуОрганизациямиТовары
	|		ПО втПередачи.ДокументОснование = ПередачаТоваровМеждуОрганизациямиТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерСтр,
	|	ЦеныНоменклатуры25СрезПоследних.Номенклатура.Представление КАК Наименование,
	|	ЦеныНоменклатуры25СрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ втЦены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
	|			&Дата,
	|			Номенклатура В (ВЫБРАТЬ втТов.Номенклатура ИЗ втПередачиТовары КАК втТов)
	|			И ВидЦены = &ВидЦены) КАК ЦеныНоменклатуры25СрезПоследних";
	
	Запрос.УстановитьПараметр("СсылкаТаможенная", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("ИННЭлис", "6152001000");
	Запрос.УстановитьПараметр("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Факс", Перечисления.ТипыКонтактнойИнформации.Факс);
	Запрос.УстановитьПараметр("ВебСтраница", Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	Запрос.УстановитьПараметр("ЭлПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Цена розницы Основная"));
	Запрос.УстановитьПараметр("Дата", КонецМесяца(МассивОбъектов[0].Дата));
	
	РезультатыЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();	
	
	ФайлХранилищеЛого = Неопределено; 
	
	Шапка = РезультатыЗапросов[2].Выбрать();
	Если РезультатыЗапросов[3].Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Логотип организации не установлен!";
		Сообщение.Сообщить();                                 
	Иначе
		ЛоготипВыборка = РезультатыЗапросов[3].Выбрать();
		Если ЛоготипВыборка.Следующий() Тогда
			ФайлХранилищеЛого = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(ЛоготипВыборка.Ссылка), Ложь);	
		КонецЕсли;	
	КонецЕсли;
	
	Пока Шапка.Следующий() Цикл
		
		//Начало вывода документа
		// склонение банка
		ФорматнаяСтрока = "ПД=Предложный";
		РезультатСколнения = ПолучитьСклоненияСтроки(Шапка.НаименованиеБанка, ,ФорматнаяСтрока);
		
		ОбластьШапка.Параметры.Заполнить(Шапка);
		ОбластьШапка.Параметры.Логотип = ФайлХранилищеЛого;
		
		ОбластьШапка.Параметры.НаименованиеБанка = РезультатСколнения[0];
		ОбластьШапка2.Параметры.Заполнить(Шапка);
		ОбластьШапка2.Параметры.Дата = Формат(КонецДня(МассивОбъектов[0].Дата), "ДФ=dd.MM.yyyy");
		
		//Конец вывода документа
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьШапка2);
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ЦеныВыборка = РезультатыЗапросов[7].Выбрать();
	
	Пока ЦеныВыборка.Следующий() Цикл
		
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьСтрокаТаблицы.Параметры.Заполнить(ЦеныВыборка);
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатьРеализацияТоваровШтрихКоды(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_РеализацияТоваровШтрихКоды";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_РеализацияТоваровШтрихКоды");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.НаименованиеПолное КАК НаименованиеПолное,
	|	Организации.КПП КАК КПП,
	|	Организации.ИНН КАК ИНН,
	|	Организации.ОГРН КАК ОГРН,
	|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	БанковскиеСчетаОрганизаций.НомерСчета КАК НомерСчета,
	|	БанковскиеСчетаОрганизаций.КоррСчетБанка КАК КоррСчетБанка,
	|	БанковскиеСчетаОрганизаций.Банк КАК Банк,
	|	БанковскиеСчетаОрганизаций.БИКБанка КАК БИКБанка,
	|	БанковскиеСчетаОрганизаций.Ссылка КАК СчетСсылка
	|ПОМЕСТИТЬ втОргИБанкЭлис
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ПО (Организации.Ссылка = БанковскиеСчетаОрганизаций.Владелец)
	|ГДЕ
	|	Организации.ИНН = &ИННЭлис
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.Тип КАК Тип,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
	|	ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втКонт
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОргИБанкЭлис.Ссылка КАК Ссылка,
	|	втОргИБанкЭлис.НаименованиеПолное КАК ПолноеЮрНаименование,
	|	втОргИБанкЭлис.КПП КАК КПП,
	|	втОргИБанкЭлис.ИНН КАК ИНН,
	|	втОргИБанкЭлис.ОГРН КАК ОГРН,
	|	втОргИБанкЭлис.НаименованиеСокращенное КАК СокрЮрНаименование,
	|	втОргИБанкЭлис.СчетСсылка КАК СчетСсылка,
	|	втОргИБанкЭлис.СчетСсылка.Представление КАК СчетПредставление,
	|	втОргИБанкЭлис.НомерСчета КАК РасчСчет,
	|	втОргИБанкЭлис.КоррСчетБанка КАК КоррСчет,
	|	втОргИБанкЭлис.Банк.Наименование КАК НаименованиеБанка,
	|	втОргИБанкЭлис.БИКБанка КАК БИК,
	|	Адрес.Представление КАК Адрес,
	|	ВебСтраница.Представление КАК ВебСтраница,
	|	Телефон.Представление КАК Телефон,
	|	Факс.Представление КАК Факс,
	|	ЭлПочта.Представление КАК ЭлПочта
	|ПОМЕСТИТЬ втШапка
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Телефон
	|		ПО втОргИБанкЭлис.Ссылка = Телефон.Ссылка
	|			И (Телефон.Тип = &Телефон)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Адрес
	|		ПО втОргИБанкЭлис.Ссылка = Адрес.Ссылка
	|			И (Адрес.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Факс
	|		ПО втОргИБанкЭлис.Ссылка = Факс.Ссылка
	|			И (Факс.Тип = &Факс)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ВебСтраница
	|		ПО втОргИБанкЭлис.Ссылка = ВебСтраница.Ссылка
	|			И (ВебСтраница.Тип = &ВебСтраница)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ЭлПочта
	|		ПО втОргИБанкЭлис.Ссылка = ЭлПочта.Ссылка
	|			И (ЭлПочта.Тип = &ЭлПочта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииПрисоединенныеФайлы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втЛоготипОрганизации
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОрганизацииПрисоединенныеФайлы КАК ОрганизацииПрисоединенныеФайлы
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииПрисоединенныеФайлы.ВладелецФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаможеннаяДекларацияЭкспорт.Ссылка КАК Ссылка,
	|	ТаможеннаяДекларацияЭкспорт.Дата КАК Дата,
	|	ТаможеннаяДекларацияЭкспорт.КСП_ТаможенныйОрган КАК КСП_ТаможенныйОрган
	|ПОМЕСТИТЬ втТаможенная
	|ИЗ
	|	Документ.ТаможеннаяДекларацияЭкспорт КАК ТаможеннаяДекларацияЭкспорт
	|ГДЕ
	|	ТаможеннаяДекларацияЭкспорт.Ссылка = &СсылкаТаможенная
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация КАК Грузоотправитель,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.НаименованиеСокращенное КАК ГрузоотправительНаименование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ИНН КАК ГрузоотправительИНН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.КПП КАК ГрузоотправительКПП,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ОГРН КАК ГрузоотправительОГРН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель КАК Получатель,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.НаименованиеСокращенное КАК ПолучательНаименование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.ИНН КАК ПолучательИНН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.КПП КАК ПолучательКПП,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.ОГРН КАК ПолучательОГРН,
	|	ОрганизацияОтпрКонт.Представление КАК ГрузоотправительАдреc,
	|	ОрганизацияПолКонт.Представление КАК ПолучательАдрес,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка КАК ТаможеннаяСсылка
	|ПОМЕСТИТЬ втПередачи
	|ИЗ
	|	Документ.ТаможеннаяДекларацияЭкспорт.ДокументыОснования КАК ТаможеннаяДекларацияЭкспортДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацияПолКонт
	|		ПО ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель = ОрганизацияПолКонт.Ссылка
	|			И (ОрганизацияПолКонт.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацияОтпрКонт
	|		ПО ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация = ОрганизацияОтпрКонт.Ссылка
	|			И (ОрганизацияОтпрКонт.Тип = &Адрес)
	|ГДЕ
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка В
	|			(ВЫБРАТЬ
	|				втТаможенная.Ссылка КАК Ссылка
	|			ИЗ
	|				втТаможенная КАК втТаможенная)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура КАК Номенклатура,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ втПередачиТовары
	|ИЗ
	|	втПередачи КАК втПередачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями.Товары КАК ПередачаТоваровМеждуОрганизациямиТовары
	|		ПО втПередачи.ДокументОснование = ПередачаТоваровМеждуОрганизациямиТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втПередачиТовары.Номенклатура.Код КАК Код,
	|	втПередачиТовары.Номенклатура.Артикул КАК Артикул,
	|	втПередачиТовары.Номенклатура.Представление КАК Номенклатура,
	|	втПередачиТовары.Номенклатура.НаименованиеПолное КАК ПолноеНаименование,
	|	втПередачиТовары.Характеристика.Представление КАК Характеристика,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	|ИЗ
	|	втПередачиТовары КАК втПередачиТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО (втПередачиТовары.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура)";
	
	
	Запрос.УстановитьПараметр("СсылкаТаможенная", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("ИННЭлис", "6152001000");
	Запрос.УстановитьПараметр("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Факс", Перечисления.ТипыКонтактнойИнформации.Факс);
	Запрос.УстановитьПараметр("ВебСтраница", Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	Запрос.УстановитьПараметр("ЭлПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Цена розницы Основная"));
	Запрос.УстановитьПараметр("Дата", КонецМесяца(МассивОбъектов[0].Дата));	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатьРеализацияТоваров(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_РеализацияТоваров";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_РеализацияТоваров");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|		ТаможеннаяДекларацияЭкспорт.Ссылка КАК Ссылка,
	|		ТаможеннаяДекларацияЭкспорт.Дата КАК Дата,
	|		ТаможеннаяДекларацияЭкспорт.КСП_ТаможенныйОрган КАК КСП_ТаможенныйОрган
	|	ПОМЕСТИТЬ втТаможенная
	|	ИЗ
	|		Документ.ТаможеннаяДекларацияЭкспорт КАК ТаможеннаяДекларацияЭкспорт
	|	ГДЕ
	|		ТаможеннаяДекларацияЭкспорт.Ссылка = &СсылкаТаможенная
	|	
	|	ИНДЕКСИРОВАТЬ ПО
	|		Ссылка
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование КАК ДокументОснование,
	|		ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация КАК Грузоотправитель,
	|		ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.НаименованиеСокращенное КАК ГрузоотправительНаименование,
	|		ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ИНН КАК ГрузоотправительИНН,
	|		ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.КПП КАК ГрузоотправительКПП,
	|		ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ОГРН КАК ГрузоотправительОГРН,
	|		ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель КАК Получатель,
	|		ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.НаименованиеСокращенное КАК ПолучательНаименование,
	|		ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.ИНН КАК ПолучательИНН,
	|		ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.КПП КАК ПолучательКПП,
	|		ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.ОГРН КАК ПолучательОГРН,
	|		ОрганизацияОтпрКонт.Представление КАК ГрузоотправительАдреc,
	|		ОрганизацияПолКонт.Представление КАК ПолучательАдрес,
	|		ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка КАК ТаможеннаяСсылка
	|	ПОМЕСТИТЬ втПередачи
	|	ИЗ
	|		Документ.ТаможеннаяДекларацияЭкспорт.ДокументыОснования КАК ТаможеннаяДекларацияЭкспортДокументыОснования
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацияПолКонт
	|			ПО ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель = ОрганизацияПолКонт.Ссылка
	|				И (ОрганизацияПолКонт.Тип = &Адрес)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацияОтпрКонт
	|			ПО ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация = ОрганизацияОтпрКонт.Ссылка
	|				И (ОрганизацияОтпрКонт.Тип = &Адрес)
	|	ГДЕ
	|		ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка В
	|				(ВЫБРАТЬ
	|					втТаможенная.Ссылка КАК Ссылка
	|				ИЗ
	|					втТаможенная КАК втТаможенная)
	|	
	|	ИНДЕКСИРОВАТЬ ПО
	|		ДокументОснование
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура КАК Номенклатура,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Характеристика КАК Характеристика,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Количество КАК Количество,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Цена КАК Цена,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Сумма КАК Сумма
	|	ПОМЕСТИТЬ втПередачиТовары
	|	ИЗ
	|		втПередачи КАК втПередачи
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями.Товары КАК ПередачаТоваровМеждуОрганизациямиТовары
	|			ПО втПередачи.ДокументОснование = ПередачаТоваровМеждуОрганизациямиТовары.Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Характеристика,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Количество,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Цена,
	|		ПередачаТоваровМеждуОрганизациямиТовары.Сумма
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		МАКСИМУМ(ШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод,
	|		ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|		ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	|	ПОМЕСТИТЬ втШтрихкоды
	|	ИЗ
	|		РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|	ГДЕ
	|		(ШтрихкодыНоменклатуры.Номенклатура, ШтрихкодыНоменклатуры.Характеристика) В
	|				(ВЫБРАТЬ
	|					Т.Номенклатура,
	|					Т.Характеристика
	|				ИЗ
	|					втПередачиТовары КАК Т)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ШтрихкодыНоменклатуры.Номенклатура,
	|		ШтрихкодыНоменклатуры.Характеристика
	|	
	|	ИНДЕКСИРОВАТЬ ПО
	|		Номенклатура,
	|		Характеристика
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		втПередачиТовары.Номенклатура.Код КАК Код,
	|		втПередачиТовары.Номенклатура.Артикул КАК Артикул,
	|		втПередачиТовары.Номенклатура.Представление КАК Номенклатура,
	|		втПередачиТовары.Номенклатура.НаименованиеПолное КАК ПолноеНаименование,
	|		втПередачиТовары.Характеристика.Представление КАК Характеристика,
	|		втПередачиТовары.Количество КАК Количество,
	|		втПередачиТовары.Цена КАК Цена,
	|		втПередачиТовары.Сумма КАК Сумма,
	|		втПередачиТовары.Номенклатура.Марка.Представление КАК ТорговаяМарка,
	|		втПередачиТовары.Номенклатура.КоллекцияНоменклатуры.Представление КАК Коллекция,
	|		КоллекцииНоменклатуры.Представление КАК К0,
	|		КоллекцииНоменклатуры1.Представление КАК Капсула,
	|		КоллекцииНоменклатуры2.Представление КАК К2,
	|		втШтрихкоды.Штрихкод КАК Штрихкод
	|	ИЗ
	|		втПередачиТовары КАК втПередачиТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КоллекцииНоменклатуры КАК КоллекцииНоменклатуры
	|			ПО (втПередачиТовары.Номенклатура.КоллекцияНоменклатуры = КоллекцииНоменклатуры.Родитель
	|			И втПередачиТовары.Номенклатура.КоллекцияНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КоллекцииНоменклатуры.ПустаяСсылка))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КоллекцииНоменклатуры КАК КоллекцииНоменклатуры1
	|			ПО (КоллекцииНоменклатуры.Ссылка = КоллекцииНоменклатуры1.Родитель
	|			И КоллекцииНоменклатуры1.Ссылка <> ЗНАЧЕНИЕ(Справочник.КоллекцииНоменклатуры.ПустаяСсылка))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КоллекцииНоменклатуры КАК КоллекцииНоменклатуры2
	|			ПО (КоллекцииНоменклатуры1.Ссылка = КоллекцииНоменклатуры2.Родитель
	|			И КоллекцииНоменклатуры2.Ссылка <> ЗНАЧЕНИЕ(Справочник.КоллекцииНоменклатуры.ПустаяСсылка))
	|			ЛЕВОЕ СОЕДИНЕНИЕ втШтрихкоды КАК втШтрихкоды
	|			ПО (втПередачиТовары.Номенклатура = втШтрихкоды.Номенклатура
	|					И втПередачиТовары.Характеристика = втШтрихкоды.Характеристика)";
	
	
	Запрос.УстановитьПараметр("СсылкаТаможенная", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("ИННЭлис", "6152001000");
	Запрос.УстановитьПараметр("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Факс", Перечисления.ТипыКонтактнойИнформации.Факс);
	Запрос.УстановитьПараметр("ВебСтраница", Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	Запрос.УстановитьПараметр("ЭлПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Цена розницы Основная"));
	Запрос.УстановитьПараметр("Дата", КонецМесяца(МассивОбъектов[0].Дата));	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатьСпецификация(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Спецификация";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_Спецификация");
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка КАК Ссылка,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка.Организация.Представление КАК ОрганизацияПредставление,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ втОснованияТаможенной
	|ИЗ
	|	Документ.ТаможеннаяДекларацияЭкспорт.ДокументыОснования КАК ТаможеннаяДекларацияЭкспортДокументыОснования
	|ГДЕ
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка = &СсылкаТаможенная
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка КАК ПередачаСсылка,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура КАК Номенклатура,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Характеристика КАК Характеристика,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Упаковка КАК Упаковка,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Количество КАК Количество,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Цена КАК Цена,
	|	ПередачаТоваровМеждуОрганизациямиТовары.СуммаСНДС КАК СуммаСНДС,
	|	ПередачаТоваровМеждуОрганизациямиТовары.СтавкаНДС КАК СтавкаНДС,
	|	ПередачаТоваровМеждуОрганизациямиТовары.Номенклатура.СтавкаНДС.Представление КАК СтавкаНДСНоменклатура
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями.Товары КАК ПередачаТоваровМеждуОрганизациямиТовары
	|ГДЕ
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.ДокументОснование
	|			ИЗ
	|				втОснованияТаможенной КАК Т)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.ПередачаСсылка КАК ПередачаСсылка,
	|	втОснованияТаможенной.ОрганизацияПредставление КАК ЮрЛицо,
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Номенклатура.Артикул КАК Модель,
	|	втТовары.Номенклатура.Марка.Представление КАК Бренд,
	|	втТовары.Номенклатура.НаименованиеПолное КАК Наименование,
	|	втТовары.Номенклатура.СтранаПроисхождения.Представление КАК Страна,
	|	втТовары.Номенклатура.КодТНВЭД.Представление КАК НоменклатураКодТНВЭДПредставление,
	|	втТовары.Номенклатура.ВесЕдиницаИзмерения КАК НоменклатураВесЕдиницаИзмерения,
	|	втТовары.Номенклатура.ВесЧислитель КАК НоменклатураВесЧислитель,
	|	втТовары.Номенклатура.ВесЗнаменатель КАК НоменклатураВесЗнаменатель,
	|	ВЫБОР
	|		КОГДА втТовары.Номенклатура.ВесЗнаменатель <> 0
	|			ТОГДА втТовары.Номенклатура.ВесЧислитель / втТовары.Номенклатура.ВесЗнаменатель
	|		ИНАЧЕ втТовары.Номенклатура.ВесЧислитель / 1
	|	КОНЕЦ КАК ВесЕдиницы,
	|	втТовары.Номенклатура.Описание КАК Описание,
	|	втТовары.Характеристика.Представление КАК ХарактеристикаПредставление,
	|	втТовары.Количество КАК Количество,
	|	втТовары.Цена КАК Цена,
	|	втТовары.СуммаСНДС КАК Сумма,
	|	втТовары.Номенклатура.ВидНоменклатуры КАК НоменклатураВидНоменклатуры,
	|	втТовары.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ втТов
	|ИЗ
	|	втТовары КАК втТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОснованияТаможенной КАК втОснованияТаможенной
	|		ПО втТовары.ПередачаСсылка = втОснованияТаможенной.ДокументОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТов.ПередачаСсылка КАК ПередачаСсылка,
	|	втТов.ЮрЛицо КАК ЮрЛицо,
	|	втТов.Номенклатура КАК Номенклатура,
	|	втТов.Характеристика КАК Характеристика,
	|	втТов.Модель КАК Модель,
	|	втТов.Бренд КАК Бренд,
	|	втТов.Наименование КАК Наименование,
	|	втТов.Страна КАК Страна,
	|	втТов.НоменклатураКодТНВЭДПредставление КАК ТНВЭД,
	|	втТов.НоменклатураВесЕдиницаИзмерения КАК НоменклатураВесЕдиницаИзмерения,
	|	втТов.НоменклатураВесЧислитель КАК НоменклатураВесЧислитель,
	|	втТов.НоменклатураВесЗнаменатель КАК НоменклатураВесЗнаменатель,
	|	втТов.ВесЕдиницы КАК ВесЕдиницы,
	|	втТов.Описание КАК Описание,
	|	втТов.ХарактеристикаПредставление КАК ХарактеристикаПредставление,
	|	втТов.Количество КАК Количество,
	|	втТов.СтавкаНДС КАК СтавкаНДС,
	|	втТов.Цена КАК Цена,
	|	втТов.Сумма КАК Сумма,
	|	втТов.НоменклатураВидНоменклатуры КАК НоменклатураВидНоменклатуры,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК шк,
	|	втТов.Номенклатура.СрокГодности КАК СрокГодности,
	|	втТов.Номенклатура.ЕдиницаИзмеренияСрокаГодности КАК СрокГодностиЕд
	|ИЗ
	|	втТов КАК втТов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО (втТов.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура)
	|			И (втТов.Характеристика = ШтрихкодыНоменклатуры.Характеристика)
	|ИТОГИ ПО
	|	ПередачаСсылка,
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("СсылкаТаможенная", МассивОбъектов[0]);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПередача = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	// ИТОГИ сделаны для заполнения штрихкодов
	Пока ВыборкаПередача.Следующий() Цикл
		
		ВыборкаНоменклатура = ВыборкаПередача.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНоменклатура.Следующий() Цикл
			
			ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
			ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
			
			Сч = 1;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если Сч = 1 Тогда	
					ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
					ОбластьСтрока.Параметры["шк" + Строка(Сч)] = ВыборкаДетальныеЗаписи.шк; 
					ОбластьСтрока.Параметры.Размер = ВыборкаДетальныеЗаписи.ХарактеристикаПредставление; // точно ли так
				ИначеЕсли Сч < 9 Тогда
					ОбластьСтрока.Параметры["шк" + Строка(Сч)] = ВыборкаДетальныеЗаписи.шк;
				Иначе
					Продолжить;
				КонецЕсли;
				Сч = Сч + 1;	
			КонецЦикла;
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);	
			
		КонецЦикла;
		
	КонецЦикла;
	
	РасчетШириныКолонок(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции 


Процедура РасчетШириныКолонок(ТабличныйДокумент)
	
	Перем МаксимальноеКоличествоСтрок, МаксимальнаяШиринаКолонки;
	Перем КонечнаяСтрока, НачальнаяСтрока, ТекущаяКолонка, ТекущаяСтрока, НачалоДанных;
	Перем ОбластьШапки, ОбластьПодвала;
	Перем ШиринаКолонки, ТекстЯчейки, НомерСтрокиТекста;
	Перем КоличествоУровнейГруппировокСтрок, Отступ;
	Перем ШириныКолонок;
	
	// Максимальное количество строк отчета, которые будут использованы для расчета ширин колонок
	
	МаксимальноеКоличествоСтрок = 50;
	// Ограничение максимальной ширины колонки
	
	МаксимальнаяШиринаКолонки = 50;
	// Массив, в который будут помещаться ширины колонок
	
	ШириныКолонок = Новый Массив;
	// Получим количество уровней группировок в отчете для учета автоматического отступа
	
	КоличествоУровнейГруппировокСтрок = ТабличныйДокумент.КоличествоУровнейГруппировокСтрок();
	
	// Инициализируем начальные строки
	
	НачальнаяСтрока = 0;
	НачалоДанных = 0;
	
	// Найдем в результирующем документе область шапки таблицы
	
	ОбластьШапки = ТабличныйДокумент.Области.Найти("ШапкаТаблицы");
	Если ТипЗнч(ОбластьШапки) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		
		// Из шапки таблицы получим начальную строку с которой будем рассчитывать ширины
		НачальнаяСтрока = ОбластьШапки.Верх;
		НачалоДанных = ОбластьШапки.Низ + 1;
	Иначе
		
		// Если область шапки таблицы не найдена, найдем область шапки строк
		ОбластьШапки = ТабличныйДокумент.Области.Найти("ШапкаСтрок");
		Если ТипЗнч(ОбластьШапки) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			
			// Из шапки таблицы получим начальную строку с которой будем рассчитывать ширины
			НачальнаяСтрока = ОбластьШапки.Верх;
			НачалоДанных = ОбластьШапки.Низ + 1;
			
		КонецЕсли;
	КонецЕсли;
	
	// Получим область подвала отчета и вычислим конечную строку расчета
	
	ОбластьПодвала = ТабличныйДокумент.Области.Найти("Подвал");
	Если ТипЗнч(ОбластьПодвала) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		// Область подвала найдена
		КонечнаяСтрока = ОбластьПодвала.Верх - 1;
		Если КонечнаяСтрока - НачальнаяСтрока > МаксимальноеКоличествоСтрок Тогда
			КонечнаяСтрока = НачальнаяСтрока + МаксимальноеКоличествоСтрок;
		КонецЕсли;
	Иначе 
		// Область подвала не найдена
		КонечнаяСтрока = НачальнаяСтрока + МаксимальноеКоличествоСтрок;
	КонецЕсли;
	
	// Ограничим конечную строку
	КонечнаяСтрока = Мин(КонечнаяСтрока, ТабличныйДокумент.ВысотаТаблицы);
	// Переберем все колонки отчета
	Для ТекущаяКолонка = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		АвтоОтступ = 0;
		// Переберем строки, которые будут использованы для расчета ширин колонок
		Для ТекущаяСтрока = НачальнаяСтрока По КонечнаяСтрока Цикл
			ШиринаКолонки = 0;
			// Получим область текущей ячейки
			ОбластьЯчейки = ТабличныйДокумент.Область(ТекущаяСтрока, ТекущаяКолонка);
			Если ОбластьЯчейки.Лево <> ТекущаяКолонка Или ОбластьЯчейки.Верх <> ТекущаяСтрока Тогда
				// Данная ячейка принадлежит объединенным ячейкам и не является начальной ячейкой
				Продолжить;
			КонецЕсли;
			Если КоличествоУровнейГруппировокСтрок > 0 И ТекущаяСтрока = НачалоДанных Тогда
				// Для первой строки с данными получим значение автоотступа
				АвтоОтступ = ОбластьЯчейки.АвтоОтступ;
			КонецЕсли;
			// Получим текст ячейки
			ТекстЯчейки = ОбластьЯчейки.Текст;
			// Для каждой строки из текста ячейки рассчитаем количество символов в строке
			Для НомерСтрокиТекста = 1 По СтрЧислоСтрок(ТекстЯчейки) Цикл
				ШиринаТекстаЯчейки = СтрДлина(СтрПолучитьСтроку(ТекстЯчейки, НомерСтрокиТекста));
				// Если используется автоотступ, то прибавим к ширине ячейки его величину
				Если АвтоОтступ <> Неопределено И АвтоОтступ > 0 Тогда
					ШиринаТекстаЯчейки = ШиринаТекстаЯчейки + КоличествоУровнейГруппировокСтрок * АвтоОтступ;
				КонецЕсли;
				ШиринаКолонки = Макс(ШиринаКолонки, ШиринаТекстаЯчейки);
			КонецЦикла;
			
			Если ШиринаКолонки > МаксимальнаяШиринаКолонки Тогда
				// Ограничим ширину колонки
				ШиринаКолонки = МаксимальнаяШиринаКолонки;
			КонецЕсли;
			Если ШиринаКолонки <> 0 Тогда
				// Ширина колонки рассчитана
				// Определим, сколько ячеек по ширине используется в области для текущей ячейки
				КоличествоКолонок = ОбластьЯчейки.Право - ОбластьЯчейки.Лево;
				// Переберем все ячейки, расположенные в области
				Для НомерКолонки = 0 По КоличествоКолонок Цикл
					Если ШириныКолонок.ВГраница() > ТекущаяКолонка - 1 + НомерКолонки Тогда
						// В массиве ширин колонок уже был элемент для текущей колонки
						Если ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки] = Неопределено Тогда
							// Значение ширины колонки еще не было установлено
							ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки] = ШиринаКолонки / (КоличествоКолонок + 1);
						Иначе
							// Значение ширины колонки уже было установлено
							// Вычислим максимум ширины колонки
							ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки] = 
							Макс(ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки], ШиринаКолонки / (КоличествоКолонок + 1));
						КонецЕсли;
					Иначе
						// В массиве ширин колонок еще не было элемента для данной колонки
						// Добавим элемент в массив ширин колонок
						ШириныКолонок.Вставить(ТекущаяКолонка - 1 + НомерКолонки, ШиринаКолонки / (КоличествоКолонок + 1));
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;    // Конец цикла перебора строк
	КонецЦикла;    // Конец цикла перебора колонок
	
	// Переберем все элементы в массиве вычисленных ширин колонок
	Для ТекущаяКолонка = 0 По ШириныКолонок.ВГраница() Цикл
		Если ШириныКолонок[ТекущаяКолонка] <> Неопределено Тогда
			// Ширина колонок установлена
			// Установим ширину области ячеек
			ТабличныйДокумент.Область(, ТекущаяКолонка + 1, НачалоДанных, ТекущаяКолонка + 1).ШиринаКолонки = ШириныКолонок[ТекущаяКолонка] + 1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры  

// --- УваровДС
