// +++ УваровДС 14/12/2023
// заново добавил кнопку печать

#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
&После("ДобавитьКомандыПечати")
Процедура КСП_ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Комплект документов с настройкой...
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюУТКлиент.ПечатьКомплектаДокументовСНастройкой";
	КомандаПечати.МенеджерПечати = "";
	КомандаПечати.Идентификатор = "КомплектДокументовСНастройкой";
	КомандаПечати.Представление = НСтр("ru = 'Комплект документов с настройкой...';
	|en = 'Document set with setting...'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;
	
	// Декларация
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ТаможеннаяДекларацияЭкспорт";
	КомандаПечати.Идентификатор = "Декларация";                     
	//КомандаПечати.МестоРазмещения = "<ИмяПодменюНаФорме>";
	КомандаПечати.Представление = НСтр("ru = 'Декларация о происхождении товара КСП'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Выписка из прайс-листа продукции
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ТаможеннаяДекларацияЭкспорт";
	КомандаПечати.Идентификатор = "ВыпискаИзПрайсЛиста";                     
	//КомандаПечати.МестоРазмещения = "<ИмяПодменюНаФорме>";
	КомандаПечати.Представление = НСтр("ru = 'Выписка из прайс-листа продукции КСП'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Реализация товаров штрих-коды
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ТаможеннаяДекларацияЭкспорт";
	КомандаПечати.Идентификатор = "РеализацияТоваровШтрихКоды";                     
	//КомандаПечати.МестоРазмещения = "<ИмяПодменюНаФорме>";
	КомандаПечати.Представление = НСтр("ru = 'Реализация товаров штрих-коды КСП'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Реализация товаров
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ТаможеннаяДекларацияЭкспорт";
	КомандаПечати.Идентификатор = "РеализацияТоваров";                     
	//КомандаПечати.МестоРазмещения = "<ИмяПодменюНаФорме>";
	КомандаПечати.Представление = НСтр("ru = 'Реализация товаров КСП'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

Функция КомплектПечатныхФорм() Экспорт
	
	КомплектПечатныхФорм = РегистрыСведений.НастройкиПечатиОбъектов.ПодготовитьКомплектПечатныхФорм();
	
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
	"Декларация", НСтр("ru = 'Декларация о происхождении товара КСП'"), 0);
	
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
	"ВыпискаИзПрайсЛиста", НСтр("ru = 'Выписка из прайс-листа продукции КСП'"), 0);
	
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
	"РеализацияТоваровШтрихКоды", НСтр("ru = 'Реализация товаров штрих-коды КСП'"), 0);
	
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
	"РеализацияТоваров", НСтр("ru = 'Реализация товаров КСП'"), 0);
	
	Возврат КомплектПечатныхФорм;
	
КонецФункции

Функция СформироватьКомплектПечатныхФорм(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати) Экспорт
	
	Перем АдресКомплектаПечатныхФорм;
	
	Если ТипЗнч(ПараметрыПечати) = Тип("Структура") И ПараметрыПечати.Свойство("АдресКомплектаПечатныхФорм", АдресКомплектаПечатныхФорм) Тогда
		
		КомплектПечатныхФорм = ПолучитьИзВременногоХранилища(АдресКомплектаПечатныхФорм);
		
	Иначе
		
		КомплектПечатныхФорм = РегистрыСведений.НастройкиПечатиОбъектов.КомплектПечатныхФорм(
		Метаданные.Документы.ТаможеннаяДекларацияЭкспорт.ПолноеИмя(),
		МассивОбъектов, Неопределено);
		
	КонецЕсли;
	
	Если КомплектПечатныхФорм = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"Декларация");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		ПечатьДекларация(КомплектПечати.Объекты, ОбъектыПечати),
		);
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"ВыпискаИзПрайсЛиста");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		ПечатьВыпискаИзПрайсЛиста(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"РеализацияТоваровШтрихКоды");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		ПечатьРеализацияТоваровШтрихКоды(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"РеализацияТоваров");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		ПечатьРеализацияТоваров(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;
	
	
КонецФункции

#КонецОбласти

Функция ПолучитьПредставлениеСсылкиБезДаты(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаможеннаяДекларацияЭкспорт.Представление КАК Представление
	|ИЗ
	|	Документ.ТаможеннаяДекларацияЭкспорт КАК ТаможеннаяДекларацияЭкспорт
	|ГДЕ
	|	ТаможеннаяДекларацияЭкспорт.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Заголовок = "";
	
	Пока Выборка.Следующий() Цикл
		
		Заголовок = Выборка.Представление;	
		
	КонецЦикла;			
	
	Разбивка = СтрРазделить(Заголовок, " ");
	Разбивка.Удалить(Разбивка.Количество() - 1);
	
	Возврат СтрСоединить(Разбивка, " ");		
	
КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати – Структура – дополнительные настройки печати;
//  КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
//  ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
//                                            представление – имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПредставлениеСсылкиБезДаты = ПолучитьПредставлениеСсылкиБезДаты(МассивОбъектов[0].Ссылка);
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Декларация") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"Декларация",
		НСтр("ru = 'Декларация'"),
		ПечатьДекларация(МассивОбъектов, ОбъектыПечати), ,
		"Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_Декларация");
		
		ПараметрыВывода.ЗаголовокФормы = "Декларация " + ПредставлениеСсылкиБезДаты;
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВыпискаИзПрайсЛиста") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ВыпискаИзПрайсЛиста",
		НСтр("ru = 'Выписка из прайс листа'"),
		ПечатьВыпискаИзПрайсЛиста(МассивОбъектов, ОбъектыПечати), ,
		"Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_ВыпискаИзПрайсЛиста");	
		
		ПараметрыВывода.ЗаголовокФормы = "Выписка из прайс-листа " + ПредставлениеСсылкиБезДаты;
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеализацияТоваровШтрихКоды") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"РеализацияТоваровШтрихКоды",
		НСтр("ru = 'Реализация товаров штрих коды'"),
		ПечатьРеализацияТоваровШтрихКоды(МассивОбъектов, ОбъектыПечати), ,
		"Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_РеализацияТоваровШтрихКоды");	
		
		ПараметрыВывода.ЗаголовокФормы = "Реализация товаров штрих-коды " + ПредставлениеСсылкиБезДаты;	
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеализацияТоваров") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"РеализацияТоваров",
		НСтр("ru = 'Реализация товаров'"),
		ПечатьРеализацияТоваров(МассивОбъектов, ОбъектыПечати), ,
		"Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_РеализацияТоваров");
		
		ПараметрыВывода.ЗаголовокФормы = "Реализация товаров " + ПредставлениеСсылкиБезДаты;
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КомплектДокументов") Тогда
		КоллекцияПечатныхФорм.Очистить();
		СформироватьКомплектПечатныхФорм(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати);
	КонецЕсли;
	
	
КонецПроцедуры      

Функция ПечатьДекларация(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Декларация";
	
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_Декларация");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьРеквизиты = Макет.ПолучитьОбласть("Реквизиты");
	
	ОбластьНаименование = Макет.ПолучитьОбласть("Наименование");
	
	ОбластьСтрана = Макет.ПолучитьОбласть("ОбластьСтрана");
	ОбластьДолжностьДата = Макет.ПолучитьОбласть("ДолжностьДата");
	
	ДокументПередачаТоваров = МассивОбъектов[0].ДокументОснование;
	
	// Получаем запросом необходимые данные.
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.НаименованиеПолное КАК НаименованиеПолное,
	|	Организации.КПП КАК КПП,
	|	Организации.ИНН КАК ИНН,
	|	Организации.ОГРН КАК ОГРН,
	|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	БанковскиеСчетаОрганизаций.НомерСчета КАК НомерСчета,
	|	БанковскиеСчетаОрганизаций.КоррСчетБанка КАК КоррСчетБанка,
	|	БанковскиеСчетаОрганизаций.Банк КАК Банк,
	|	БанковскиеСчетаОрганизаций.БИКБанка КАК БИКБанка,
	|	БанковскиеСчетаОрганизаций.Ссылка КАК СчетСсылка
	|ПОМЕСТИТЬ втОргИБанкЭлис
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ПО (Организации.Ссылка = БанковскиеСчетаОрганизаций.Владелец)
	|ГДЕ
	|	Организации.ИНН = &ИННЭлис
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.Тип КАК Тип,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
	|	ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втКонт
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОргИБанкЭлис.Ссылка КАК Ссылка,
	|	втОргИБанкЭлис.НаименованиеПолное КАК ПолноеЮрНаименование,
	|	втОргИБанкЭлис.КПП КАК КПП,
	|	втОргИБанкЭлис.ИНН КАК ИНН,
	|	втОргИБанкЭлис.ОГРН КАК ОГРН,
	|	втОргИБанкЭлис.НаименованиеСокращенное КАК СокрЮрНаименование,
	|	втОргИБанкЭлис.СчетСсылка КАК СчетСсылка,
	|	втОргИБанкЭлис.СчетСсылка.Представление КАК СчетПредставление,
	|	втОргИБанкЭлис.НомерСчета КАК РасчСчет,
	|	втОргИБанкЭлис.КоррСчетБанка КАК КоррСчет,
	|	втОргИБанкЭлис.Банк.Наименование КАК НаименованиеБанка,
	|	втОргИБанкЭлис.БИКБанка КАК БИК,
	|	Адрес.Представление КАК Адрес,
	|	ВебСтраница.Представление КАК ВебСтраница,
	|	Другое.Представление КАК Другое,
	|	Телефон.Представление КАК Телефон,
	|	Факс.Представление КАК Факс,
	|	ЭлПочта.Представление КАК ЭлПочта
	|ПОМЕСТИТЬ втШапка
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Телефон
	|		ПО втОргИБанкЭлис.Ссылка = Телефон.Ссылка
	|			И (Телефон.Тип = &Телефон)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Адрес
	|		ПО втОргИБанкЭлис.Ссылка = Адрес.Ссылка
	|			И (Адрес.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Факс
	|		ПО втОргИБанкЭлис.Ссылка = Факс.Ссылка
	|			И (Факс.Тип = &Факс)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ВебСтраница
	|		ПО втОргИБанкЭлис.Ссылка = ВебСтраница.Ссылка
	|			И (ВебСтраница.Тип = &ВебСтраница)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Другое
	|		ПО втОргИБанкЭлис.Ссылка = Другое.Ссылка
	|			И (Другое.Тип = &Другое)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ЭлПочта
	|		ПО втОргИБанкЭлис.Ссылка = ЭлПочта.Ссылка
	|			И (ЭлПочта.Тип = &ЭлПочта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииПрисоединенныеФайлы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втЛоготипОрганизации
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОрганизацииПрисоединенныеФайлы КАК ОрганизацииПрисоединенныеФайлы
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииПрисоединенныеФайлы.ВладелецФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаможеннаяДекларацияЭкспорт.Ссылка КАК Ссылка,
	|	ТаможеннаяДекларацияЭкспорт.Дата КАК Дата,
	|	ТаможеннаяДекларацияЭкспорт.КСП_ТаможенныйОрган КАК КСП_ТаможенныйОрган
	|ПОМЕСТИТЬ втТаможенная
	|ИЗ
	|	Документ.ТаможеннаяДекларацияЭкспорт КАК ТаможеннаяДекларацияЭкспорт
	|ГДЕ
	|	ТаможеннаяДекларацияЭкспорт.Ссылка = &СсылкаТаможенная
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация КАК Грузоотправитель,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.НаименованиеСокращенное КАК ГрузоотправительНаименование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ИНН КАК ГрузоотправительИНН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.КПП КАК ГрузоотправительКПП,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ОГРН КАК ГрузоотправительОГРН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Контрагент КАК Получатель,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Контрагент.НаименованиеПолное КАК ПолучательНаименование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Контрагент.ИНН КАК ПолучательИНН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Контрагент.КПП КАК ПолучательКПП,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Контрагент.ОГРН КАК ПолучательОГРН,
	|	ОрганизацияОтпрКонт.Представление КАК ГрузоотправительАдреc,
	|	КонтрагентыКонтактнаяИнформация.Представление КАК ПолучательАдрес,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка КАК ТаможеннаяСсылка
	|ПОМЕСТИТЬ втРеализации
	|ИЗ
	|	Документ.ТаможеннаяДекларацияЭкспорт.ДокументыОснования КАК ТаможеннаяДекларацияЭкспортДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ПО (ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка)
	|			И (КонтрагентыКонтактнаяИнформация.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацияОтпрКонт
	|		ПО (ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация = ОрганизацияОтпрКонт.Ссылка)
	|			И (ОрганизацияОтпрКонт.Тип = &Адрес)
	|ГДЕ
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка В
	|			(ВЫБРАТЬ
	|				втТаможенная.Ссылка КАК Ссылка
	|			ИЗ
	|				втТаможенная КАК втТаможенная)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.НаименованиеСокращенное,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ИНН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.КПП,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ОГРН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Контрагент,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Контрагент.ИНН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Контрагент.КПП,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Контрагент.ОГРН,
	|	ОрганизацияОтпрКонт.Представление,
	|	КонтрагентыКонтактнаяИнформация.Представление,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Контрагент.НаименованиеПолное
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданный.ДокументОснование КАК ДокументОснование,
	|	СчетФактураВыданный.Ссылка КАК Ссылка,
	|	СчетФактураВыданный.Номер КАК Номер,
	|	СчетФактураВыданный.Дата КАК Дата
	|ПОМЕСТИТЬ втСчетФактуры
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.ДокументОснование В
	|			(ВЫБРАТЬ
	|				втРеализации.ДокументОснование
	|			ИЗ
	|				втРеализации КАК втРеализации)
	|	И НЕ СчетФактураВыданный.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПередачи.ДокументОснование КАК ДокументОснование,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.Номенклатура.ВидНоменклатуры КАК НоменклатураВидНоменклатуры,
	|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
	|	СУММА(РеализацияТоваровУслугТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(РеализацияТоваровУслугТовары.СуммаСНДС) КАК СуммаСНДС,
	|	втПередачи.ДокументОснование.Валюта.Представление КАК Валюта
	|ПОМЕСТИТЬ втПердачиТовары
	|ИЗ
	|	втРеализации КАК втПередачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО втПередачи.ДокументОснование = РеализацияТоваровУслугТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Номенклатура.ВидНоменклатуры,
	|	втПередачи.ДокументОснование,
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	втПередачи.ДокументОснование.Валюта.Представление
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСчетФактуры.Номер КАК Номер,
	|	втСчетФактуры.Дата КАК Дата,
	|	СУММА(втПердачиТовары.Количество) КАК Количество,
	|	СУММА(втПердачиТовары.СуммаСНДС) КАК Сумма,
	|	втПердачиТовары.Валюта КАК Валюта
	|ПОМЕСТИТЬ втВыводСтрокиСФ
	|ИЗ
	|	втПердачиТовары КАК втПердачиТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСчетФактуры КАК втСчетФактуры
	|		ПО втПердачиТовары.ДокументОснование = втСчетФактуры.ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	втСчетФактуры.Номер,
	|	втСчетФактуры.Дата,
	|	втПердачиТовары.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПердачиТовары.НоменклатураВидНоменклатуры КАК ВидНоменклатуры,
	|	СУММА(втПердачиТовары.Количество) КАК Кол
	|ПОМЕСТИТЬ втВыводСтрокиВидНоменклатуры
	|ИЗ
	|	втПердачиТовары КАК втПердачиТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втПердачиТовары.НоменклатураВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПередачи.ТаможеннаяСсылка КАК ТаможеннаяСсылка,
	|	втПередачи.ДокументОснование КАК ДокументОснование,
	|	втПередачи.ТаможеннаяСсылка.Дата КАК Дата,
	|	втПередачи.ТаможеннаяСсылка.КСП_ТаможенныйОрган КАК ТаможенныйОрган,
	|	втПередачи.Грузоотправитель.СтранаПостоянногоМестонахождения.Представление КАК СтранаПроисхождения,
	|	втПередачи.ТаможеннаяСсылка.КСП_ОтветственныйСклада.Фамилия + "" "" + втПередачи.ТаможеннаяСсылка.КСП_ОтветственныйСклада.Инициалы КАК Сотрудник
	|ПОМЕСТИТЬ втДопДанные
	|ИЗ
	|	втРеализации КАК втПередачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПердачиТовары.Номенклатура.Представление КАК НоменклатураПредставление,
	|	втПердачиТовары.Количество КАК Количество,
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка,
	|	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
	|	УпаковкиЕдиницыИзмерения.Знаменатель КАК Знаменатель,
	|	ВЫБОР
	|		КОГДА УпаковкиЕдиницыИзмерения.Ссылка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА втПердачиТовары.Количество / (УпаковкиЕдиницыИзмерения.Числитель / ВЫБОР
	|					КОГДА УпаковкиЕдиницыИзмерения.Знаменатель = 0
	|						ТОГДА 1
	|					ИНАЧЕ УпаковкиЕдиницыИзмерения.Знаменатель
	|				КОНЕЦ)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КолвоКоробок
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|		ПРАВОЕ СОЕДИНЕНИЕ втПердачиТовары КАК втПердачиТовары
	|		ПО (втПердачиТовары.Номенклатура = УпаковкиЕдиницыИзмерения.Владелец)
	|			И (УпаковкиЕдиницыИзмерения.Наименование ПОДОБНО ""%Коробка стреп лента и скотч%"")
	|ИТОГИ
	|	СУММА(КолвоКоробок)
	|ПО
	|	НоменклатураПредставление";
	
	Запрос.УстановитьПараметр("СсылкаТаможенная", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("ИННЭлис", "6152001000");
	Запрос.УстановитьПараметр("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Факс", Перечисления.ТипыКонтактнойИнформации.Факс);
	Запрос.УстановитьПараметр("ВебСтраница", Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	Запрос.УстановитьПараметр("Другое", Перечисления.ТипыКонтактнойИнформации.Другое);
	Запрос.УстановитьПараметр("ЭлПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты); 
	
	РезультатыЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ДопДанныеТЗ = РезультатыЗапросов[10].Выгрузить();
	
	Для Каждого СтрокаТЗ ИЗ ДопДанныеТЗ Цикл	
		Если СтрокаТЗ.ДокументОснование <> Неопределено Тогда
			ОбластьСтрана.Параметры.Заполнить(СтрокаТЗ);
			ОбластьДолжностьДата.Параметры.Заполнить(СтрокаТЗ);
			ОбластьРеквизиты.Параметры.ТаможенныйОрган = СтрокаТЗ.ТаможенныйОрган;	
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	
	ФайлХранилищеЛого = Неопределено; 
	
	Шапка = РезультатыЗапросов[2].Выбрать();
	Если РезультатыЗапросов[3].Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Логотип организации не установлен!";
		Сообщение.Сообщить();                                 
	Иначе
		ЛоготипВыборка = РезультатыЗапросов[3].Выбрать();
		Если ЛоготипВыборка.Следующий() Тогда
			ФайлХранилищеЛого = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(ЛоготипВыборка.Ссылка), Ложь);	
		КонецЕсли;	
	КонецЕсли;
	
	Пока Шапка.Следующий() Цикл
		
		//Начало вывода документа
		// склонение банка
		ФорматнаяСтрока = "ПД=Предложный";
		РезультатСколнения = ПолучитьСклоненияСтроки(Шапка.НаименованиеБанка, ,ФорматнаяСтрока);
		
		ОбластьШапка.Параметры.Заполнить(Шапка);
		ОбластьШапка.Параметры.Логотип = ФайлХранилищеЛого;
		
		Если Не ЗначениеЗаполнено(ОбластьШапка.Параметры.ВебСтраница) Тогда
			ОбластьШапка.Параметры.ВебСтраница = Шапка.Другое;
		КонецЕсли;
		
		ОбластьШапка.Параметры.НаименованиеБанка = РезультатСколнения[0];
		ОбластьШапка2.Параметры.Заполнить(Шапка);
		
		ОбластьРеквизиты.Параметры.Заполнить(Шапка);
		
		//Конец вывода документа
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьШапка2);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	РеквизитыВыборка = РезультатыЗапросов[5].Выбрать();
	
	Пока РеквизитыВыборка.Следующий() Цикл
		
		ОбластьРеквизиты.Параметры.Заполнить(РеквизитыВыборка);	
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьРеквизиты);
	
	СтрокаСФВыборка = РезультатыЗапросов[8].Выбрать();
	
	Пока СтрокаСФВыборка.Следующий() Цикл
		
		ОбластьСтрокаСФ = Макет.ПолучитьОбласть("СтрокаСФ");
		ОбластьСтрокаСФ.Параметры.Заполнить(СтрокаСФВыборка);
		
		ОбластьСтрокаСФ.Параметры.Сумма = Формат(СтрокаСФВыборка.Сумма, "ЧДЦ=2; ЧГ=0");
		/////////// для отладки пф +
		СобытиеСтруктура = Новый Структура;
		СобытиеСтруктура.Вставить("ИмяСобытия", "Проверка печати декларации");
		СобытиеСтруктура.Вставить("ПредставленеУровня", "Предупреждение");
		Комментарий = СтрШаблон("(Кол/сумма) пф параметры: %1 %2 ;;; выборка: %3 %4",
		ОбластьСтрокаСФ.Параметры.Количество, ОбластьСтрокаСФ.Параметры.Сумма,
		СтрокаСФВыборка.Количество, СтрокаСФВыборка.Сумма);
		СобытиеСтруктура.Вставить("Комментарий", Комментарий);
		СобытиеСтруктура.Вставить("ДатаСобытия", ТекущаяДата());
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытиеСтруктура);
		/////////// для отладки пф -
		
		ТабличныйДокумент.Вывести(ОбластьСтрокаСФ);
		
	КонецЦикла;
	
	
	ТабличныйДокумент.Вывести(ОбластьНаименование);
	
	СтрокаВидВыборка = РезультатыЗапросов[9].Выбрать();
	
	Пока СтрокаВидВыборка.Следующий() Цикл
		
		ОбластьСтрокаНаименование = Макет.ПолучитьОбласть("СтрокаНаименование");
		ОбластьСтрокаНаименование.Параметры.Заполнить(СтрокаВидВыборка);	
		ТабличныйДокумент.Вывести(ОбластьСтрокаНаименование);
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьСтрана);
	
	/////////////////
	ВыборкаУпаковка = РезультатыЗапросов[11].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	КолвоКоробок = 0;
	
	Пока ВыборкаУпаковка.Следующий() Цикл
		
		Если ВыборкаУпаковка.КолвоКоробок > 0 Тогда 
			КолвоКоробок = КолвоКоробок + Окр(ВыборкаУпаковка.КолвоКоробок + 0.5, 0, 0);; 		
		КонецЕсли;
		
	КонецЦикла;
	
	ОбластьУпаковкаСтрока = Макет.ПолучитьОбласть("УпаковкаСтрока");
	Если КолвоКоробок > 0 Тогда	
		//ОбластьУпаковкаСтрока.Параметры.Колво = КолвоКоробок;
		РезСтрока = ПолучитьСклоненияСтрокиПоЧислу(,
		КолвоКоробок,
		"картонный короб обтянутый стреп лентой и фирменным скотчем.");
		Результат = РезСтрока[0];
		НомерВтПроб = СтрНайти(Результат, " ", , , 3);
		Результат = Сред(Результат, 0, НомерВтПроб - 1) + "," + Сред(Результат, НомерВтПроб);
		ОбластьУпаковкаСтрока.Параметры.РодУпаковки = Результат;    
	Иначе
		ОбластьУпаковкаСтрока.Параметры.ИнфСообщение = "По номенклатуре нет упаковок.";		
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьУпаковкаСтрока);
	
	/////////////////
	
	ТабличныйДокумент.Вывести(ОбластьДолжностьДата);	
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатьВыпискаИзПрайсЛиста(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ВыпискаИзПрайсЛиста";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_ВыпискаИзПрайсЛиста");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.НаименованиеПолное КАК НаименованиеПолное,
	|	Организации.КПП КАК КПП,
	|	Организации.ИНН КАК ИНН,
	|	Организации.ОГРН КАК ОГРН,
	|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	БанковскиеСчетаОрганизаций.НомерСчета КАК НомерСчета,
	|	БанковскиеСчетаОрганизаций.КоррСчетБанка КАК КоррСчетБанка,
	|	БанковскиеСчетаОрганизаций.Банк КАК Банк,
	|	БанковскиеСчетаОрганизаций.БИКБанка КАК БИКБанка,
	|	БанковскиеСчетаОрганизаций.Ссылка КАК СчетСсылка
	|ПОМЕСТИТЬ втОргИБанкЭлис
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ПО (Организации.Ссылка = БанковскиеСчетаОрганизаций.Владелец)
	|ГДЕ
	|	Организации.ИНН = &ИННЭлис
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.Тип КАК Тип,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
	|	ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втКонт
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОргИБанкЭлис.Ссылка КАК Ссылка,
	|	втОргИБанкЭлис.НаименованиеПолное КАК ПолноеЮрНаименование,
	|	втОргИБанкЭлис.КПП КАК КПП,
	|	втОргИБанкЭлис.ИНН КАК ИНН,
	|	втОргИБанкЭлис.ОГРН КАК ОГРН,
	|	втОргИБанкЭлис.НаименованиеСокращенное КАК СокрЮрНаименование,
	|	втОргИБанкЭлис.СчетСсылка КАК СчетСсылка,
	|	втОргИБанкЭлис.СчетСсылка.Представление КАК СчетПредставление,
	|	втОргИБанкЭлис.НомерСчета КАК РасчСчет,
	|	втОргИБанкЭлис.КоррСчетБанка КАК КоррСчет,
	|	втОргИБанкЭлис.Банк.Наименование КАК НаименованиеБанка,
	|	втОргИБанкЭлис.БИКБанка КАК БИК,
	|	Адрес.Представление КАК Адрес,
	|	ВебСтраница.Представление КАК ВебСтраница,
	|	Телефон.Представление КАК Телефон,
	|	Факс.Представление КАК Факс,
	|	ЭлПочта.Представление КАК ЭлПочта
	|ПОМЕСТИТЬ втШапка
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Телефон
	|		ПО втОргИБанкЭлис.Ссылка = Телефон.Ссылка
	|			И (Телефон.Тип = &Телефон)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Адрес
	|		ПО втОргИБанкЭлис.Ссылка = Адрес.Ссылка
	|			И (Адрес.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Факс
	|		ПО втОргИБанкЭлис.Ссылка = Факс.Ссылка
	|			И (Факс.Тип = &Факс)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ВебСтраница
	|		ПО втОргИБанкЭлис.Ссылка = ВебСтраница.Ссылка
	|			И (ВебСтраница.Тип = &ВебСтраница)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ЭлПочта
	|		ПО втОргИБанкЭлис.Ссылка = ЭлПочта.Ссылка
	|			И (ЭлПочта.Тип = &ЭлПочта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииПрисоединенныеФайлы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втЛоготипОрганизации
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОрганизацииПрисоединенныеФайлы КАК ОрганизацииПрисоединенныеФайлы
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииПрисоединенныеФайлы.ВладелецФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаможеннаяДекларацияЭкспорт.Ссылка КАК Ссылка,
	|	ТаможеннаяДекларацияЭкспорт.Дата КАК Дата,
	|	ТаможеннаяДекларацияЭкспорт.КСП_ТаможенныйОрган КАК КСП_ТаможенныйОрган
	|ПОМЕСТИТЬ втТаможенная
	|ИЗ
	|	Документ.ТаможеннаяДекларацияЭкспорт КАК ТаможеннаяДекларацияЭкспорт
	|ГДЕ
	|	ТаможеннаяДекларацияЭкспорт.Ссылка = &СсылкаТаможенная
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация КАК Грузоотправитель,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.НаименованиеСокращенное КАК ГрузоотправительНаименование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ИНН КАК ГрузоотправительИНН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.КПП КАК ГрузоотправительКПП,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ОГРН КАК ГрузоотправительОГРН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель КАК Получатель,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.НаименованиеСокращенное КАК ПолучательНаименование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.ИНН КАК ПолучательИНН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.КПП КАК ПолучательКПП,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.ОГРН КАК ПолучательОГРН,
	|	ОрганизацияОтпрКонт.Представление КАК ГрузоотправительАдреc,
	|	ОрганизацияПолКонт.Представление КАК ПолучательАдрес,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка КАК ТаможеннаяСсылка
	|ПОМЕСТИТЬ втПередачи
	|ИЗ
	|	Документ.ТаможеннаяДекларацияЭкспорт.ДокументыОснования КАК ТаможеннаяДекларацияЭкспортДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацияПолКонт
	|		ПО (ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель = ОрганизацияПолКонт.Ссылка)
	|			И (ОрганизацияПолКонт.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацияОтпрКонт
	|		ПО (ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация = ОрганизацияОтпрКонт.Ссылка)
	|			И (ОрганизацияОтпрКонт.Тип = &Адрес)
	|ГДЕ
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка В
	|			(ВЫБРАТЬ
	|				втТаможенная.Ссылка КАК Ссылка
	|			ИЗ
	|				втТаможенная КАК втТаможенная)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втПередачиТовары
	|ИЗ
	|	втПередачи КАК втПередачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО (втПередачи.ДокументОснование = РеализацияТоваровУслугТовары.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерСтр,
	|	ЦеныНоменклатуры25СрезПоследних.Номенклатура.Представление КАК Наименование,
	|	ЦеныНоменклатуры25СрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатуры25СрезПоследних.Валюта.Представление КАК Валюта
	|ПОМЕСТИТЬ втЦены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
	|			&Дата,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						втТов.Номенклатура
	|					ИЗ
	|						втПередачиТовары КАК втТов)
	|				И ВидЦены = &ВидЦены) КАК ЦеныНоменклатуры25СрезПоследних";
	
	Запрос.УстановитьПараметр("СсылкаТаможенная", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("ИННЭлис", "6152001000");
	Запрос.УстановитьПараметр("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Факс", Перечисления.ТипыКонтактнойИнформации.Факс);
	Запрос.УстановитьПараметр("ВебСтраница", Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	Запрос.УстановитьПараметр("ЭлПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Цена розницы Основная"));
	Запрос.УстановитьПараметр("Дата", КонецМесяца(МассивОбъектов[0].Дата));
	
	РезультатыЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();	
	
	ФайлХранилищеЛого = Неопределено; 
	
	Шапка = РезультатыЗапросов[2].Выбрать();
	Если РезультатыЗапросов[3].Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Логотип организации не установлен!";
		Сообщение.Сообщить();                                 
	Иначе
		ЛоготипВыборка = РезультатыЗапросов[3].Выбрать();
		Если ЛоготипВыборка.Следующий() Тогда
			ФайлХранилищеЛого = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(ЛоготипВыборка.Ссылка), Ложь);	
		КонецЕсли;	
	КонецЕсли;
	
	Пока Шапка.Следующий() Цикл
		
		//Начало вывода документа
		// склонение банка
		ФорматнаяСтрока = "ПД=Предложный";
		РезультатСколнения = ПолучитьСклоненияСтроки(Шапка.НаименованиеБанка, ,ФорматнаяСтрока);
		
		ОбластьШапка.Параметры.Заполнить(Шапка);
		ОбластьШапка.Параметры.Логотип = ФайлХранилищеЛого;
		
		ОбластьШапка.Параметры.НаименованиеБанка = РезультатСколнения[0];
		ОбластьШапка2.Параметры.Заполнить(Шапка);
		ОбластьШапка2.Параметры.Дата = Формат(КонецДня(МассивОбъектов[0].Дата), "ДФ=dd.MM.yyyy");
		
		//Конец вывода документа
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьШапка2);
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ЦеныВыборка = РезультатыЗапросов[7].Выбрать();
	
	Пока ЦеныВыборка.Следующий() Цикл
		
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьСтрокаТаблицы.Параметры.Заполнить(ЦеныВыборка);
		
		ОбластьСтрокаТаблицы.Параметры.Цена = Формат(ЦеныВыборка.Цена, "ЧДЦ=2; ЧГ=0");
		
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатьРеализацияТоваровШтрихКоды(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_РеализацияТоваровШтрихКоды";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_РеализацияТоваровШтрихКоды");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаможеннаяДекларацияЭкспорт.Ссылка КАК Ссылка,
	|	ТаможеннаяДекларацияЭкспорт.Дата КАК Дата,
	|	ТаможеннаяДекларацияЭкспорт.КСП_ТаможенныйОрган КАК КСП_ТаможенныйОрган
	|ПОМЕСТИТЬ втТаможенная
	|ИЗ
	|	Документ.ТаможеннаяДекларацияЭкспорт КАК ТаможеннаяДекларацияЭкспорт
	|ГДЕ
	|	ТаможеннаяДекларацияЭкспорт.Ссылка = &СсылкаТаможенная
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация КАК Грузоотправитель,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.НаименованиеСокращенное КАК ГрузоотправительНаименование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ИНН КАК ГрузоотправительИНН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.КПП КАК ГрузоотправительКПП,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ОГРН КАК ГрузоотправительОГРН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель КАК Получатель,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.НаименованиеСокращенное КАК ПолучательНаименование,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.ИНН КАК ПолучательИНН,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.КПП КАК ПолучательКПП,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.ОГРН КАК ПолучательОГРН,
	|	ОрганизацияОтпрКонт.Представление КАК ГрузоотправительАдреc,
	|	ОрганизацияПолКонт.Представление КАК ПолучательАдрес,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка КАК ТаможеннаяСсылка
	|ПОМЕСТИТЬ втПередачи
	|ИЗ
	|	Документ.ТаможеннаяДекларацияЭкспорт.ДокументыОснования КАК ТаможеннаяДекларацияЭкспортДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацияПолКонт
	|		ПО (ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель = ОрганизацияПолКонт.Ссылка)
	|			И (ОрганизацияПолКонт.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацияОтпрКонт
	|		ПО (ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация = ОрганизацияОтпрКонт.Ссылка)
	|			И (ОрганизацияОтпрКонт.Тип = &Адрес)
	|ГДЕ
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка В
	|			(ВЫБРАТЬ
	|				втТаможенная.Ссылка КАК Ссылка
	|			ИЗ
	|				втТаможенная КАК втТаможенная)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ втПередачиТовары
	|ИЗ
	|	втПередачи КАК втПередачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО (втПередачи.ДокументОснование = РеализацияТоваровУслугТовары.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втПередачиТовары.Номенклатура.Код КАК Код,
	|	втПередачиТовары.Номенклатура.Артикул КАК Артикул,
	|	втПередачиТовары.Номенклатура.Представление КАК Номенклатура,
	|	втПередачиТовары.Номенклатура.НаименованиеПолное КАК ПолноеНаименование,
	|	втПередачиТовары.Характеристика.Представление КАК Характеристика,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	|ИЗ
	|	втПередачиТовары КАК втПередачиТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО (втПередачиТовары.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура)
	|			И (втПередачиТовары.Характеристика = ШтрихкодыНоменклатуры.Характеристика)";
	
	
	Запрос.УстановитьПараметр("СсылкаТаможенная", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатьРеализацияТоваров(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_РеализацияТоваров";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_РеализацияТоваров");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	// надо переделать
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаможеннаяДекларацияЭкспорт.Ссылка КАК Ссылка,
	               |	ТаможеннаяДекларацияЭкспорт.Дата КАК Дата,
	               |	ТаможеннаяДекларацияЭкспорт.КСП_ТаможенныйОрган КАК КСП_ТаможенныйОрган
	               |ПОМЕСТИТЬ втТаможенная
	               |ИЗ
	               |	Документ.ТаможеннаяДекларацияЭкспорт КАК ТаможеннаяДекларацияЭкспорт
	               |ГДЕ
	               |	ТаможеннаяДекларацияЭкспорт.Ссылка = &СсылкаТаможенная
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование КАК ДокументОснование,
	               |	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация КАК Грузоотправитель,
	               |	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.НаименованиеСокращенное КАК ГрузоотправительНаименование,
	               |	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ИНН КАК ГрузоотправительИНН,
	               |	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.КПП КАК ГрузоотправительКПП,
	               |	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация.ОГРН КАК ГрузоотправительОГРН,
	               |	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель КАК Получатель,
	               |	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.НаименованиеСокращенное КАК ПолучательНаименование,
	               |	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.ИНН КАК ПолучательИНН,
	               |	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.КПП КАК ПолучательКПП,
	               |	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель.ОГРН КАК ПолучательОГРН,
	               |	ОрганизацияОтпрКонт.Представление КАК ГрузоотправительАдреc,
	               |	ОрганизацияПолКонт.Представление КАК ПолучательАдрес,
	               |	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка КАК ТаможеннаяСсылка
	               |ПОМЕСТИТЬ втПередачи
	               |ИЗ
	               |	Документ.ТаможеннаяДекларацияЭкспорт.ДокументыОснования КАК ТаможеннаяДекларацияЭкспортДокументыОснования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацияПолКонт
	               |		ПО ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.ОрганизацияПолучатель = ОрганизацияПолКонт.Ссылка
	               |			И (ОрганизацияПолКонт.Тип = &Адрес)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацияОтпрКонт
	               |		ПО ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Организация = ОрганизацияОтпрКонт.Ссылка
	               |			И (ОрганизацияОтпрКонт.Тип = &Адрес)
	               |ГДЕ
	               |	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втТаможенная.Ссылка КАК Ссылка
	               |			ИЗ
	               |				втТаможенная КАК втТаможенная)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДокументОснование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	РеализацияТоваровУслугТовары.Номенклатура.КСП_АртикулУПП.Капсула КАК Капсула,
	               |	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	               |	РеализацияТоваровУслугТовары.Количество КАК Количество,
	               |	РеализацияТоваровУслугТовары.Цена КАК Цена,
	               |	РеализацияТоваровУслугТовары.Сумма КАК Сумма
	               |ПОМЕСТИТЬ втПередачиТовары
	               |ИЗ
	               |	втПередачи КАК втПередачи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |		ПО втПередачи.ДокументОснование = РеализацияТоваровУслугТовары.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугТовары.Номенклатура,
	               |	РеализацияТоваровУслугТовары.Характеристика,
	               |	РеализацияТоваровУслугТовары.Количество,
	               |	РеализацияТоваровУслугТовары.Цена,
	               |	РеализацияТоваровУслугТовары.Сумма,
	               |	РеализацияТоваровУслугТовары.Номенклатура.КСП_АртикулУПП.Капсула
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод,
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	               |	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	               |ПОМЕСТИТЬ втШтрихкоды
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	(ШтрихкодыНоменклатуры.Номенклатура, ШтрихкодыНоменклатуры.Характеристика) В
	               |			(ВЫБРАТЬ
	               |				Т.Номенклатура,
	               |				Т.Характеристика
	               |			ИЗ
	               |				втПередачиТовары КАК Т)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ШтрихкодыНоменклатуры.Номенклатура,
	               |	ШтрихкодыНоменклатуры.Характеристика
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втПередачиТовары.Номенклатура.Код КАК Код,
	               |	втПередачиТовары.Номенклатура.Артикул КАК Артикул,
	               |	втПередачиТовары.Номенклатура.Представление КАК Номенклатура,
	               |	втПередачиТовары.Номенклатура.НаименованиеПолное КАК ПолноеНаименование,
	               |	втПередачиТовары.Капсула КАК Капсула,
	               |	втПередачиТовары.Характеристика.Представление КАК Характеристика,
	               |	втПередачиТовары.Количество КАК Количество,
	               |	втПередачиТовары.Цена КАК Цена,
	               |	втПередачиТовары.Сумма КАК Сумма,
	               |	втПередачиТовары.Номенклатура.Марка.Представление КАК ТорговаяМарка,
	               |	втПередачиТовары.Номенклатура.КоллекцияНоменклатуры.Ссылка КАК КоллекцияСсылка,
	               |	втШтрихкоды.Штрихкод КАК Штрихкод
	               |ИЗ
	               |	втПередачиТовары КАК втПередачиТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втШтрихкоды КАК втШтрихкоды
	               |		ПО втПередачиТовары.Номенклатура = втШтрихкоды.Номенклатура
	               |			И втПередачиТовары.Характеристика = втШтрихкоды.Характеристика";
	
	
	Запрос.УстановитьПараметр("СсылкаТаможенная", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		
		РезультатПоКоллекции = ПолучитьКоллекциюИКапсулу(Выборка.КоллекцияСсылка);
		
		РезультатПоКоллекции.Свойство("Коллекция", ОбластьСтрока.Параметры.Коллекция);
		//РезультатПоКоллекции.Свойство("Капсула", ОбластьСтрока.Параметры.Капсула);				
		
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПолучитьКоллекциюИКапсулу(КоллекцияСсылка)
	
	РезультатПоКоллекции = Новый Структура;
	
	// < Кодерлайн 2024.07.27 УваровДС
	// УЖЕ ПОХОДУ НЕ НУЖНО ПОСЛЕ ОБНОВЛЕНИЯ НОМЕНКЛАТУРЫ И КАПСУЛ, ПОКА ОСТАВИЛ
	
    РезультатПоКоллекции.Вставить("Коллекция", КоллекцияСсылка);
	// проверка на дочерние элементы, если их нет, то это капсула
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	КоллекцииНоменклатуры.Ссылка КАК Ссылка,
	//|	КоллекцииНоменклатуры.Родитель КАК Родитель
	//|ИЗ
	//|	Справочник.КоллекцииНоменклатуры КАК КоллекцииНоменклатуры
	//|ГДЕ
	//|	КоллекцииНоменклатуры.Родитель = &КоллекцияСсылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	КоллекцииНоменклатуры.Ссылка КАК Ссылка,
	//|	КоллекцииНоменклатуры.Родитель КАК Р1,
	//|	КоллекцииНоменклатуры.Родитель.Родитель КАК Р2,
	//|	КоллекцииНоменклатуры.Родитель.Родитель.Родитель КАК Р3,
	//|	КоллекцииНоменклатуры.Родитель.Родитель.Родитель.Родитель КАК Р4
	//|ИЗ
	//|	Справочник.КоллекцииНоменклатуры КАК КоллекцииНоменклатуры
	//|ГДЕ
	//|	КоллекцииНоменклатуры.Ссылка = &КоллекцияСсылка";
	//
	//Запрос.УстановитьПараметр("КоллекцияСсылка", КоллекцияСсылка);
	//
	//РезультатыЗапросов = Запрос.ВыполнитьПакет();
	//
	//// коллекция
	//// --вывеска
	//// ----капсула
	//
	//// когда коллекция - это капсула
	//Если РезультатыЗапросов[0].Пустой() Тогда
	//	
	//	ВыборкаРодитель = РезультатыЗапросов[1].Выбрать();
	//	
	//	Если ВыборкаРодитель.Следующий() Тогда	
	//		РезультатПоКоллекции.Вставить("Капсула", ВыборкаРодитель.Ссылка);
	//		РезультатПоКоллекции.Вставить("Коллекция", ВыборкаРодитель.Р2);			
	//	КонецЕсли;			
	//Иначе
	//	ВыборкаРодитель = РезультатыЗапросов[1].Выбрать();
	//	СчетчикДоКонцаИерархии = 0;
	//	
	//	Если ВыборкаРодитель.Следующий() Тогда
	//		// через 3 элемента заполнено значит это вывеска, иначе это и есть сама коллекция
	//		Если ЗначениеЗаполнено(ВыборкаРодитель.Р3) Тогда	
	//			РезультатПоКоллекции.Вставить("Капсула", "");
	//			РезультатПоКоллекции.Вставить("Коллекция", ВыборкаРодитель.Р1);	
	//		ИначеЕсли ЗначениеЗаполнено(ВыборкаРодитель.Р2) Тогда
	//			РезультатПоКоллекции.Вставить("Капсула", "");
	//			РезультатПоКоллекции.Вставить("Коллекция", ВыборкаРодитель.Ссылка);
	//		Иначе // это сезон или еще что то выше
	//			РезультатПоКоллекции.Вставить("Капсула", "");
	//			РезультатПоКоллекции.Вставить("Коллекция", "");	
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	///////////////  
	
	// >  Кодерлайн 2024.07.27 УваровДС 
	Возврат РезультатПоКоллекции;
	
КонецФункции

Процедура РасчетШириныКолонок(ТабличныйДокумент)
	
	Перем МаксимальноеКоличествоСтрок, МаксимальнаяШиринаКолонки;
	Перем КонечнаяСтрока, НачальнаяСтрока, ТекущаяКолонка, ТекущаяСтрока, НачалоДанных;
	Перем ОбластьШапки, ОбластьПодвала;
	Перем ШиринаКолонки, ТекстЯчейки, НомерСтрокиТекста;
	Перем КоличествоУровнейГруппировокСтрок, Отступ;
	Перем ШириныКолонок;
	
	// Максимальное количество строк отчета, которые будут использованы для расчета ширин колонок
	
	МаксимальноеКоличествоСтрок = 50;
	// Ограничение максимальной ширины колонки
	
	МаксимальнаяШиринаКолонки = 50;
	// Массив, в который будут помещаться ширины колонок
	
	ШириныКолонок = Новый Массив;
	// Получим количество уровней группировок в отчете для учета автоматического отступа
	
	КоличествоУровнейГруппировокСтрок = ТабличныйДокумент.КоличествоУровнейГруппировокСтрок();
	
	// Инициализируем начальные строки
	
	НачальнаяСтрока = 0;
	НачалоДанных = 0;
	
	// Найдем в результирующем документе область шапки таблицы
	
	ОбластьШапки = ТабличныйДокумент.Области.Найти("ШапкаТаблицы");
	Если ТипЗнч(ОбластьШапки) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		
		// Из шапки таблицы получим начальную строку с которой будем рассчитывать ширины
		НачальнаяСтрока = ОбластьШапки.Верх;
		НачалоДанных = ОбластьШапки.Низ + 1;
	Иначе
		
		// Если область шапки таблицы не найдена, найдем область шапки строк
		ОбластьШапки = ТабличныйДокумент.Области.Найти("ШапкаСтрок");
		Если ТипЗнч(ОбластьШапки) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			
			// Из шапки таблицы получим начальную строку с которой будем рассчитывать ширины
			НачальнаяСтрока = ОбластьШапки.Верх;
			НачалоДанных = ОбластьШапки.Низ + 1;
			
		КонецЕсли;
	КонецЕсли;
	
	// Получим область подвала отчета и вычислим конечную строку расчета
	
	ОбластьПодвала = ТабличныйДокумент.Области.Найти("Подвал");
	Если ТипЗнч(ОбластьПодвала) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		// Область подвала найдена
		КонечнаяСтрока = ОбластьПодвала.Верх - 1;
		Если КонечнаяСтрока - НачальнаяСтрока > МаксимальноеКоличествоСтрок Тогда
			КонечнаяСтрока = НачальнаяСтрока + МаксимальноеКоличествоСтрок;
		КонецЕсли;
	Иначе 
		// Область подвала не найдена
		КонечнаяСтрока = НачальнаяСтрока + МаксимальноеКоличествоСтрок;
	КонецЕсли;
	
	// Ограничим конечную строку
	КонечнаяСтрока = Мин(КонечнаяСтрока, ТабличныйДокумент.ВысотаТаблицы);
	// Переберем все колонки отчета
	Для ТекущаяКолонка = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		АвтоОтступ = 0;
		// Переберем строки, которые будут использованы для расчета ширин колонок
		Для ТекущаяСтрока = НачальнаяСтрока По КонечнаяСтрока Цикл
			ШиринаКолонки = 0;
			// Получим область текущей ячейки
			ОбластьЯчейки = ТабличныйДокумент.Область(ТекущаяСтрока, ТекущаяКолонка);
			Если ОбластьЯчейки.Лево <> ТекущаяКолонка Или ОбластьЯчейки.Верх <> ТекущаяСтрока Тогда
				// Данная ячейка принадлежит объединенным ячейкам и не является начальной ячейкой
				Продолжить;
			КонецЕсли;
			Если КоличествоУровнейГруппировокСтрок > 0 И ТекущаяСтрока = НачалоДанных Тогда
				// Для первой строки с данными получим значение автоотступа
				АвтоОтступ = ОбластьЯчейки.АвтоОтступ;
			КонецЕсли;
			// Получим текст ячейки
			ТекстЯчейки = ОбластьЯчейки.Текст;
			// Для каждой строки из текста ячейки рассчитаем количество символов в строке
			Для НомерСтрокиТекста = 1 По СтрЧислоСтрок(ТекстЯчейки) Цикл
				ШиринаТекстаЯчейки = СтрДлина(СтрПолучитьСтроку(ТекстЯчейки, НомерСтрокиТекста));
				// Если используется автоотступ, то прибавим к ширине ячейки его величину
				Если АвтоОтступ <> Неопределено И АвтоОтступ > 0 Тогда
					ШиринаТекстаЯчейки = ШиринаТекстаЯчейки + КоличествоУровнейГруппировокСтрок * АвтоОтступ;
				КонецЕсли;
				ШиринаКолонки = Макс(ШиринаКолонки, ШиринаТекстаЯчейки);
			КонецЦикла;
			
			Если ШиринаКолонки > МаксимальнаяШиринаКолонки Тогда
				// Ограничим ширину колонки
				ШиринаКолонки = МаксимальнаяШиринаКолонки;
			КонецЕсли;
			Если ШиринаКолонки <> 0 Тогда
				// Ширина колонки рассчитана
				// Определим, сколько ячеек по ширине используется в области для текущей ячейки
				КоличествоКолонок = ОбластьЯчейки.Право - ОбластьЯчейки.Лево;
				// Переберем все ячейки, расположенные в области
				Для НомерКолонки = 0 По КоличествоКолонок Цикл
					Если ШириныКолонок.ВГраница() > ТекущаяКолонка - 1 + НомерКолонки Тогда
						// В массиве ширин колонок уже был элемент для текущей колонки
						Если ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки] = Неопределено Тогда
							// Значение ширины колонки еще не было установлено
							ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки] = ШиринаКолонки / (КоличествоКолонок + 1);
						Иначе
							// Значение ширины колонки уже было установлено
							// Вычислим максимум ширины колонки
							ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки] = 
							Макс(ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки], ШиринаКолонки / (КоличествоКолонок + 1));
						КонецЕсли;
					Иначе
						// В массиве ширин колонок еще не было элемента для данной колонки
						// Добавим элемент в массив ширин колонок
						ШириныКолонок.Вставить(ТекущаяКолонка - 1 + НомерКолонки, ШиринаКолонки / (КоличествоКолонок + 1));
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;    // Конец цикла перебора строк
	КонецЦикла;    // Конец цикла перебора колонок
	
	// Переберем все элементы в массиве вычисленных ширин колонок
	Для ТекущаяКолонка = 0 По ШириныКолонок.ВГраница() Цикл
		Если ШириныКолонок[ТекущаяКолонка] <> Неопределено Тогда
			// Ширина колонок установлена
			// Установим ширину области ячеек
			ТабличныйДокумент.Область(, ТекущаяКолонка + 1, НачалоДанных, ТекущаяКолонка + 1).ШиринаКолонки = ШириныКолонок[ТекущаяКолонка] + 1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры  

// --- УваровДС
