// +++ УваровДС 14/12/2023
// заново добавил кнопку печать

#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
&После("ДобавитьКомандыПечати")
Процедура КСП_ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Декларация
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ТаможеннаяДекларацияЭкспорт";
	КомандаПечати.Идентификатор = "Декларация";                     
	//КомандаПечати.МестоРазмещения = "<ИмяПодменюНаФорме>";
	КомандаПечати.Представление = НСтр("ru = 'Декларация о происхождении товара'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	
КонецПроцедуры

#КонецОбласти


// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати – Структура – дополнительные настройки печати;
//  КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
//  ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
//                                            представление – имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Декларация");
	Если ПечатнаяФорма <> Неопределено Тогда
		ПечатнаяФорма.ТабличныйДокумент = ПечатьДекларация(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'КСП ПФ MXL декларация'");
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ТаможеннаяДекларацияЭкспорт.ПФ_MXL_Декларация";
	КонецЕсли;
	
КонецПроцедуры      

// Формирует табличный документ печатной формы "Счет на оплату"
//
// Параметры:
//  МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати – Структура – дополнительные настройки печати;
//
Функция ПечатьДекларация(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Декларация";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТаможеннаяДекларацияЭкспорт.КСП_ПФ_MXL_Декларация");
	
	МассивОбластейМакета = Новый Массив;
	МассивОбластейМакета.Добавить("Шапка");
	МассивОбластейМакета.Добавить("ШапкаТаблицы");
	МассивОбластейМакета.Добавить("Строка");
	МассивОбластейМакета.Добавить("Подвал");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьРеквизиты = Макет.ПолучитьОбласть("Реквизиты");
	ОбластьСтрокаСФ = Макет.ПолучитьОбласть("СтрокаСФ");
	ОбластьНаименование = Макет.ПолучитьОбласть("Наименование");
	ОбластьСтрокаНаименование = Макет.ПолучитьОбласть("СтрокаНаименование");
	ОбластьФутер = Макет.ПолучитьОбласть("Футер");
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьШапка2);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.Вывести(ОбластьРеквизиты);
	ТабличныйДокумент.Вывести(ОбластьСтрокаСФ);
	ТабличныйДокумент.Вывести(ОбластьНаименование);
	ТабличныйДокумент.Вывести(ОбластьСтрокаНаименование);
	ТабличныйДокумент.Вывести(ОбластьФутер);
	
	ДокументПередачаТоваров = МассивОбъектов[0].ДокументОснование;
	
	// Получаем запросом необходимые данные.
	//Запрос = Новый Запрос();
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ТаможеннаяДекларацияЭкспорт.Ссылка КАК Ссылка,
	//|	ТаможеннаяДекларацияЭкспорт.Номер КАК Номер,
	//|	ТаможеннаяДекларацияЭкспорт.Дата КАК Дата,
	//|	ТаможеннаяДекларацияЭкспорт.КСП_НалогообложениеНДС КАК КСП_НалогообложениеНДС,
	//|	ТаможеннаяДекларацияЭкспорт.Ответственный КАК Ответственный,
	//|	ТаможеннаяДекларацияЭкспорт.КодОперации КАК КодОперации,
	//|	ТаможеннаяДекларацияЭкспорт.СборСопроводительныхДокументовЗавершен КАК СборСопроводительныхДокументовЗавершен,
	//|	ТаможеннаяДекларацияЭкспорт.Примечание КАК Примечание,
	//|	ТаможеннаяДекларацияЭкспорт.Организация КАК Организация,
	//|	ТаможеннаяДекларацияЭкспорт.Комментарий КАК Комментарий,
	//|	ТаможеннаяДекларацияЭкспорт.Представление КАК Представление,
	//|	ТаможеннаяДекларацияЭкспорт.МоментВремени КАК МоментВремени
	//|ПОМЕСТИТЬ втДекларация
	//|ИЗ
	//|	Документ.ТаможеннаяДекларацияЭкспорт КАК ТаможеннаяДекларацияЭкспорт
	//|ГДЕ
	//|	ТаможеннаяДекларацияЭкспорт.Ссылка = &СсылкаДекларация
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ПередачаТоваровМеждуОрганизациями.Ссылка КАК Ссылка,
	//|	ПередачаТоваровМеждуОрганизациями.Номер КАК Номер,
	//|	ПередачаТоваровМеждуОрганизациями.Дата КАК Дата,
	//|	ПередачаТоваровМеждуОрганизациями.Подразделение КАК Подразделение,
	//|	ПередачаТоваровМеждуОрганизациями.НаправлениеДеятельности КАК НаправлениеДеятельности,
	//|	ПередачаТоваровМеждуОрганизациями.Склад КАК Склад,
	//|	ПередачаТоваровМеждуОрганизациями.РасчетыЧерезОтдельногоКонтрагента КАК РасчетыЧерезОтдельногоКонтрагента,
	//|	ПередачаТоваровМеждуОрганизациями.Организация КАК Организация,
	//|	ПередачаТоваровМеждуОрганизациями.ОрганизацияПолучатель КАК ОрганизацияПолучатель,
	//|	ПередачаТоваровМеждуОрганизациями.Партнер КАК Партнер,
	//|	ПередачаТоваровМеждуОрганизациями.Контрагент КАК Контрагент,
	//|	ПередачаТоваровМеждуОрганизациями.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	//|	ПередачаТоваровМеждуОрганизациями.Договор КАК Договор,
	//|	ПередачаТоваровМеждуОрганизациями.ДоговорПродажи КАК ДоговорПродажи,
	//|	ПередачаТоваровМеждуОрганизациями.ДоговорПокупки КАК ДоговорПокупки,
	//|	ПередачаТоваровМеждуОрганизациями.Комментарий КАК Комментарий,
	//|	ПередачаТоваровМеждуОрганизациями.ВидЦены КАК ВидЦены,
	//|	ПередачаТоваровМеждуОрганизациями.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	//|	ПередачаТоваровМеждуОрганизациями.ГруппаФинансовогоУчетаПолучателя КАК ГруппаФинансовогоУчетаПолучателя,
	//|	ПередачаТоваровМеждуОрганизациями.УказыватьНомераГТД КАК УказыватьНомераГТД,
	//|	ПередачаТоваровМеждуОрганизациями.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	//|	ПередачаТоваровМеждуОрганизациями.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	//|	ПередачаТоваровМеждуОрганизациями.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	//|	ПередачаТоваровМеждуОрганизациями.НаименованиеВходящегоДокумента КАК НаименованиеВходящегоДокумента,
	//|	ПередачаТоваровМеждуОрганизациями.Автор КАК Автор,
	//|	ПередачаТоваровМеждуОрганизациями.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	//|	ПередачаТоваровМеждуОрганизациями.НалогообложениеНДС КАК НалогообложениеНДС,
	//|	ПередачаТоваровМеждуОрганизациями.ПередачаПодДеятельность КАК ПередачаПодДеятельность,
	//|	ПередачаТоваровМеждуОрганизациями.ВариантОформленияПродажи КАК ВариантОформленияПродажи,
	//|	ПередачаТоваровМеждуОрганизациями.КСП_ДоговорКонтрагентов КАК КСП_ДоговорКонтрагентов,
	//|	ПередачаТоваровМеждуОрганизациями.Представление КАК Представление
	//|ПОМЕСТИТЬ втПередача
	//|ИЗ
	//|	Документ.ПередачаТоваровМеждуОрганизациями КАК ПередачаТоваровМеждуОрганизациями";
	//
	//Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	//Шапка = Запрос.Выполнить().Выбрать();
	//
	//ПервыйДокумент = Истина;
	
	
	
	//Пока Шапка.Следующий() Цикл
	//	
	//	Если Не ПервыйДокумент Тогда
	//        // Все документы нужно выводить на разных страницах.
	//        ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//    КонецЕсли;
	//    ПервыйДокумент = Ложь;
	//    // Запомним номер строки, с которой начали выводить текущий документ.
	//    НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
	//	//Начало вывода документа
	//	//...алгоритм заполнения табличного документа...
	//	//Конец вывода документа
	//	
	//    // В табличном документе необходимо задать имя области, в которую был 
	//    // выведен объект. Нужно для возможности печати комплектов документов.
	//    УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
	//        НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	
	//КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 


// --- УваровДС
