
&НаСервере
Процедура СохранитьНастройкуНаСервере()
	
	МенеджерЗаписи = РегистрыСведений.КСП_ЗначенияПроизвольныхПараметров.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.Параметр = ПланыВидовХарактеристик.КСП_ПроизвольныеПараметры.РаспределятьECOMВРамкахРозницы;
	МенеджерЗаписи.Значение = Объект.РаспределятьECOMВРамкахРозницы;
	МенеджерЗаписи.Записать(Истина)
		
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройку(Команда)
	СохранитьНастройкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Объект.РаспределятьECOMВРамкахРозницы = ОбработкаОбъект.ПолучитьНастройкуРаспределенияECOM();
	
КонецПроцедуры
