
#Область КСП_ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура КСП_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Коллекция номенклатуры
	НовыйЭлемент = Элементы.Добавить(
		"КСП_Коллекция", Тип("ПолеФормы"), Элементы.ГруппаДополнительно);
	НовыйЭлемент.ПутьКДанным = "Объект.КСП_Коллекция";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Коллекция номенклатуры";
	НовыйЭлемент.ТолькоПросмотр = ЗначениеЗаполнено(Объект.КСП_Коллекция);
	НовыйЭлемент.КнопкаСоздания = Ложь;
	
	// Тип документа резерва
	НовыйЭлемент = Элементы.Добавить(
		"КСП_ТипДокументаСлужебногоРезерва", Тип("ПолеФормы"), Элементы.ГруппаДополнительно);
	НовыйЭлемент.ПутьКДанным = "Объект.КСП_ТипДокументаСлужебногоРезерва";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Тип документа резерва";
	НовыйЭлемент.ТолькоПросмотр = ЗначениеЗаполнено(Объект.КСП_ТипДокументаСлужебногоРезерва);
	
КонецПроцедуры

#КонецОбласти
