
&НаКлиенте
Процедура ОбновитьДерево(ОбновитьПринудительно = Ложь)
	
	Если ОбновитьПринудительно ИЛИ Модифицированность Тогда	
		ОбновитьДеревоНаСервере();	
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьДеревоНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзПлан.Клиент КАК Клиент,
		|	тзПлан.ПланПродаж КАК ПланПродаж
		|ПОМЕСТИТЬ втПлан
		|ИЗ
		|	&тзПлан КАК тзПлан
		|;
		|    
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Партнеры.Родитель КАК Родитель,
		|	Партнеры.Ссылка КАК Клиент,
		|	втПлан.ПланПродаж КАК ПланПродаж
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПлан КАК втПлан
		|		ПО Партнеры.Ссылка = втПлан.Клиент
		|ГДЕ
		|	Партнеры.Ссылка В ИЕРАРХИИ (&Партнеры)";
	
	тзПлан = Объект.План.Выгрузить();
	Запрос.УстановитьПараметр("тзПлан", тзПлан);
	Запрос.УстановитьПараметр("Партнеры", тзПлан.ВыгрузитьКолонку("Клиент"));
	
	ВыборкаИерархии = Запрос.Выполнить().Выбрать();
	//Запрос.Выполнить().Выгрузить()
	
	ДеревоЗначений = Новый ДеревоЗначений;
	ДеревоЗначений.Колонки.Добавить("Клиент", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	ДеревоЗначений.Колонки.Добавить("ПланПродаж", Новый ОписаниеТипов(Новый КвалификаторыЧисла(10, 2)));
	
	Пока ВыборкаИерархии.Следующий() Цикл
		
		НайденаяСтрока = ДеревоЗначений.Строки.Найти(ВыборкаИерархии.Родитель, "Клиент", Истина);
		Если НайденаяСтрока <> Неопределено Тогда
			НоваяСтрока = НайденаяСтрока.Строки.Добавить();
		Иначе
			НоваяСтрока = ДеревоЗначений.Строки.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаИерархии);
	
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначений, "Дерево");

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДерево(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	ОбновитьДерево(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Развенуть(Команда)

	РазвенутьСвернутьДерево();

КонецПроцедуры

&НаКлиенте
Процедура РазвенутьСвернутьДерево(Развенуть = Истина)
	
	
	ЭлементыДерева = Дерево.ПолучитьЭлементы();
	Для каждого ЭлементДерева Из ЭлементыДерева Цикл
		
		ид = ЭлементДерева.ПолучитьИдентификатор();
		Если Развенуть Тогда
			Элементы.Дерево.Развернуть(ид, Истина);			
		иначе
			Элементы.Дерево.Свернуть(ид);						
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	
	РазвенутьСвернутьДерево(Ложь);
	
КонецПроцедуры
