
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура КСП_СтраницыКарточкаНоменклатурыПриСменеСтраницыВместо(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаРеквизитыАртикулУПП" Тогда
		// пропустить
	Иначе
		ОбработатьСменуСтраницКарточкиНоменклатуры(ТекущаяСтраница);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КСП_АртикулУПППриИзмененииПослеНаСервере()
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.КСП_АртикулУПП, 
	"ВерхНиз, ВидВоспроизводства, ВидПродукции, ВидТорговли, ВозрастнаяГруппа, 
	| ДатаИзготовления, Капсула, Ликвидность, Модность, ХарактерТканиНоменклатуры, Цвет");
	
КонецФункции

&НаКлиенте
Процедура КСП_КСП_АртикулУПППриИзмененииПосле(Элемент)
	
	рекв_АртикулУПП = КСП_АртикулУПППриИзмененииПослеНаСервере();
	
	ВерхНиз 				= рекв_АртикулУПП.ВерхНиз;
	ВидВоспроизводства 		= рекв_АртикулУПП.ВидВоспроизводства;
	ВидПродукции 			= рекв_АртикулУПП.ВидПродукции;
	ВидТорговли 			= рекв_АртикулУПП.ВидТорговли;
	ВозрастнаяГруппа 		= рекв_АртикулУПП.ВозрастнаяГруппа;
	ДатаИзготовления 		= рекв_АртикулУПП.ДатаИзготовления;
	Капсула 				= рекв_АртикулУПП.Капсула;
	Ликвидность 			= рекв_АртикулУПП.Ликвидность;
	Модность 				= рекв_АртикулУПП.Модность;
	ХарактерТканиНоменклатуры = рекв_АртикулУПП.ХарактерТканиНоменклатуры;
	Цвет 					= рекв_АртикулУПП.Цвет;
	
КонецПроцедуры

&НаКлиенте
Процедура КСП_ПриОткрытииПосле(Отказ)
	
	Если ЗначениеЗаполнено(Объект.КСП_АртикулУПП) Тогда
		
		рекв_АртикулУПП = КСП_АртикулУПППриИзмененииПослеНаСервере();
		
		ВерхНиз 				= рекв_АртикулУПП.ВерхНиз;
		ВидВоспроизводства 		= рекв_АртикулУПП.ВидВоспроизводства;
		ВидПродукции 			= рекв_АртикулУПП.ВидПродукции;
		ВидТорговли 			= рекв_АртикулУПП.ВидТорговли;
		ВозрастнаяГруппа 		= рекв_АртикулУПП.ВозрастнаяГруппа;
		ДатаИзготовления 		= рекв_АртикулУПП.ДатаИзготовления;
		Капсула 				= рекв_АртикулУПП.Капсула;
		Ликвидность 			= рекв_АртикулУПП.Ликвидность;
		Модность 				= рекв_АртикулУПП.Модность;
		ХарактерТканиНоменклатуры = рекв_АртикулУПП.ХарактерТканиНоменклатуры;
		Цвет 					= рекв_АртикулУПП.Цвет;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИмяТаблицы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
