
Функция ХарактеристикаПоЦО(ХарактеристикаЦО) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ХарактеристикаЦО);
	
	Запрос.Текст = " ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры           
	|	
	|Где 
	|   ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования = &Ссылка";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда 
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий()ЦИкл
			
			Возврат Выборка.Ссылка;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции