// лейсан
&НаКлиенте
Процедура КСП_КСП_ПроцентСкидкиПриИзмененииПосле(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;  
	СтрокаТабличнойЧасти.КСП_СправочнаяЦена = СтрокаТабличнойЧасти.Цена; 
	СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Цена - (СтрокаТабличнойЧасти.КСП_ПроцентСкидки / 100) * СтрокаТабличнойЧасти.Цена;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
КонецПроцедуры

// +++ УваровДС 05/12/2023
// добавить Налогообложение Экспорт в список выбора (для создания на основании Таможенной декларации

&НаСервере
&После("ПриЧтенииСозданииНаСервере")
Процедура КСП_ПриЧтенииСозданииНаСервере()
	
	ПараметрыЗаполнения = Документы.ПередачаТоваровМеждуОрганизациями.ПараметрыЗаполненияНалогообложенияНДС(Объект);
	
	// чтобы процедура ниже отработала так, чтобы добавился тип Экспорт
	ПараметрыЗаполнения.ЭтоОперацияМеждуОрганизациями = Ложь;
	
	УчетНДСУП.ЗаполнитьСписокВыбораНалогообложенияНДСПродажи(Элементы.НалогообложениеНДС,
															Объект.НалогообложениеНДС,
															ПараметрыЗаполнения,
														УчетНДСКэшированныеЗначенияПараметров);
	
КонецПроцедуры

// +++ УваровДС 13/12/2023
// форма для выбора договора между контрагентами организаций
&НаКлиенте
Процедура КСП_КСП_ДоговорКонтрагентовНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыСтруктура = Новый Структура();
	
	ПараметрыСтруктура.Вставить("РежимВыбора", Истина);     
 	ПараметрыСтруктура.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы); 
    ПараметрыСтруктура.Вставить("РазрешитьВыборКорня", Ложь);    
 
    ПараметрыСтруктура.Вставить("ЗакрыватьПослеВыбора", Истина); 
	
	КонтрагентПолучатель = КСП_ПолучитьКонтрагента(Объект.ОрганизацияПолучатель);
	ПартнерПолучателя = КСП_ПолучитьПартнераКонтрагента(КонтрагентПолучатель);
	
	Если ПартнерПолучателя <> Неопределено И КонтрагентПолучатель <> Неопределено Тогда
		ПараметрыСтруктура.Вставить("Контрагент", КонтрагентПолучатель);
		ПараметрыСтруктура.Вставить("Партнер", ПартнерПолучателя);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Проверьте заполненность организаций и их контрагентов (КСП)!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Документ.ПередачаТоваровМеждуОрганизациями.Форма.КСП_ФормаВыбораКонтрагентов", ПараметрыСтруктура, Элементы.КСП_ДоговорКонтрагентов, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры                                                                                                                               

&НаКлиенте
Процедура КСП_КСП_ДоговорКонтрагентовОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.КСП_ДоговорКонтрагентов = ВыбранноеЗначение;
	ЭтотОбъект.Записать();
КонецПроцедуры

&НаСервере
Функция КСП_ПолучитьКонтрагента(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.КСП_Контрагент КАК КСП_Контрагент
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.КСП_Контрагент;
	КонецЦикла;	
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция КСП_ПолучитьПартнераКонтрагента(Контрагент)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Партнер КАК Партнер
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Партнер;
	КонецЦикла;	
	
	Возврат Неопределено;		

КонецФункции // КСП_ПолучитьПартнераКонтрагента()


// --- УваровДС


