
&Вместо("ВыполнитьТранспортСообщенияОбменаПолучение")
Процедура КСП_ВыполнитьТранспортСообщенияОбменаПолучение(СтруктураНастроекОбмена, ИспользоватьПсевдоним, СтекОшибок)
	//// Вставить содержимое метода.
	//ПродолжитьВызов(СтруктураНастроекОбмена, ИспользоватьПсевдоним, СтекОшибок);

	Если СтекОшибок = Неопределено Тогда
		СтекОшибок = Новый Массив;
	КонецЕсли;
	
	// Получаем инициализированную обработку транспорта сообщений.
	ОбработкаТранспортаСообщенийОбмена = СтруктураНастроекОбмена.ОбработкаТранспортаСообщенийОбмена;
	ОбработкаТранспортаСообщенийОбмена.УзелИнформационнойБазы = СтруктураНастроекОбмена.УзелИнформационнойБазы;
	
	// Получаем сообщение обмена во временный каталог.
	Если Не ОбработкаТранспортаСообщенийОбмена.ПодключениеУстановлено() Тогда
		
		СтекОшибок.Добавить(ОбработкаТранспортаСообщенийОбмена.СтрокаСообщенияОбОшибкеЖР);
		
		Если Не ИспользоватьПсевдоним Тогда
			// Больше попыток поиска файла не будет, поэтому регистрируем все накопленные ошибки.
			Для Каждого ТекущаяОшибка Из СтекОшибок Цикл
				ЗаписьЖурналаРегистрацииОбменаДанными(ТекущаяОшибка, СтруктураНастроекОбмена, Истина);
			КонецЦикла;
		КонецЕсли;
		
		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Ошибка_ТранспортСообщения;
		
	КонецЕсли;
	
	//кодерлайн
	Если Не ОбработкаТранспортаСообщенийОбмена.ПолучитьСообщение() Тогда
		
		//СтекОшибок.Добавить(ОбработкаТранспортаСообщенийОбмена.СтрокаСообщенияОбОшибкеЖР);
		
		//Если Не ИспользоватьПсевдоним Тогда
		//	// Больше попыток поиска файла не будет, поэтому регистрируем все накопленные ошибки.
		//	Для Каждого ТекущаяОшибка Из СтекОшибок Цикл
		//		ЗаписьЖурналаРегистрацииОбменаДанными(ТекущаяОшибка, СтруктураНастроекОбмена, Истина);
		//	КонецЦикла;
		//КонецЕсли;
		
		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Выполнено;
		
	КонецЕсли;
	//кодерлайн

	Если ИспользоватьПсевдоним
		И СтруктураНастроекОбмена.РезультатВыполненияОбмена <> Неопределено Тогда
		// Возможно, сообщение удастся получить если применить виртуальный код узла (псевдоним).
		
		Транслитерация = Неопределено;
		Если СтруктураНастроекОбмена.ВидТранспортаОбмена = Перечисления.ВидыТранспортаСообщенийОбмена.FILE Тогда
			СтруктураНастроекОбмена.НастройкиТранспорта.Свойство("FILEТранслитерироватьИменаФайловСообщенийОбмена", Транслитерация);
		ИначеЕсли СтруктураНастроекОбмена.ВидТранспортаОбмена = Перечисления.ВидыТранспортаСообщенийОбмена.EMAIL Тогда
			СтруктураНастроекОбмена.НастройкиТранспорта.Свойство("EMAILТранслитерироватьИменаФайловСообщенийОбмена", Транслитерация);
		ИначеЕсли СтруктураНастроекОбмена.ВидТранспортаОбмена = Перечисления.ВидыТранспортаСообщенийОбмена.FTP Тогда
			СтруктураНастроекОбмена.НастройкиТранспорта.Свойство("FTPТранслитерироватьИменаФайловСообщенийОбмена", Транслитерация);
		КонецЕсли;
		Транслитерация = ?(Транслитерация = Неопределено, Ложь, Транслитерация);
		
		ШаблонИмениФайлаСтарый = СтруктураНастроекОбмена.ОбработкаТранспортаСообщенийОбмена.ШаблонИмениФайлаСообщения;
		СтруктураНастроекОбмена.ОбработкаТранспортаСообщенийОбмена.ШаблонИмениФайлаСообщения = ШаблонИмениФайлаСообщения(
				СтруктураНастроекОбмена.ТекущийУзелПланаОбмена,
				СтруктураНастроекОбмена.УзелИнформационнойБазы,
				Ложь,
				Транслитерация, 
				Истина);
		Если ШаблонИмениФайлаСтарый <> СтруктураНастроекОбмена.ОбработкаТранспортаСообщенийОбмена.ШаблонИмениФайлаСообщения Тогда
			// Попытка повторного выполнения транспорта с новым шаблоном.
			СтруктураНастроекОбмена.РезультатВыполненияОбмена = Неопределено;
			ВыполнитьТранспортСообщенияОбменаПолучение(СтруктураНастроекОбмена, Ложь, СтекОшибок);
		Иначе
			// Больше попыток поиска файла не будет, поэтому регистрируем все накопленные ошибки.
			Для Каждого ТекущаяОшибка Из СтекОшибок Цикл
				ЗаписьЖурналаРегистрацииОбменаДанными(ТекущаяОшибка, СтруктураНастроекОбмена, Истина);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
