
//ВидДокумента = "";
//Склад = Неопределено;
//СкладОтправитель = Неопределено;
//СкладПолучатель = Неопределено;
//ТекстСообщения = "";
//ЛогикаСклад = Неопределено;
//ЛогикаПеремещения = Неопределено;
//Обработчик = Неопределено;
// РегистрыСведений.КСП_УПП_ОшибкиИмпорта.лог(ВидДокумента, Склад, СкладОтправитель, СкладПолучатель, 
//												ТекстСообщения, ЛогикаСклад, ЛогикаПеремещения, Обработчик);
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура лог(ВидДокумента, Склад, СкладОтправитель, СкладПолучатель, 
	ТекстСообщения = "", ЛогикаСклад = Неопределено, ЛогикаПеремещения = Неопределено, 
	Обработчик = Неопределено, ПредставлениеДокументаУПП = "") экспорт
	
	НЗ = РегистрыСведений.КСП_УПП_ОшибкиИмпорта.СоздатьНаборЗаписей();
	
	НЗ.Отбор.ВидДокумента.Установить(ВидДокумента);
	НЗ.Отбор.Склад.Установить(Склад);
	НЗ.Отбор.СкладОтправитель.Установить(СкладОтправитель);
	НЗ.Отбор.СкладПолучатель.Установить(СкладПолучатель);
	
	НовСтр = НЗ.Добавить();
	НовСтр.ВидДокумента = ВидДокумента;
	НовСтр.Склад = Склад;
	НовСтр.СкладОтправитель = СкладОтправитель;
	НовСтр.СкладПолучатель = СкладПолучатель;
	
	НовСтр.ТекстСообщения = ТекстСообщения;
	НовСтр.ЛогикаСклад = ЛогикаСклад; 
	НовСтр.ЛогикаПеремещения = ЛогикаПеремещения; 
	НовСтр.Обработчик = Обработчик;
	НовСтр.ПредставлениеДокументаУПП = ПредставлениеДокументаУПП;
	
	НовСтр.ВремяСобытия = ТекущаяДатаСеанса();
	
	НЗ.Записать();
		
КонецПроцедуры
