
&НаСервере
Процедура СписокВыборНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	допПарам = новый структура;
////todo найти склад УПП через запрос от ссылки
//	постОбработка = Новый ОписаниеОповещения("постОбработка",ЭтотОбъект,допПарам);
//	_вал = ПустойСклад();
//	ПоказатьВводЗначения(постОбработка,_вал);
//	СписокВыборНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура постОбработка(Рез, Доп) Экспорт
	Сообщить(Рез);
КонецПроцедуры



&НаСервереБезКонтекста
Функция ПустойСклад()
	Возврат Справочники.Склады.ПустаяСсылка();
КонецФункции




&НаСервере
Процедура СоздатьЛогикиПеремещенийНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЛогикиПеремещений(Команда)
	СоздатьЛогикиПеремещенийНаСервере(); 
	элементы.Список.ВыделенныеСтроки
КонецПроцедуры
