
&НаКлиенте
Перем мСтрокаРаспределенияДоИзменения;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаРаспределения) Тогда
		Объект.ДатаРаспределения = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкладОстатковПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.СкладОстатков) Тогда
		Объект.Распределение.ПолучитьЭлементы().Очистить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределение

&НаКлиенте
Процедура РаспределениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные.Уровень = 0
		И Поле = Элементы.РаспределениеНоменклатураХарактеристика Тогда
		ПоказатьЗначение(, ТекущиеДанные.НоменклатураХарактеристика);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПередНачаломИзменения(Элемент, Отказ)
	
	мСтрокаРаспределенияДоИзменения = Новый Структура(
		"КоличествоДоступно,
		|КоличествоДоступноОпт, КоличествоДоступноРозница, КоличествоДоступноECOM");
	ЗаполнитьЗначенияСвойств(мСтрокаРаспределенияДоИзменения, Элементы.Распределение.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеКоличествоДоступноОптПриИзменении(Элемент)
	КоличествоДоступноПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеКоличествоДоступноРозницаПриИзменении(Элемент)
	КоличествоДоступноПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеКоличествоДоступноECOMПриИзменении(Элемент)
	КоличествоДоступноПриИзменении(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	ЗаписатьРаспределение();
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьДанные(Команда)
	ЗаполнитьРаспределение();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЭтотОбъект()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции

&НаСервере
Процедура ЗаполнитьРаспределение()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = ЭтотОбъект();
	ОбработкаОбъект.ЗаполнитьРаспределение();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРаспределение()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = ЭтотОбъект();
	Если ОбработкаОбъект.ЗаписатьРаспределение() Тогда
		ЗаполнитьРаспределение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоДоступноПриИзменении(ПолеВводаКоличество)
	
	Поля = ИменаСвязанныхПолей(ПолеВводаКоличество);
	
	// Поле "%КоличествоДоступно%" у текущей строки и строки-родителя
	
	ТекущиеДанные = Элементы.Распределение.ТекущиеДанные;
	СтрокаРодитель = ТекущиеДанные.ПолучитьРодителя();
	
	НовоеКоличество = ТекущиеДанные[Поля.Доступно];
	ПредКоличество = мСтрокаРаспределенияДоИзменения[Поля.Доступно];
	
	Дельта = НовоеКоличество - ПредКоличество;
	
	ТекущиеДанные.КоличествоДоступно = ТекущиеДанные.КоличествоДоступно - Дельта;
	СтрокаРодитель[Поля.Доступно] = СтрокаРодитель[Поля.Доступно] + Дельта;
	
	мСтрокаРаспределенияДоИзменения[Поля.Доступно] = НовоеКоличество;
	
	// Поле "%ПроцентОбеспечения%" у текущей строки и строки-родителя
	
	Если ТекущиеДанные[Поля.План] = 0 Тогда
		ТекущиеДанные[Поля.Процент] = 0;
	Иначе
		ТекущиеДанные[Поля.Процент] =
			100 * (ТекущиеДанные[Поля.Распределено] + НовоеКоличество) / ТекущиеДанные[Поля.План];
	КонецЕсли;
	
	Если СтрокаРодитель[Поля.План] = 0 Тогда
		СтрокаРодитель[Поля.Процент] = 0;
	Иначе
		СтрокаРодитель[Поля.Процент] =
			100 * (СтрокаРодитель[Поля.Распределено] + НовоеКоличество) / СтрокаРодитель[Поля.План];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИменаСвязанныхПолей(ПолеВводаКоличество)
	
	ИмяТаблицыФормы = "Распределение";
	
	// Поле "%КоличествоДоступно%"
	ИмяПоляКоличество = СтрЗаменить(ПолеВводаКоличество.Имя, ИмяТаблицыФормы, "");
	
	ИмяТипаПодразделения			= СтрЗаменить(ИмяПоляКоличество, "КоличествоДоступно", "");  // "Опт", "Розница" и т.д.
	ИмяПоляКоличествоПлановое		= "КоличествоПлановое"		+ ИмяТипаПодразделения;
	ИмяПоляКоличествоРаспределено	= "КоличествоРаспределено"	+ ИмяТипаПодразделения;
	ИмяПоляПроцентОбеспечения		= "ПроцентОбеспечения"		+ ИмяТипаПодразделения;
	
	СвязанныеПоля = Новый Структура;
	СвязанныеПоля.Вставить("Доступно",		ИмяПоляКоличество);
	СвязанныеПоля.Вставить("План",			ИмяПоляКоличествоПлановое);
	СвязанныеПоля.Вставить("Распределено",	ИмяПоляКоличествоРаспределено);
	СвязанныеПоля.Вставить("Процент",		ИмяПоляПроцентОбеспечения);
	
	Возврат СвязанныеПоля;
	
КонецФункции

#КонецОбласти
