//{ golovinal 11.07.2024
&После("ПередЗаписью")
Процедура КСП_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтотОбъект.Контрагент.КСП_ОтгрузкаЗаказовКлиентаТребуетПодписания И НЕ ЭтотОбъект.КСП_СпецификацияПодписана Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КСП_ДоговорыБанковскаяГарантияСрезПоследних.Договор КАК Договор,
			|	КСП_ДоговорыБанковскаяГарантияСрезПоследних.ЕстьБанковскаяГарантия КАК ЕстьБанковскаяГарантия
			|ИЗ
			|	РегистрСведений.КСП_ДоговорыБанковскаяГарантия.СрезПоследних(&ДатаДокумента, ) КАК КСП_ДоговорыБанковскаяГарантияСрезПоследних
			|ГДЕ
			|	КСП_ДоговорыБанковскаяГарантияСрезПоследних.ЕстьБанковскаяГарантия
			|	И КСП_ДоговорыБанковскаяГарантияСрезПоследних.Договор.Контрагент = &Контрагент";
		
		Запрос.УстановитьПараметр("ДатаДокумента", ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("Контрагент", ЭтотОбъект.Контрагент);
		НетБанковскойГарантии = Запрос.Выполнить().Пустой();
		
		Если НетБанковскойГарантии Тогда
			Если ЭтотОбъект.Проведен Тогда
				Для каждого текСтрока Из ЭтотОбъект.Товары Цикл
					Если текСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
						текСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления;
					КонецЕсли;
				КонецЦикла;
			Иначе
				Если РежимПроведения = РежимЗаписиДокумента.Проведение Тогда
					Сообщить("Нет спецификации и банковской гарантии");
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
//} golovinal 11.07.2024
