
&НаКлиенте
&Вместо("РасшифровкаОбъектРасчетовПриИзменении")
Процедура КСП_РасшифровкаОбъектРасчетовПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	СтрокаТаблицы.СуммаВзаиморасчетов = 0;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ОбъектРасчетов) Тогда
		СтрокаТаблицы.ОснованиеПлатежа = Неопределено;
		СтрокаТаблицы.ДатаПогашения = Дата(1, 1, 1);
		
	КонецЕсли;
	
	РасшифровкаОбъектРасчетовПриИзмененииСервер(СтрокаТаблицы.ПолучитьИдентификатор());
	ОбновитьПредставлениеДатыПогашения();
	
КонецПроцедуры
