// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт   
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ПустаяСсылка()));
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЧЕКЛИСТ";
	КомандаПечати.Представление = "Чек лист";
	КомандаПечати.МенеджерПечати    = ОбъектМетаданных.ПолноеИмя();
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.Порядок = 10; 	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт    	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;                                                            	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЧекЛист") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЧекЛист", "Чек Лист", ПечатьЧекЛиста(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПечатьЧекЛиста(МассивСсылок, ОбъектыПечати = Неопределено) Экспорт 
	Ссылка = МассивСсылок.Получить(0);
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 10;
	ТабДок.ПолеСлева = 20;
	ТабДок.ПолеСнизу = 10;
	ТабДок.ПолеСправа = 10;
	ТабДок.ТолькоПросмотр = Истина;
	
	Макет = ПолучитьМакет("ЧекЛист");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокВизуальнаяПроверка = Макет.ПолучитьОбласть("ЗаголовокВизуальнаяПроверка");
	ОбластьСтрокаПунктПроверки = Макет.ПолучитьОбласть("СтрокаПунктПроверки");
	ОбластьКонтрольнаяПеремоткаШапка = Макет.ПолучитьОбласть("КонтрольнаяПеремоткаШапка");
	ОбластьКонтрольнаяПеремоткаПодвал = Макет.ПолучитьОбласть("КонтрольнаяПеремоткаПодвал");
	ОбластьИзображенияДефектов = Макет.ПолучитьОбласть("ИзображенияДефектов");
	
	ОбластьШапка.Параметры.Заполнить(Ссылка);
	ОбластьШапка.Параметры.ДатаПроверки = Ссылка.Дата;
	Для Каждого СтрокаТовары Из Ссылка.Товары Цикл
		Если СтрокаТовары.НомерСтроки <> 1 Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ОбластьШапка.Параметры.Заполнить(СтрокаТовары);   
		Попытка
		ОбластьШапка.Параметры.НомерДокументаПоступления = Ссылка.ДокументОснование.ДокументОснование.Распоряжение.ЗаказПоставщику.НомерПоДаннымПоставщика;
		ОбластьШапка.Параметры.ДатаДокументаПоступления = Формат(Ссылка.ДокументОснование.ДокументОснование.Распоряжение.ЗаказПоставщику.ДатаПоДаннымПоставщика, "ДФ=dd.MM.yyyy");
		Исключение КонецПопытки;
		ТабДок.Вывести(ОбластьШапка);
		ТабДок.Вывести(ОбластьЗаголовокВизуальнаяПроверка);
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОбластьСтрокаПунктПроверки);
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("КлючСтроки", СтрокаТовары.КлючСтроки);
		ПунктыПроверкиВизуальногоОсмотра = Ссылка.ПунктыПроверкиВизуальногоОсмотра.НайтиСтроки(СтруктураОтбора);
		Для Каждого СтрокаПунктыПроверкиВизуальногоОсмотра Из ПунктыПроверкиВизуальногоОсмотра Цикл			
			ОбластьСтрокаПунктПроверки.Параметры.Заполнить(СтрокаПунктыПроверкиВизуальногоОсмотра);
			Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок, МассивОбластейДляПроверки) Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДок.Вывести(ОбластьЗаголовокВизуальнаяПроверка);
			КонецЕсли;
			ТабДок.Вывести(ОбластьСтрокаПунктПроверки);
		КонецЦикла;
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОбластьКонтрольнаяПеремоткаШапка);
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок, МассивОбластейДляПроверки) Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабДок.Вывести(ОбластьКонтрольнаяПеремоткаШапка);
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОбластьСтрокаПунктПроверки);
		КонтрольнаяПеремотка = Ссылка.КонтрольнаяПеремотка.НайтиСтроки(СтруктураОтбора);
		Для Каждого СтрокаКонтрольнаяПеремотка Из КонтрольнаяПеремотка Цикл
			ОбластьСтрокаПунктПроверки.Параметры.Заполнить(СтрокаКонтрольнаяПеремотка);
			Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок, МассивОбластейДляПроверки) Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ТабДок.Вывести(ОбластьСтрокаПунктПроверки);
		КонецЦикла;
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОбластьКонтрольнаяПеремоткаПодвал);
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок, МассивОбластейДляПроверки) Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабДок.Вывести(ОбластьКонтрольнаяПеремоткаПодвал);
	КонецЦикла; 
	
	ОтборФотокПоПервомуЭтапу = Новый Структура;
	ОтборФотокПоПервомуЭтапу.Вставить("ЭтапПроверки", Перечисления.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.ВизуальныйКонтроль);
	ФотоПервогоЭтапа = Ссылка.ФотоДефектов.НайтиСтроки(ОтборФотокПоПервомуЭтапу);
	КоличествоФотоПервогоЭтапа = ФотоПервогоЭтапа.Количество();
	ОтборФотокПоВторомуЭтапу = Новый Структура;
	ОтборФотокПоВторомуЭтапу.Вставить("ЭтапПроверки", Перечисления.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.КонтрольнаяПеремотка);
	ФотоВторогоЭтапа = Ссылка.ФотоДефектов.НайтиСтроки(ОтборФотокПоВторомуЭтапу);
	КоличествоФотоВторогоЭтапа = ФотоВторогоЭтапа.Количество();
	Если КоличествоФотоПервогоЭтапа > КоличествоФотоВторогоЭтапа Тогда
		МаксимальноеКоличествоФотокПоЭтапу = КоличествоФотоПервогоЭтапа;
	Иначе
		МаксимальноеКоличествоФотокПоЭтапу = КоличествоФотоВторогоЭтапа;
	КонецЕсли;
	ПустаяКартинка = Новый Картинка;
	ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи = Константы.ксп_ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи.Получить();
	МассивОбластейДляПроверки = Новый Массив;
	МассивОбластейДляПроверки.Добавить(ОбластьИзображенияДефектов);
	Для ПозицияФото = 0 По МаксимальноеКоличествоФотокПоЭтапу-1 Цикл
		Если ПозицияФото <= КоличествоФотоПервогоЭтапа - 1 Тогда
			Файл = ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи + СтрЗаменить(ФотоПервогоЭтапа[ПозицияФото].ПутьКФайлу, ".\\", "\");
			ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта1.Картинка = Новый Картинка(Файл);
		Иначе
			ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта1.Картинка = ПустаяКартинка;
		КонецЕсли;
		Если ПозицияФото <= КоличествоФотоВторогоЭтапа - 1 Тогда
			Файл = ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи + СтрЗаменить(ФотоВторогоЭтапа[ПозицияФото].ПутьКФайлу, ".\\", "\");
			ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта2.Картинка = Новый Картинка(Файл);
		Иначе
			ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта2.Картинка = ПустаяКартинка;
		КонецЕсли;
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок, МассивОбластейДляПроверки) Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабДок.Вывести(ОбластьИзображенияДефектов);
	КонецЦикла;
		
	Возврат ТабДок;
КонецФункции
