Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	РегламентированнаяОтчетность.ДобавитьПрефиксОрганизации(ЭтотОбъект, Префикс);
КонецПроцедуры 

Функция ПолучитьПунктыПроверкиДляАвтозаполнения(ЭтапПроверки)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПунктыПроверкиКачестваПоЧекЛистам.Ссылка КАК ПунктПроверки
		|ИЗ
		|	Справочник.КСП_ПунктыПроверкиКачестваПоЧекЛистам КАК ПунктыПроверкиКачестваПоЧекЛистам
		|ГДЕ
		|	ПунктыПроверкиКачестваПоЧекЛистам.ПометкаУдаления = ЛОЖЬ
		|	И ПунктыПроверкиКачестваПоЧекЛистам.АвтоматическиВключатьВЧекЛисты = ИСТИНА
		|	И ПунктыПроверкиКачестваПоЧекЛистам.ЭтапПроверки = &ЭтапПроверки";
	
	Запрос.УстановитьПараметр("ЭтапПроверки", ЭтапПроверки);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьДанныеДляЗаполненияТовары(ПроверочнаяВедомость)
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|			ПроверочнаяВедомостьТовары.Номенклатура,
	|			ПроверочнаяВедомостьТовары.Характеристика,
	|			Выбор КОгда ПроверочнаяВедомостьТовары.ЕдиницаИзмерения = Значение(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) Тогда
	|			ПроверочнаяВедомостьТовары.Ссылка.ЕдиницаИзмерения
	|			Иначе ПроверочнаяВедомостьТовары.ЕдиницаИзмерения Конец Как ЕдиницаИзмерения,
	|			ПроверочнаяВедомостьТовары.Коэффициент,
	|			//ПриходныйОрдерНаТоварыТовары.ПоЛотам,
	|			СУММА(ПриходныйОрдерНаТоварыТовары.Количество) КАК Количество
	|		ИЗ
	|			Документ.КСП_ПроверочнаяВедомость.Товары КАК ПроверочнаяВедомостьТовары
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|				ПО ПроверочнаяВедомостьТовары.Ссылка = ПриходныйОрдерНаТоварыТовары.КСП_ПроверочнаяВедомость
	|					И ПроверочнаяВедомостьТовары.Номенклатура = ПриходныйОрдерНаТоварыТовары.Номенклатура
	|					И ПроверочнаяВедомостьТовары.Характеристика = ПриходныйОрдерНаТоварыТовары.Характеристика
	|		ГДЕ
	|			ПроверочнаяВедомостьТовары.Ссылка = &ПроверочнаяВедомость
	|		
	|		СГРУППИРОВАТЬ ПО
	|			//ПриходныйОрдерНаТоварыТовары.ПоЛотам,
	|			Выбор КОгда ПроверочнаяВедомостьТовары.ЕдиницаИзмерения = Значение(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) Тогда
	|			ПроверочнаяВедомостьТовары.Ссылка.ЕдиницаИзмерения
	|			Иначе ПроверочнаяВедомостьТовары.ЕдиницаИзмерения Конец,
	|			ПроверочнаяВедомостьТовары.Номенклатура,
	|			ПроверочнаяВедомостьТовары.Характеристика,
	|			ПроверочнаяВедомостьТовары.Коэффициент";
	
	Запрос.УстановитьПараметр("ПроверочнаяВедомость", ПроверочнаяВедомость);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КСП_ПроверочнаяВедомость") Тогда
		Если (ДанныеЗаполнения.СпецТипНакладной <> Перечисления.КСП_СпецТипНакладной.Пряжа) и (ДанныеЗаполнения.СпецТипНакладной <> Перечисления.КСП_СпецТипНакладной.ПряжаЛот) Тогда
			Сообщить("В документе основании документа " + ДанныеЗаполнения + " спец тип накладной должен быть ""Пряжа"" или ""Пряжа (лот)""");
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения;
		Комментарий = "Введен на основании документа " + ДанныеЗаполнения; 
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ДатаПоступления = ДанныеЗаполнения.ДокументОснование.Дата;
		ПунктыПроверкиДляАвтозаполнения = ПолучитьПунктыПроверкиДляАвтозаполнения(Перечисления.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.ВизуальныйКонтроль);
        Товары.Загрузить(ПолучитьДанныеДляЗаполненияТовары(ДанныеЗаполнения));
		ПунктыПроверкиВизуальногоОсмотра.Очистить();
		КонтрольнаяПеремотка.Очистить();
		ФотоДефектов.Очистить();
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			ТекСтрокаТовары.КлючСтроки = Новый УникальныйИдентификатор;
			Для Каждого ПунктПроверкиДляАвтозаполнения Из ПунктыПроверкиДляАвтозаполнения Цикл
				СтрокаПунктыПроверкиВизуальногоОсмотра = ПунктыПроверкиВизуальногоОсмотра.Добавить();
				СтрокаПунктыПроверкиВизуальногоОсмотра.КлючСтроки = ТекСтрокаТовары.КлючСтроки;
				СтрокаПунктыПроверкиВизуальногоОсмотра.ПунктПроверки = ПунктПроверкиДляАвтозаполнения.ПунктПроверки;
				СтрокаПунктыПроверкиВизуальногоОсмотра.КлючСтрокиДляСвязиСФото = Новый УникальныйИдентификатор;
			КонецЦикла;
		КонецЦикла;   
		ПунктыПроверкиДляАвтозаполнения = ПолучитьПунктыПроверкиДляАвтозаполнения(Перечисления.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.КонтрольнаяПеремотка);
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Для Каждого ПунктПроверкиДляАвтозаполнения Из ПунктыПроверкиДляАвтозаполнения Цикл
				СтрокаКонтрольнаяПеремотка = КонтрольнаяПеремотка.Добавить();
				СтрокаКонтрольнаяПеремотка.КлючСтроки = ТекСтрокаТовары.КлючСтроки;
				СтрокаКонтрольнаяПеремотка.ПунктПроверки = ПунктПроверкиДляАвтозаполнения.ПунктПроверки;
				СтрокаКонтрольнаяПеремотка.КлючСтрокиДляСвязиСФото = Новый УникальныйИдентификатор;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТаблицуПроведенияПоРегиструПроверкаКачестваПряжиПоЧекЛистам()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекЛистПроверкиКачестваПряжиТовары.Ссылка.Организация,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Ссылка.Контрагент,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Номенклатура,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Характеристика,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Ссылка.ДатаПоступления,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Количество * ЧекЛистПроверкиКачестваПряжиТовары.Коэффициент КАК Количество,
		|	ЧекЛистПроверкиКачестваПряжиТовары.КоличествоБобин,
		|	ЧекЛистПроверкиКачестваПряжиТовары.ВизуальныйОсмотрПроверкаЗавершена,
		|	ЧекЛистПроверкиКачестваПряжиТовары.ВизуальныйОсмотрДатаЗавершенияПроверки,
		|	ЧекЛистПроверкиКачестваПряжиТовары.КонтрольнаяПеремоткаПроверкаЗавершена,
		|	ЧекЛистПроверкиКачестваПряжиТовары.КонтрольнаяПеремоткаДатаЗавершенияПроверки,
		|	ЧекЛистПроверкиКачестваПряжиТовары.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.КСП_ЧекЛистПроверкиКачестваПряжи.Товары КАК ЧекЛистПроверкиКачестваПряжиТовары
		|ГДЕ
		|	ЧекЛистПроверкиКачестваПряжиТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборДвижений = Движения.КСП_ПроверкаКачестваПряжиПоЧекЛистам;  
	НаборДвижений.мТаблицаДвижений   = ПолучитьТаблицуПроведенияПоРегиструПроверкаКачестваПряжиПоЧекЛистам();
	НаборДвижений.ВыполнитьДвижения();
КонецПроцедуры
