Перем ИдВызова Экспорт;

Перем мИмяЛога;

Перем ADOConnection;

// Возвращает этот объект, если запись в приемник возможна. Иначе - возвращает Неопределено.
Функция Конструктор(ИдВызова_, Знач ИмяЛога = Неопределено) Экспорт
	Возврат Неопределено;
	ИдВызова = ИдВызова_;
	Если НЕ ЗначениеЗаполнено(СокрЛП(ИмяЛога)) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		//DBName - имя базы 1С. возможность отличать тестовые и прод базы
		мИмяЛога = СокрЛП(Константы.фдЛогSQLDBName.Получить()) + "." + ИмяЛога;
		
		//СтрокаСоединения = СокрЛП(Константы.фдЛогSQLConnectionString.Получить());
		//Если Прав(СтрокаСоединения,1) <> ";" Тогда
		//	СтрокаСоединения = СтрокаСоединения + ";";
		//КонецЕсли; 
		//Если СтрНайти(НРег(СтрокаСоединения), "user id") = 0 Тогда
		//	СтрокаСоединения = СтрокаСоединения + "User Id="+Константы.фдЛогSQLUserName.Получить()+";";
		//КонецЕсли; 
		//Если СтрНайти(НРег(СтрокаСоединения), "password") = 0 Тогда
		//	СтрокаСоединения = СтрокаСоединения + "Password="+Константы.фдЛогSQLPassword.Получить()+";";
		//КонецЕсли; 
		//ADOConnection = Новый COMОбъект("ADODB.Connection"); 
		//ADOConnection.Open(СтрокаСоединения);
		
		//ADOConnection = hh_ADO.СоздатьПодключениеАДО(Константы.фдЛогSQLConnectionString.Получить(),
		//	Константы.фдЛогSQLUserName.Получить(),
		//	Константы.фдЛогSQLPassword.Получить());
		Возврат ЭтотОбъект;
	Исключение
		Возврат Неопределено;
	КонецПопытки; 
	
КонецФункции

//Параметры:
//	КраткоеОписание  - Строка - Заголовок сообщения
//	ВидСообщения - ПеречислениеСсылка.СтатусыСообщений, СправочникСсылка.ТиповыеСообщения, Строка - Статус сообщения. Если строка, то это шаблон поиска в типовых сообщениях по шаблону
//	ДетальноеОписание - Строка - Подробное сообщение
//	Уровень - число - уровень логов. 1-дебаг,2-инфо,3-варн,4-ерр,5-крит,9-офф
//Возвращаемое значение:
//	Нет
Процедура ЗаписатьСообщение(Знач КраткоеОписание = "ИНФО", 
						ВидСообщения = Неопределено, 
						Знач ДетальноеОписание="",
						Знач Уровень = 2) Экспорт
	
		//Попытка
			ADOConnection.Execute(
			"INSERT INTO LogsApprovals2020 VALUES ('"
				+XMLСтрока(ТекущаяДатаСеанса())+"','"+Уровень+"','"+СокрЛП(мИмяЛога)+"','"+ДетальноеОписание+"')"
			);
	//	Исключение
	//		ЕстьЛогSQL = Ложь;
	//		ЗаписьЖурналаРегистрации(мИмяЛога,УровеньЖурналаРегистрации.Ошибка,,,"Не удалось выполнить запись лога в MSSQL! Лог выключен");
	//	КонецПопытки;
	//
	
	
КонецПроцедуры
 

