
// Обработчик регл задания "мис_Планировщик"
//
// Параметры:
//	Контекст - список значений - параметры задания, которые записываются программно
//								 при создании экземпляра задания.
//
Процедура мис_Планировщик(Контекст) Экспорт
	мис_класс_ЗапускЗаданий
		.ЗапуститьГруппуВФоне(Контекст);
КонецПроцедуры

// В модуле менеджера располагаются статические методы класса

#Область ПрограммныйИнтерфейс

// Создать/удалить экземпляр регл задания
Процедура ПередЗаписьюЭлементаСправочникаЗаданий(ЭлементСправочника,Расписание,ОбщиеПараметры=Неопределено) Экспорт
	
	Если ЭлементСправочника.ЗапускПоРасписанию = Истина Тогда
		СоздатьРегламентноеЗадание(ЭлементСправочника,Расписание,ОбщиеПараметры);
	Иначе
		УдалитьРегламентноеЗадание(ЭлементСправочника);
	КонецЕсли;
	
КонецПроцедуры

// Создать/удалить экземпляр регл задания
Процедура ПередЗаписьюГруппыСправочникаЗаданий(ЭлементСправочника,Расписание,ОбщиеПараметры=Неопределено) Экспорт
		
	Если ЭлементСправочника.ЗапускПоРасписанию = Истина Тогда
		СоздатьРегламентноеЗадание(ЭлементСправочника,Расписание,ОбщиеПараметры);
	Иначе
		УдалитьРегламентноеЗадание(ЭлементСправочника);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Создает объект регламентного задания УдалитьОбработкаОчередиЗаданийБТС с именем задания из справочника
// Это задание должно определять, какую процедуру ему запускать.
// Для этого, новому регламентному заданию присваивается уникальный ключ, который будет анализироваться
// и по которому будет производится поиск задания в справочнике заданий.
//
// Параметры
//	ЭлементСправочника - СправочникОбъект.мис_УправлениеЗаданиями - группа справочника
//	Расписание
//	ОбщиеПараметры
//	
Процедура СоздатьРегламентноеЗадание(ЭлементСправочника,Расписание,ОбщиеПараметры=Неопределено) Экспорт
	//ВызватьИсключение "Невозможно создать регламентное задание для запуска по расписанию! Причина: ограничения возможностей расширения конфигурации.";
	УстановитьПривилегированныйРежим(Истина);
	
	//// todo СУУ_ЕНС 30.12.2020 когда был написал комментарий? надо проверить, как сейчас обстоят дела 
	//// todo в файловой базе пока не работает:(
	//// ситуация аналогичная с запуском группы в фоне
	//// группа запускается, но не порождает фоновые задания для элементов.
	//// причем это и для группы и для элемента
	//Если ПараметрыСеанса.мис_ЭтоСервернаяБаза = Ложь Тогда
	//	ЗаписьЖурналаРегистрации("мис_РеглЗадания",УровеньЖурналаРегистрации.Предупреждение,
	//		,,"В файловой базе нельзя добавить регламентное задание!");
	//	Возврат;
	//	//ВызватьИсключение "В файловой базе нельзя добавить регламентное задание!";
	//КонецЕсли;

	Ключ = мис_УправлениеЗаданиямиСервер.СформироватьУникальныйКлючЗадания(ЭлементСправочника.Ссылка);
	
	Контекст = Новый Структура;
	Контекст.Вставить("Ключ",Ключ);
	Контекст.Вставить("Ссылка",ЭлементСправочника.Ссылка);
	Контекст.Вставить("ЭтоЦепочка",ЗначениеЗаполнено(ЭлементСправочника.СледующаяПроцедура));
	Контекст.Вставить("ОбщиеПараметры",ОбщиеПараметры);
	
	ПараметрыЗадания = Новый Массив();	
	ПараметрыЗадания.Добавить(Контекст);
	
	массивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Ключ",Ключ));
		
	Если массивЗаданий.Количество() >0 тогда
		Задание = массивЗаданий[0];	
	Иначе
		//Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание("мис_Планировщик");
		Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание("УдалитьОбработкаОчередиЗаданийБТС");
		
	КонецЕсли;
	
	Задание.ИнтервалПовтораПриАварийномЗавершении = 0;
	Задание.КоличествоПовторовПриАварийномЗавершении = 0;
	Задание.Наименование 	= "(MIS) " + ЭлементСправочника.Наименование + " (scheduled)";	
	Задание.Ключ 			= Ключ;
	Задание.Параметры  		= ПараметрыЗадания;
	Задание.Расписание 		= Расписание;
	Задание.Использование 	= ЭлементСправочника.Активность;
	
	//СУУ_ЕНС 30.12.2020 почему не указывается пользователь? 
	//Задание.ИмяПользователя = "ROBOT";
	
	Задание.Записать();     	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Удаляет объект регламентного задания УдалитьОбработкаОчередиЗаданийБТС с именем задания из справочника
// Это задание должно определять, какую процедуру ему запускать.
// Для этого, новому регламентному заданию присваивается уникальный ключ, который будет анализироваться
// и по которому будет производится поиск задания в справочнике заданий.
//
// Параметры
//	ЭлементСправочника - СправочникОбъект.мис_УправлениеЗаданиями - группа справочника
//	Расписание
//	ОбщиеПараметры
//	
Процедура УдалитьРегламентноеЗадание(ЭлементСправочника) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	массивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(
		Новый Структура("Ключ",
				мис_УправлениеЗаданиямиСервер.СформироватьУникальныйКлючЗадания(ЭлементСправочника.Ссылка))
	);
	
	Если массивЗаданий.Количество() > 0 тогда
		Задание = массивЗаданий[0];
		Задание.Удалить();	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
			
КонецПроцедуры


