
Процедура ДобавитьОтложенноеПроведение(ДанныеСсылка) Экспорт
	
	НЗ = РегистрыСведений.ксп_ОтложенноеПроведение.СоздатьНаборЗаписей();
	НЗ.Отбор.ДокументСсылка.Установить(ДанныеСсылка);
	
	стрк = НЗ.Добавить();
	стрк.ДокументСсылка = ДанныеСсылка;
	
	стрк.СтатусОбъекта = Перечисления.ксп_СтатусыКачестваДокументов.ОК;
	стрк.СтатусПроведения = Перечисления.КСП_СтатусыОтложенногоПроведения.НеПроведен;
	
	стрк.ДатаОбработки = ТекущаяДатаСеанса();
	
	НЗ.Записать();
		
КонецПроцедуры

Процедура УдалитьОтложенноеПроведение(ДанныеСсылка) Экспорт
     
    _типОбъекта = ТипЗнч(ДанныеСсылка);
    Если НЕ Документы.ТипВсеСсылки().СодержитТип(_типОбъекта) Тогда
        Возврат;
    КонецЕсли;
     
    НЗ = РегистрыСведений.КСП_ОтложенноеПроведение.СоздатьНаборЗаписей();
    НЗ.Отбор.ДокументСсылка.Установить(ДанныеСсылка);
    НЗ.Записать();
         
КонецПроцедуры

