
&НаКлиенте
Процедура ПутьКФайлуКаталогаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);

	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ПутьКФайлуКаталога = ДиалогОткрытияФайла.Каталог + "\icml.xml";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ВыгружатьКаталог = Истина Тогда 
		ЭтаФорма.Элементы.ПутьКФайлуКаталога.Видимость = Истина; 
		Если crm_RetailCRMПовтИсп.ПолучитьЗначениеКонстанты("ИерархияНоменклатуры") = "Виды номенклатуры" Тогда
			ЭтаФорма.Элементы.Каталог.Видимость = Ложь;
			ЭтаФорма.Элементы.КаталогПоВидам.Видимость = Истина;
		Иначе 
			ЭтаФорма.Элементы.Каталог.Видимость = Истина;
			ЭтаФорма.Элементы.КаталогПоВидам.Видимость = Ложь;
		КонецЕсли;
		
		//ЭтаФорма.Элементы.ГруппаКаталог.Видимость = Истина;
	Иначе 
		ЭтаФорма.Элементы.ПутьКФайлуКаталога.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаКаталог.Видимость = Ложь;
	КонецЕсли;
	
	ИспользоватьСоглашения = ПроверкаОпцииСоглашений();
	Если ИспользоватьСоглашения Тогда 
		ЭтаФорма.Элементы.ТиповоеСоглашение.Видимость = Истина;
	Иначе 
		ЭтаФорма.Элементы.ТиповоеСоглашение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьКаталогПриИзменении(Элемент)
	
	Если Объект.ВыгружатьКаталог = Истина Тогда 
		ЭтаФорма.Элементы.ПутьКФайлуКаталога.Видимость = Истина;
		ЭтаФорма.Элементы.ГруппаКаталог.Видимость = Истина;
		Если crm_RetailCRMПовтИсп.ПолучитьЗначениеКонстанты("ИерархияНоменклатуры") = "Виды номенклатуры" Тогда
			ЭтаФорма.Элементы.Каталог.Видимость = Ложь;
			ЭтаФорма.Элементы.КаталогПоВидам.Видимость = Истина;
		Иначе 
			ЭтаФорма.Элементы.Каталог.Видимость = Истина;
			ЭтаФорма.Элементы.КаталогПоВидам.Видимость = Ложь;
		КонецЕсли;
		//ЭтаФорма.Элементы.ГруппаКаталог.Видимость = Истина;
	Иначе 
		ЭтаФорма.Элементы.ПутьКФайлуКаталога.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаКаталог.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверкаОпцииСоглашений ()
	ИспользоватьСоглашения = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	Возврат ИспользоватьСоглашения;
КонецФункции
