Функция СоздатьИлиНайтиКаталог(ИмяКаталога) Экспорт	 
	 Файл = Новый Файл (ИмяКаталога); 
	 Если Файл.Существует() тогда
		 Возврат ИмяКаталога;
	 КонецЕсли;  	 
	 Попытка
		 СоздатьКаталог(ИмяКаталога);	
	 Исключение
		 Сообщить(ОписаниеОшибки());
		 Возврат неопределено;
	 КонецПопытки;
	 
	 Возврат  ИмяКаталога;   	 
 КонецФункции  
 // Формирует строку фильтра для диалога выбора файла с типами файлов.
//
// Параметры
//  Нет.
//
// Возвращаемое значение:
//   Строка – фильтр по типам файлов для диалога выбора файла.
//
Функция ПолучитьФильтрФайлов() Экспорт

	Возврат "Все файлы (*.*)|*.*|"
	      + "Документ Microsoft Word (*.doc)|*.doc|"
	      + "Документ Microsoft Excell (*.xls)|*.xls|"
	      + "Документ Microsoft PowerPoint (*.ppt)|*.ppt|"
	      + "Документ Microsoft Visio (*.vsd)|*.vsd|"
	      + "Письмо электронной почты (*.msg)|*.msg|"
	      + "Картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf|"
	      + "Текстовый документ (*.txt)|*.txt|"
	      + "Табличный документ (*.mxl)|*.mxl|";

КонецФункции // ПолучитьФильтрФайлов()
