Перем ИдВызова Экспорт;

// Возвращает этот объект
Функция Конструктор(ИдВызова_, Знач ИмяЛога = Неопределено) Экспорт
	ИдВызова = ИдВызова_;
	Возврат ЭтотОбъект;
КонецФункции

//Параметры:
//	КраткоеОписание  - Строка - Заголовок сообщения
//	ВидСообщения - ПеречислениеСсылка.СтатусыСообщений, СправочникСсылка.ТиповыеСообщения, Строка - Статус сообщения. Если строка, то это шаблон поиска в типовых сообщениях по шаблону
//	ДетальноеОписание - Строка - Подробное сообщение
//	Уровень - число - уровень логов. 1-дебаг,2-инфо,3-варн,4-ерр,5-крит,9-офф
//Возвращаемое значение:
//	Нет
Процедура ЗаписатьСообщение(Знач КраткоеОписание = "ИНФО", 
						ВидСообщения = Неопределено, 
						Знач ДетальноеОписание="",
						Знач Уровень = 2) Экспорт
	
	ЗаписьЖурналаРегистрации(КраткоеОписание, mis_LoggerServer.ВидСообщенияЖР(ВидСообщения), , , ДетальноеОписание,);
		
КонецПроцедуры

 

