
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ЭтоКомиссионер(ВнешняяСистема, Контрагент, Договор, ДатаДок) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КСП_КомиссионерыДляРеализацийУПП.ДатаНачала КАК ДатаНачала,
		|	КСП_КомиссионерыДляРеализацийУПП.ДатаОкончания КАК ДатаОкончания,
		|	КСП_КомиссионерыДляРеализацийУПП.Схема КАК Схема
		|ИЗ
		|	РегистрСведений.КСП_КомиссионерыДляРеализацийУПП КАК КСП_КомиссионерыДляРеализацийУПП
		|ГДЕ
		|	КСП_КомиссионерыДляРеализацийУПП.ВнешняяСистема = &ВнешняяСистема
		|	И КСП_КомиссионерыДляРеализацийУПП.Контрагент = &Контрагент";
		//|	И КСП_КомиссионерыДляРеализацийУПП.Удалить_Договор = &Договор"; //ЕНС. не используется с 2024-01-16
	
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Рез = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ДатаНачала) Тогда
			
			Если НЕ ЗначениеЗаполнено(Выборка.ДатаОкончания) Тогда
				Рез = Истина;
			Иначе 
				Рез = ( ДатаДок >= Выборка.ДатаНачала И ДатаДок <= Выборка.ДатаОкончания );
			КонецЕсли; 
			Прервать;
			
		Иначе      
				
			Если ЗначениеЗаполнено(Выборка.ДатаОкончания) Тогда
				Рез = ДатаДок <= Выборка.ДатаОкончания;
			Иначе 
				Рез = Ложь;
			КонецЕсли;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;  
	
	Возврат Рез И Выборка.Схема = Перечисления.ксп_СхемыЦепочекДокументовРеализацияУПП.ПеремещениеНаОтвХранение;
	
КонецФункции

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция СкладПолучатель(ВнешняяСистема, Контрагент, Договор, ДатаДок) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КСП_КомиссионерыДляРеализацийУПП.СкладПолучатель КАК СкладПолучатель
		|ИЗ
		|	РегистрСведений.КСП_КомиссионерыДляРеализацийУПП КАК КСП_КомиссионерыДляРеализацийУПП
		|ГДЕ
		|	КСП_КомиссионерыДляРеализацийУПП.ВнешняяСистема = &ВнешняяСистема
		|	И КСП_КомиссионерыДляРеализацийУПП.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СкладПолучатель;
	КонецЦикла;

	Возврат Неопределено;
	
КонецФункции

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция Договор(ВнешняяСистема, Контрагент, ДатаДок) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КСП_КомиссионерыДляРеализацийУПП.Договор КАК Договор
		|ИЗ
		|	РегистрСведений.КСП_КомиссионерыДляРеализацийУПП КАК КСП_КомиссионерыДляРеализацийУПП
		|ГДЕ
		|	КСП_КомиссионерыДляРеализацийУПП.ВнешняяСистема = &ВнешняяСистема
		|	И КСП_КомиссионерыДляРеализацийУПП.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Договор;
	КонецЦикла;

	Возврат Неопределено;
	
КонецФункции



