
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Для Каждого ПараметрДанных Из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		
		Если ПараметрДанных.Параметр = Новый ПараметрКомпоновкиДанных("Организация") И Не ЗначениеЗаполнено(ПараметрДанных.Значение) Тогда
			ПараметрДанных.Значение = ПланыВидовХарактеристик.ОбщиеНастройки.ПолучитьНастройку("Фулфилмент", "Организация");
			ПараметрДанных.Использование = Истина;
		КонецЕсли;	
		
		Если ПараметрДанных.Параметр = Новый ПараметрКомпоновкиДанных("Контрагент") И Не ЗначениеЗаполнено(ПараметрДанных.Значение) Тогда
			ПараметрДанных.Значение = ПланыВидовХарактеристик.ОбщиеНастройки.ПолучитьНастройку("Фулфилмент", "Контрагент");
			ПараметрДанных.Использование = Истина;
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры
