// < Кодерлайн 2024.07.16 УваровДС
// 


&После("ДобавитьКомандыПечати")
Процедура КСП_ДобавитьКомандыПечати(КомандыПечати)
	
	// Печатные формы для Белорусии
	// УпаковочныйЛист 
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Идентификатор = "УпаковочныйЛистБеларусь";                     
	КомандаПечати.Представление = НСтр("ru = 'Упаковочный лист (Беларусь, Армения) КСП'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	
	// Печатные формы для Казахстана
	// УпаковочныйЛист 
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Идентификатор = "УпаковочныйЛистКазахстан";                     
	КомандаПечати.Представление = НСтр("ru = 'Упаковочный лист (Казахстан) КСП'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Печатные формы для Грузии
	// УпаковочныйЛист 
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Идентификатор = "УпаковочныйЛистГрузия";                     
	КомандаПечати.Представление = НСтр("ru = 'Упаковочный лист (Грузия) КСП'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Декларация
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Идентификатор = "ДекларацияБеларусь";                     
	КомандаПечати.Представление = НСтр("ru = 'Выписка из прайс-листа продукции КСП'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	///////////////////////////////////////////////////////////////////
	
	// Печатные формы для Армении
	// Декларация
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Идентификатор = "ДекларацияАрмения";                     
	КомандаПечати.Представление = НСтр("ru = 'Декларация (Армения) КСП'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	///////////////////////////////////////////////////////////////////
	
	// Печатные формы для Грузии
	// Спецификация на товар
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Идентификатор = "СпецификацияНаТовар";                     
	КомандаПечати.Представление = НСтр("ru = 'Спецификация на товар (Грузия) КСП'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;	
	
	// Состав ткани
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Идентификатор = "СоставТкани";                     
	КомандаПечати.Представление = НСтр("ru = 'Состав ткани (Грузия) КСП'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Вес и состав
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Идентификатор = "ВесИСостав";                     
	КомандаПечати.Представление = НСтр("ru = 'Вес и состав (Грузия) КСП'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Спецификация
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Идентификатор = "Спецификация";                     
	//КомандаПечати.МестоРазмещения = "<ИмяПодменюНаФорме>";
	КомандаПечати.Представление = НСтр("ru = 'Спецификация КСП'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

Функция ПолучитьПредставлениеСсылкиБезВремени(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Представление КАК Представление
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Заголовок = "";
	
	Пока Выборка.Следующий() Цикл
		
		Заголовок = Выборка.Представление;	
		
	КонецЦикла;			
	
	Разбивка = СтрРазделить(Заголовок, " ");
	Разбивка.Удалить(Разбивка.Количество() - 1);
	
	Возврат СтрСоединить(Разбивка, " ");		
	
КонецФункции

&После("Печать")
Процедура КСП_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	ПредставлениеСсылкиБезВремени = ПолучитьПредставлениеСсылкиБезВремени(МассивОбъектов[0].Ссылка);
	
	// УпаковочныйЛистБеларусь
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УпаковочныйЛистБеларусь") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"УпаковочныйЛистБеларусь",
		НСтр("ru = 'Упаковочный лист (Беларусь, Армения)'"),
		ПечатьУпаковочныйЛистБеларусь(МассивОбъектов, ОбъектыПечати), ,
		"Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_УпаковочныйЛистБеларусьАрмения");
		
		ПараметрыВывода.ЗаголовокФормы = "Упаковочный лист (Беларусь, Армения) " + ПредставлениеСсылкиБезВремени;
		
	КонецЕсли;
	
	// УпаковочныйЛистКазахстан
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УпаковочныйЛистКазахстан") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"УпаковочныйЛистКазахстан",
		НСтр("ru = 'Упаковочный лист (Казахстан)'"),
		ПечатьУпаковочныйЛистКазахстан(МассивОбъектов, ОбъектыПечати), ,
		"Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_УпаковочныйЛистКазахстан");
		
		ПараметрыВывода.ЗаголовокФормы = "Упаковочный лист (Казахстан) " + ПредставлениеСсылкиБезВремени;
		
	КонецЕсли;
	
	// УпаковочныйЛистГрузия
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УпаковочныйЛистГрузия") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"УпаковочныйЛистГрузия",
		НСтр("ru = 'Упаковочный лист (Грузия)'"),
		ПечатьУпаковочныйЛистГрузия(МассивОбъектов, ОбъектыПечати), ,
		"Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_УпаковочныйЛистГрузия");
		
		ПараметрыВывода.ЗаголовокФормы = "Упаковочный лист (Грузия) " + ПредставлениеСсылкиБезВремени;
		
	КонецЕсли;
	
	// Декларация
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДекларацияБеларусь") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ДекларацияБеларусь",
		НСтр("ru = 'Выписка из прайс-листа продукции'"),
		ПечатьДекларацияБеларусь(МассивОбъектов, ОбъектыПечати), ,
		"Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_ДекларацияБеларусьАрмения");
		
		ПараметрыВывода.ЗаголовокФормы = "Выписка из прайс-листа продукции " + ПредставлениеСсылкиБезВремени;
		
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////
	
	// Печатные формы для Армении
	// Декларация
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДекларацияАрмения") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ДекларацияАрмения",
		НСтр("ru = 'Декларация (Армения)'"),
		ПечатьДекларацияАрмения(МассивОбъектов, ОбъектыПечати), ,
		"Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_ДекларацияАрмения");
		
		ПараметрыВывода.ЗаголовокФормы = "Декларация (Армения) " + ПредставлениеСсылкиБезВремени;
		
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////
	
	// Печатные формы для Грузии
	// Спецификация на товар
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СпецификацияНаТовар") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"СпецификацияНаТовар",
		НСтр("ru = 'Спецификация на товар'"),
		ПечатьСпецификацияНаТовар(МассивОбъектов, ОбъектыПечати), ,
		"Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_СпецификацияНаТовар");
		
		ПараметрыВывода.ЗаголовокФормы = "Спецификация на товар " + ПредставлениеСсылкиБезВремени;
		
	КонецЕсли;
	
	// Состав ткани
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СоставТкани") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"СоставТкани",
		НСтр("ru = 'Состав ткани'"),
		ПечатьСоставТкани(МассивОбъектов, ОбъектыПечати), ,
		"Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_СоставТкани");
		
		ПараметрыВывода.ЗаголовокФормы = "Состав ткани " + ПредставлениеСсылкиБезВремени;
		
	КонецЕсли;
	
	// Вес и состав
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВесИСостав") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ВесИСостав",
		НСтр("ru = 'Вес и состав'"),
		ПечатьВесИСостав(МассивОбъектов, ОбъектыПечати), ,
		"Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_ВесИСостав");
		
		ПараметрыВывода.ЗаголовокФормы = "Вес и состав " + ПредставлениеСсылкиБезВремени;
		
	КонецЕсли;
	
	// Спецификация
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Спецификация") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"Спецификация",
		НСтр("ru = 'Спецификация'"),
		ПечатьСпецификация(МассивОбъектов, ОбъектыПечати), ,
		"Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_Спецификация");
		
		ПараметрыВывода.ЗаголовокФормы = "Спецификация " + ПредставлениеСсылкиБезВремени;
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КомплектДокументов") Тогда
		КоллекцияПечатныхФорм.Очистить();
		СформироватьКомплектПечатныхФорм(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати);
		
		ПараметрыВывода.ЗаголовокФормы = "Печать комплекта";
	КонецЕсли;
	
	Если КоллекцияПечатныхФорм.Количество() > 1 Тогда
		ПараметрыВывода.ЗаголовокФормы = "Печать комплекта";
	КонецЕсли;
	
КонецПроцедуры


Функция ПечатьУпаковочныйЛистБеларусь(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_УпаковочныйЛист";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_УпаковочныйЛистБеларусьАрмения");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьЗаголовок.Параметры.Дата = Формат(МассивОбъектов[0].Дата, "ДФ='MMMM yyyy'");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|		РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|		РеализацияТоваровУслуг.Валюта КАК Валюта,
	|		РеализацияТоваровУслуг.Контрагент.Представление КАК КонтрагентПредставление
	|	ПОМЕСТИТЬ втРеализация
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|	ГДЕ
	|		РеализацияТоваровУслуг.Ссылка = &Ссылка
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		втРеализация.КонтрагентПредставление КАК КонтрагентПредставление,
	|		втРеализация.Валюта КАК Валюта,
	|		РеализацияТоваровУслугТовары.Номенклатура.Представление КАК НоменклатураПредставление,
	|		РеализацияТоваровУслугТовары.Количество КАК Количество,
	|		РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|		РеализацияТоваровУслугТовары.Номенклатура.КодТНВЭД КАК НоменклатураКодТНВЭД,
	|		РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура
	|	ПОМЕСТИТЬ втТовары
	|	ИЗ
	|		втРеализация КАК втРеализация,
	|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|	ГДЕ
	|		РеализацияТоваровУслугТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					втР.Ссылка
	|				ИЗ
	|					втРеализация КАК втР)
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		втТовары.КонтрагентПредставление КАК КонтрагентПредставление,
	|		втТовары.Валюта КАК Валюта,
	|		втТовары.НоменклатураПредставление КАК НоменклатураПредставление,
	|		втТовары.Количество КАК Количество,
	|		втТовары.Сумма КАК Сумма,
	|		втТовары.НоменклатураКодТНВЭД КАК НоменклатураКодТНВЭД,
	|		втТовары.Номенклатура КАК Номенклатура,
	|		УпаковкиЕдиницыИзмерения.Ссылка КАК Упаковка,
	|		ВЫБОР
	|			КОГДА втТовары.Номенклатура.ВесЗнаменатель <> 0
	|				ТОГДА втТовары.Количество * втТовары.Номенклатура.ВесЧислитель / втТовары.Номенклатура.ВесЗнаменатель
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК НоменклатураНетто,
	|		втТовары.Номенклатура.ВесЧислитель КАК Числ,
	|		втТовары.Номенклатура.ВесЗнаменатель КАК Знам,
	|		ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0) КАК УпаковкаВес,
	|		ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 0) КАК УпаковкаЧислитель,
	|		ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 0) КАК УпаковкаЗнаменатель,
	|		втТовары.Номенклатура.ЕдиницаДляОтчетов КАК УпаковкаОтчет,
	|		втТовары.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК ЧислительОтчет
	|	ПОМЕСТИТЬ втПромежТовары1
	|	ИЗ
	|		втТовары КАК втТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|			ПО (втТовары.Номенклатура = УпаковкиЕдиницыИзмерения.Владелец
	|					И УпаковкиЕдиницыИзмерения.Наименование ПОДОБНО ""%Коробка стреп лента и скотч%"")
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		втПромежТовары.КонтрагентПредставление КАК КонтрагентПредставление,
	|		втПромежТовары.Валюта КАК Валюта,
	|		втПромежТовары.НоменклатураКодТНВЭД КАК ТНВЭД,
	|		втПромежТовары.НоменклатураПредставление КАК Номенклатура,
	|		втПромежТовары.Количество КАК Количество,
	|		втПромежТовары.Сумма КАК Сумма,
	|		втПромежТовары.НоменклатураНетто КАК НоменклатураНетто,
	|		втПромежТовары.УпаковкаВес КАК УпаковкаВес,
	|		втПромежТовары.УпаковкаЧислитель КАК УпаковкаЧислитель,
	|		втПромежТовары.УпаковкаЗнаменатель КАК УпаковкаЗнаменатель
	|	ИЗ
	|		втПромежТовары1 КАК втПромежТовары
	|	ИТОГИ
	|		СУММА(Количество),
	|		СУММА(Сумма)
	|	ПО
	|		КонтрагентПредставление,
	|		ТНВЭД";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0].Ссылка);
	// < Кодерлайн 2024.07.30 УваровДС
	// сделал через подобно, так лучше посчитал, потому что не правильно берется
	//Запрос.УстановитьПараметр("ЕДИЗМ", Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("Коробка стреп лента и скотч"));
	// >  Кодерлайн 2024.07.30 УваровДС  
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКонтрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// сначала получить данные, потом обработать, потом вывести
	Если ВыборкаКонтрагент.Следующий() Тогда
		
		ОбщееКоличествоКоробок = 0;																
		КонтрагентГруппировкаКоличествоИтог = 0;
		КонтрагентГруппировкаСуммаИтог = 0;
		КонтрагентГруппировкаНетто = 0;
		КонтрагентГруппировкаБрутто = 0;
		
		ВыборкаТНВЭД = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		МассивТНВЭД = Новый Массив;
		
		Пока ВыборкаТНВЭД.Следующий() Цикл
			
			ТНВЭДСоответсвие = Новый Соответствие;
			
			МассивНоменклатура = Новый Массив;
			ВыборкаНоменклатура = ВыборкаТНВЭД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаНоменклатура.Следующий() Цикл
				
				НоменклатураСоответсвие = Новый Соответствие;
				
				СтруктураНоменклатура = Новый Структура;
				
				СтруктураНоменклатура.Вставить("Номенклатура", ВыборкаНоменклатура.Номенклатура);
				СтруктураНоменклатура.Вставить("Количество", ВыборкаНоменклатура.Количество);
				СтруктураНоменклатура.Вставить("Сумма", ВыборкаНоменклатура.Сумма);
				СтруктураНоменклатура.Вставить("НоменклатураНетто", ВыборкаНоменклатура.НоменклатураНетто);
				
				КонечноеЧислоУпаковок = 0;
				ВесБрутто = 0;	
				Если ВыборкаНоменклатура.УпаковкаЗнаменатель <> 0 И ВыборкаНоменклатура.УпаковкаЧислитель <> 0 Тогда
					КоличествоУпаковок = ВыборкаНоменклатура.Количество / (ВыборкаНоменклатура.УпаковкаЧислитель / ВыборкаНоменклатура.УпаковкаЗнаменатель); 
					ЦелаяЧасть = Цел(КоличествоУпаковок);
					ДробнаяЧасть = КоличествоУпаковок - ЦелаяЧасть;
					КонечноеЧислоУпаковок = ?(ДробнаяЧасть = 0, ЦелаяЧасть, ЦелаяЧасть + 1);
					ВесБрутто = ВыборкаНоменклатура.УпаковкаВес * КонечноеЧислоУпаковок;
				КонецЕсли;
				
				СтруктураНоменклатура.Вставить("НоменклатураКоличествоУпаковок", КонечноеЧислоУпаковок);
				СтруктураНоменклатура.Вставить("НоменклатураБрутто", ВесБрутто); 
				
				ОбщееКоличествоКоробок = ОбщееКоличествоКоробок + КонечноеЧислоУпаковок; 
				КонтрагентГруппировкаКоличествоИтог = КонтрагентГруппировкаКоличествоИтог + ВыборкаНоменклатура.Количество;
				КонтрагентГруппировкаСуммаИтог = КонтрагентГруппировкаСуммаИтог + ВыборкаНоменклатура.Сумма;
				КонтрагентГруппировкаНетто = КонтрагентГруппировкаНетто + ВыборкаНоменклатура.НоменклатураНетто;
				КонтрагентГруппировкаБрутто = КонтрагентГруппировкаБрутто + ВесБрутто;
				
				НоменклатураСоответсвие.Вставить(ВыборкаНоменклатура.Номенклатура, СтруктураНоменклатура);
				
				МассивНоменклатура.Добавить(НоменклатураСоответсвие);
				
			КонецЦикла;
			
			ТНВЭДСоответсвие.Вставить(?(ЗначениеЗаполнено(ВыборкаТНВЭД.ТНВЭД), ВыборкаТНВЭД.ТНВЭД, " "), МассивНоменклатура);
			
			МассивТНВЭД.Добавить(ТНВЭДСоответсвие);
			
		КонецЦикла;
		
		ОбластьОбщее = Макет.ПолучитьОбласть("ОбластьОбщее");
		ОбластьОбщее.Параметры.ОбщееКоличествоКоробок = ОбщееКоличествоКоробок;
		ОбластьОбщее.Параметры.ОбщийВесБрутто = КонтрагентГруппировкаБрутто;
		ОбластьОбщее.Параметры.ОбщийВесНетто = КонтрагентГруппировкаНетто;
		ОбластьОбщее.Параметры.РазницаБруттоНетто = КонтрагентГруппировкаБрутто - КонтрагентГруппировкаНетто;
		ТабличныйДокумент.Вывести(ОбластьОбщее);
		
		ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОбластьСтрокаКонтрагент = Макет.ПолучитьОбласть("ОбластьСтрокаКонтрагент");
		ОбластьСтрокаКонтрагент.Параметры.КонтрагентГруппировка = ВыборкаКонтрагент.КонтрагентПредставление;
		ОбластьСтрокаКонтрагент.Параметры.КонтрагентГруппировкаКоличествоИтог = КонтрагентГруппировкаКоличествоИтог;
		ОбластьСтрокаКонтрагент.Параметры.КонтрагентГруппировкаСуммаИтог = КонтрагентГруппировкаСуммаИтог;
		ОбластьСтрокаКонтрагент.Параметры.КонтрагентГруппировкаНетто = КонтрагентГруппировкаНетто;
		ОбластьСтрокаКонтрагент.Параметры.КонтрагентГруппировкаБрутто = КонтрагентГруппировкаБрутто;
		
		ТабличныйДокумент.Вывести(ОбластьСтрокаКонтрагент);
		
		// МассивТНВЭД[0][0].Значение[0][0].Значение.Сумма
		// МассивТНВЭД: {соотвествие ТНВЭД и массив номенклатура (соответствие номенклатура и СТРУКТУРА)}
		
		Для Инд = 0 По МассивТНВЭД.Количество() - 1 Цикл
			
			ОбластьСтрокаТНВЭД = Макет.ПолучитьОбласть("ОбластьСтрокаТНВЭД");
			СоотвТНВЭД = МассивТНВЭД[Инд];
			ОбластьСтрокаТНВЭД.Параметры.Заполнить(ПолучитьСтруктуруИтоговДляСтрокиТНВЭД(СоотвТНВЭД));
			ТабличныйДокумент.Вывести(ОбластьСтрокаТНВЭД);                                          
			
			Для Каждого Элемент Из СоотвТНВЭД Цикл
				
				МассивСоответствийНоменклатура = Элемент.Значение;
				
				Для Инд2 = 0 По МассивСоответствийНоменклатура.Количество() - 1 Цикл
					
					СоотвНоменклатура = МассивСоответствийНоменклатура[Инд2];
					
					Для Каждого ЭлНоменклатуры Из СоотвНоменклатура Цикл
						
						СтрНом = ЭлНоменклатуры.Значение;
						
						ОбластьСтрокаНоменклатура = Макет.ПолучитьОбласть("ОбластьСтрокаНоменклатура");		
						ОбластьСтрокаНоменклатура.Параметры.НоменклатураНаименование = СтрНом.Номенклатура; 
						ОбластьСтрокаНоменклатура.Параметры.НоменклатураКоличество = СтрНом.Количество;
						ОбластьСтрокаНоменклатура.Параметры.НоменклатураСумма = СтрНом.Сумма;
						ОбластьСтрокаНоменклатура.Параметры.НоменклатураНетто = СтрНом.НоменклатураНетто;
						ОбластьСтрокаНоменклатура.Параметры.НоменклатураБрутто = СтрНом.НоменклатураБрутто;
						ТабличныйДокумент.Вывести(ОбластьСтрокаНоменклатура);
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьСтруктуруИтоговДляСтрокиТНВЭД(ТНВЭДСоответствие)
	СтруктураИтогов	= Новый Структура;
	
	Для Каждого Элемент Из ТНВЭДСоответствие Цикл
		
		Если ТипЗнч(Элемент.Ключ) = Тип("Строка") Тогда
			СтруктураИтогов.Вставить("ТНВЭДГруппировка", Элемент.Ключ);
		ИначеЕсли ТипЗнч(Элемент.Ключ) = Тип("СправочникСсылка.КлассификаторТНВЭД") Тогда
			СтруктураИтогов.Вставить("ТНВЭДГруппировка", Элемент.Ключ.Код);
		КонецЕсли;
		
		ТНВЭДГруппировкаКоличествоИтог = 0;
		ТНВЭДГруппировкаСуммаИтог = 0;       // ТНВЭДСоответствие[0].Значение[0][0].Значение.Сумма
		ТНВЭДГруппировкаНеттоИтог = 0;
		ТНВЭДГруппировкаБруттоИтог = 0;
		
		МассивСоответствийНоменклатура = Элемент.Значение;
		
		Для Инд = 0 По МассивСоответствийНоменклатура.Количество() - 1 Цикл
			
			СоотвНоменклатура = МассивСоответствийНоменклатура[Инд];
			
			Для Каждого ЭлНоменклатуры Из СоотвНоменклатура Цикл
				
				СтрНом = ЭлНоменклатуры.Значение;
				
				ТНВЭДГруппировкаКоличествоИтог = ТНВЭДГруппировкаКоличествоИтог + СтрНом.Количество;
				ТНВЭДГруппировкаСуммаИтог = ТНВЭДГруппировкаСуммаИтог + СтрНом.Сумма;
				ТНВЭДГруппировкаНеттоИтог = ТНВЭДГруппировкаНеттоИтог + СтрНом.НоменклатураНетто;
				ТНВЭДГруппировкаБруттоИтог = ТНВЭДГруппировкаБруттоИтог + СтрНом.НоменклатураБрутто;
				
			КонецЦикла;
			
		КонецЦикла;
		
		СтруктураИтогов.Вставить("ТНВЭДГруппировкаКоличествоИтог", ТНВЭДГруппировкаКоличествоИтог);
		СтруктураИтогов.Вставить("ТНВЭДГруппировкаСуммаИтог", ТНВЭДГруппировкаСуммаИтог);
		СтруктураИтогов.Вставить("ТНВЭДГруппировкаНеттоИтог", ТНВЭДГруппировкаНеттоИтог);
		СтруктураИтогов.Вставить("ТНВЭДГруппировкаБруттоИтог", ТНВЭДГруппировкаБруттоИтог);
		
	КонецЦикла;
	
	Возврат СтруктураИтогов;
	
КонецФункции

Функция ПечатьУпаковочныйЛистКазахстан(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_УпаковочныйЛист";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_УпаковочныйЛистКазахстан");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура.КодТНВЭД.Представление КАК ТНВЭД,
	|	РеализацияТоваровУслугТовары.Номенклатура.Представление КАК Номенклатура,
	|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
	|	СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Номенклатура.КодТНВЭД.Представление,
	|	РеализацияТоваровУслугТовары.Номенклатура.Представление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.ТНВЭД КАК ТНВЭД,
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Количество КАК Количество,
	|	втТовары.Сумма КАК Сумма
	|ИЗ
	|	втТовары КАК втТовары
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма)
	|ПО
	|	ТНВЭД";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0].Ссылка); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТНВЭД = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТНВЭД.Следующий() Цикл
		
		СтрокаТНВЭД = Макет.ПолучитьОбласть("СтрокаТНВЭД");
		
		СтрокаТНВЭД.Параметры.ТНВЭД = ВыборкаТНВЭД.ТНВЭД;
		СтрокаТНВЭД.Параметры.КоличествоИтого = ВыборкаТНВЭД.Количество;
		СтрокаТНВЭД.Параметры.СуммаИтого = ВыборкаТНВЭД.Сумма;
		
		ТабличныйДокумент.Вывести(СтрокаТНВЭД);
		
		Выборка = ВыборкаТНВЭД.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаНоменклатура = Макет.ПолучитьОбласть("СтрокаНоменклатура");	
			СтрокаНоменклатура.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(СтрокаНоменклатура);
			
		КонецЦикла;
		
	КонецЦикла;
	
	РасчетШириныКолонок(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьУпаковочныйЛистГрузия(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_УпаковочныйЛист";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_УпаковочныйЛистГрузия");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Организация = МассивОбъектов[0].Организация.НаименованиеСокращенное;
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура.Представление КАК Наименование,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|	РеализацияТоваровУслугТовары.Номенклатура.КодТНВЭД КАК НоменклатураКодТНВЭД,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Наименование КАК Наименование,
	|	втТовары.Количество КАК Количество,
	|	втТовары.Сумма КАК Сумма,
	|	втТовары.НоменклатураКодТНВЭД КАК ТНВЭД,
	|	втТовары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА втТовары.Номенклатура.ВесЗнаменатель <> 0
	|			ТОГДА втТовары.Количество * втТовары.Номенклатура.ВесЧислитель / втТовары.Номенклатура.ВесЗнаменатель
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НоменклатураНетто,
	|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Вес, 0) КАК УпаковкаВес,
	|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 0) КАК УпаковкаЧислитель,
	|	ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 0) КАК УпаковкаЗнаменатель
	|ПОМЕСТИТЬ втПромежТовары
	|ИЗ
	|	втТовары КАК втТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|		ПО втТовары.Номенклатура = УпаковкиЕдиницыИзмерения.Владелец
	|			И (УпаковкиЕдиницыИзмерения.Наименование ПОДОБНО ""%Коробка стреп лента и скотч%"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПромежТовары.ТНВЭД КАК ТНВЭД,
	|	втПромежТовары.Наименование КАК Наименование,
	|	втПромежТовары.Количество КАК Количество,
	|	втПромежТовары.Сумма КАК Сумма,
	|	втПромежТовары.НоменклатураНетто КАК Нетто,
	|	втПромежТовары.УпаковкаВес КАК УпаковкаВес,
	|	втПромежТовары.УпаковкаЧислитель КАК УпаковкаЧислитель,
	|	втПромежТовары.УпаковкаЗнаменатель КАК УпаковкаЗнаменатель
	|ИЗ
	|	втПромежТовары КАК втПромежТовары
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(Нетто)
	|ПО
	|	ТНВЭД";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0].Ссылка); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТНВЭД = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Номер = 1;
	
	Пока ВыборкаТНВЭД.Следующий() Цикл
		
		Выборка = ВыборкаТНВЭД.Выбрать();
		
		ВесБруттоИтого = 0;
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаНоменклатура = Макет.ПолучитьОбласть("Стр");	
			СтрокаНоменклатура.Параметры.Заполнить(Выборка);
			СтрокаНоменклатура.Параметры.Номер = Номер;
			Номер = Номер + 1;                          
			КонечноеЧислоУпаковок = 0;
			ВесБрутто = 0;	
			Если Выборка.УпаковкаЗнаменатель <> 0 И Выборка.УпаковкаЧислитель <> 0 Тогда
				КоличествоУпаковок = Выборка.Количество / (Выборка.УпаковкаЧислитель / Выборка.УпаковкаЗнаменатель); 
				ЦелаяЧасть = Цел(КоличествоУпаковок);
				ДробнаяЧасть = КоличествоУпаковок - ЦелаяЧасть;
				КонечноеЧислоУпаковок = ?(ДробнаяЧасть = 0, ЦелаяЧасть, ЦелаяЧасть + 1);
				ВесБрутто = Выборка.УпаковкаВес * КонечноеЧислоУпаковок;
			КонецЕсли;
			СтрокаНоменклатура.Параметры.Брутто = ВесБрутто;
			ВесБруттоИтого = ВесБруттоИтого + ВесБрутто;
			
			ТабличныйДокумент.Вывести(СтрокаНоменклатура);
			
		КонецЦикла;                                     
		
		СтрокаТНВЭД = Макет.ПолучитьОбласть("СтрИтого");
		СтрокаТНВЭД.Параметры.СуммаИтого = ВыборкаТНВЭД.Сумма;
		СтрокаТНВЭД.Параметры.КоличествоИтого = ВыборкаТНВЭД.Количество;
		СтрокаТНВЭД.Параметры.НеттоИтого = ВыборкаТНВЭД.Нетто;
		СтрокаТНВЭД.Параметры.БруттоИтого = ВесБруттоИтого;
		
		ТабличныйДокумент.Вывести(СтрокаТНВЭД);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции


Функция ПечатьДекларацияБеларусь(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ДекларацияБеларусь";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_ДекларацияБеларусьАрмения");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.НаименованиеПолное КАК НаименованиеПолное,
	|	Организации.КПП КАК КПП,
	|	Организации.ИНН КАК ИНН,
	|	Организации.ОГРН КАК ОГРН,
	|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	БанковскиеСчетаОрганизаций.НомерСчета КАК НомерСчета,
	|	БанковскиеСчетаОрганизаций.КоррСчетБанка КАК КоррСчетБанка,
	|	БанковскиеСчетаОрганизаций.Банк КАК Банк,
	|	БанковскиеСчетаОрганизаций.БИКБанка КАК БИКБанка,
	|	БанковскиеСчетаОрганизаций.Ссылка КАК СчетСсылка
	|ПОМЕСТИТЬ втОргИБанкЭлис
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ПО (Организации.Ссылка = БанковскиеСчетаОрганизаций.Владелец)
	|ГДЕ
	|	Организации.ИНН = &ИННЭлис
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.Тип КАК Тип,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
	|	ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втКонт
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОргИБанкЭлис.Ссылка КАК Ссылка,
	|	втОргИБанкЭлис.НаименованиеПолное КАК ПолноеЮрНаименование,
	|	втОргИБанкЭлис.КПП КАК КПП,
	|	втОргИБанкЭлис.ИНН КАК ИНН,
	|	втОргИБанкЭлис.ОГРН КАК ОГРН,
	|	втОргИБанкЭлис.НаименованиеСокращенное КАК СокрЮрНаименование,
	|	втОргИБанкЭлис.СчетСсылка КАК СчетСсылка,
	|	втОргИБанкЭлис.СчетСсылка.Представление КАК СчетПредставление,
	|	втОргИБанкЭлис.НомерСчета КАК РасчСчет,
	|	втОргИБанкЭлис.КоррСчетБанка КАК КоррСчет,
	|	втОргИБанкЭлис.Банк.Наименование КАК НаименованиеБанка,
	|	втОргИБанкЭлис.БИКБанка КАК БИК,
	|	Адрес.Представление КАК Адрес,
	|	ВебСтраница.Представление КАК ВебСтраница,
	|	Телефон.Представление КАК Телефон,
	|	Другое.Представление КАК Другое,
	|	Факс.Представление КАК Факс,
	|	ЭлПочта.Представление КАК ЭлПочта
	|ПОМЕСТИТЬ втШапка
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Телефон
	|		ПО втОргИБанкЭлис.Ссылка = Телефон.Ссылка
	|			И (Телефон.Тип = &Телефон)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Адрес
	|		ПО втОргИБанкЭлис.Ссылка = Адрес.Ссылка
	|			И (Адрес.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Факс
	|		ПО втОргИБанкЭлис.Ссылка = Факс.Ссылка
	|			И (Факс.Тип = &Факс)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ВебСтраница
	|		ПО втОргИБанкЭлис.Ссылка = ВебСтраница.Ссылка
	|			И (ВебСтраница.Тип = &ВебСтраница)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Другое
	|		ПО втОргИБанкЭлис.Ссылка = Другое.Ссылка
	|			И (Другое.Тип = &Другое)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ЭлПочта
	|		ПО втОргИБанкЭлис.Ссылка = ЭлПочта.Ссылка
	|			И (ЭлПочта.Тип = &ЭлПочта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииПрисоединенныеФайлы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втЛоготипОрганизации
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОрганизацииПрисоединенныеФайлы КАК ОрганизацииПрисоединенныеФайлы
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииПрисоединенныеФайлы.ВладелецФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Дата КАК Дата
	|ПОМЕСТИТЬ втРеализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &РеализацияСсылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.Ссылка
	|			ИЗ
	|				втРеализация КАК Т)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерСтр,
	|	ЦеныНоменклатуры25СрезПоследних.Номенклатура.Представление КАК Наименование,
	|	ЦеныНоменклатуры25СрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатуры25СрезПоследних.Валюта.Представление КАК Валюта
	|ПОМЕСТИТЬ втЦены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
	|			&Дата,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						втТовары.Номенклатура
	|					ИЗ
	|						втТовары КАК втТовары)
	|				И ВидЦены = &ВидЦены) КАК ЦеныНоменклатуры25СрезПоследних";
	
	Запрос.УстановитьПараметр("РеализацияСсылка", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("ИННЭлис", "6152001000");
	Запрос.УстановитьПараметр("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Факс", Перечисления.ТипыКонтактнойИнформации.Факс);
	Запрос.УстановитьПараметр("ВебСтраница", Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	Запрос.УстановитьПараметр("ЭлПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Цена розницы Основная"));
	Запрос.УстановитьПараметр("Дата", КонецМесяца(МассивОбъектов[0].Дата));
	Запрос.УстановитьПараметр("Другое", Перечисления.ТипыКонтактнойИнформации.Другое);
	
	РезультатыЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();	
	
	ФайлХранилищеЛого = Неопределено; 
	
	Шапка = РезультатыЗапросов[2].Выбрать();
	Если РезультатыЗапросов[3].Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Логотип организации не установлен!";
		Сообщение.Сообщить();                                 
	Иначе
		ЛоготипВыборка = РезультатыЗапросов[3].Выбрать();
		Если ЛоготипВыборка.Следующий() Тогда
			ФайлХранилищеЛого = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(ЛоготипВыборка.Ссылка), Ложь);	
		КонецЕсли;	
	КонецЕсли;
	
	Пока Шапка.Следующий() Цикл
		
		//Начало вывода документа
		// склонение банка
		ФорматнаяСтрока = "ПД=Предложный";
		РезультатСколнения = ПолучитьСклоненияСтроки(Шапка.НаименованиеБанка, ,ФорматнаяСтрока);
		
		ОбластьШапка.Параметры.Заполнить(Шапка);
		ОбластьШапка.Параметры.Логотип = ФайлХранилищеЛого;
		
		Если Не ЗначениеЗаполнено(ОбластьШапка.Параметры.ВебСтраница) Тогда
			ОбластьШапка.Параметры.ВебСтраница = Шапка.Другое;
		КонецЕсли;
		
		ОбластьШапка.Параметры.НаименованиеБанка = РезультатСколнения[0];
		ОбластьШапка2.Параметры.Заполнить(Шапка);
		ОбластьШапка2.Параметры.Дата = Формат(КонецДня(МассивОбъектов[0].Дата), "ДФ=dd.MM.yyyy");
		
		//Конец вывода документа
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьШапка2);
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ЦеныВыборка = РезультатыЗапросов[6].Выбрать();
	
	Пока ЦеныВыборка.Следующий() Цикл
		
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьСтрокаТаблицы.Параметры.Заполнить(ЦеныВыборка);
		
		ОбластьСтрокаТаблицы.Параметры.Цена = Формат(ЦеныВыборка.Цена, "ЧДЦ=2; ЧГ=0");
		
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатьДекларацияАрмения(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ДекларацияАрмения";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_ДекларацияАрмения");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьРеквизиты = Макет.ПолучитьОбласть("Реквизиты");
	
	ОбластьНаименование = Макет.ПолучитьОбласть("Наименование");
	
	ОбластьСтрана = Макет.ПолучитьОбласть("ОбластьСтрана");
	ОбластьДолжностьДата = Макет.ПолучитьОбласть("ОбластьДолжностьДата");
	
	// Получаем запросом необходимые данные.
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.НаименованиеПолное КАК НаименованиеПолное,
	|	Организации.КПП КАК КПП,
	|	Организации.ИНН КАК ИНН,
	|	Организации.ОГРН КАК ОГРН,
	|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	БанковскиеСчетаОрганизаций.НомерСчета КАК НомерСчета,
	|	БанковскиеСчетаОрганизаций.КоррСчетБанка КАК КоррСчетБанка,
	|	БанковскиеСчетаОрганизаций.Банк КАК Банк,
	|	БанковскиеСчетаОрганизаций.БИКБанка КАК БИКБанка,
	|	БанковскиеСчетаОрганизаций.Ссылка КАК СчетСсылка
	|ПОМЕСТИТЬ втОргИБанкЭлис
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ПО (Организации.Ссылка = БанковскиеСчетаОрганизаций.Владелец)
	|ГДЕ
	|	Организации.ИНН = &ИННЭлис
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.Тип КАК Тип,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
	|	ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втКонт
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОргИБанкЭлис.Ссылка КАК Ссылка,
	|	втОргИБанкЭлис.НаименованиеПолное КАК ПолноеЮрНаименование,
	|	втОргИБанкЭлис.КПП КАК КПП,
	|	втОргИБанкЭлис.ИНН КАК ИНН,
	|	втОргИБанкЭлис.ОГРН КАК ОГРН,
	|	втОргИБанкЭлис.НаименованиеСокращенное КАК СокрЮрНаименование,
	|	втОргИБанкЭлис.СчетСсылка КАК СчетСсылка,
	|	втОргИБанкЭлис.СчетСсылка.Представление КАК СчетПредставление,
	|	втОргИБанкЭлис.НомерСчета КАК РасчСчет,
	|	втОргИБанкЭлис.КоррСчетБанка КАК КоррСчет,
	|	втОргИБанкЭлис.Банк.Наименование КАК НаименованиеБанка,
	|	втОргИБанкЭлис.БИКБанка КАК БИК,
	|	Адрес.Представление КАК Адрес,
	|	ВебСтраница.Представление КАК ВебСтраница,
	|	Телефон.Представление КАК Телефон,
	|	Другое.Представление КАК Другое,	
	|	Факс.Представление КАК Факс,
	|	ЭлПочта.Представление КАК ЭлПочта
	|ПОМЕСТИТЬ втШапка
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Телефон
	|		ПО втОргИБанкЭлис.Ссылка = Телефон.Ссылка
	|			И (Телефон.Тип = &Телефон)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Адрес
	|		ПО втОргИБанкЭлис.Ссылка = Адрес.Ссылка
	|			И (Адрес.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Факс
	|		ПО втОргИБанкЭлис.Ссылка = Факс.Ссылка
	|			И (Факс.Тип = &Факс)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ВебСтраница
	|		ПО втОргИБанкЭлис.Ссылка = ВебСтраница.Ссылка
	|			И (ВебСтраница.Тип = &ВебСтраница)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Другое
	|		ПО втОргИБанкЭлис.Ссылка = Другое.Ссылка
	|			И (Другое.Тип = &Другое)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ЭлПочта
	|		ПО втОргИБанкЭлис.Ссылка = ЭлПочта.Ссылка
	|			И (ЭлПочта.Тип = &ЭлПочта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииПрисоединенныеФайлы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втЛоготипОрганизации
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОрганизацииПрисоединенныеФайлы КАК ОрганизацииПрисоединенныеФайлы
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииПрисоединенныеФайлы.ВладелецФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.КСП_ТаможенныйОрган КАК ТаможенныйОрган,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Организация КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.Контрагент КАК Получатель,
	|	РеализацияТоваровУслуг.Организация.Представление КАК ГрузоотправительНаименование,
	|	РеализацияТоваровУслуг.Организация.ИНН КАК ГрузоотправительИНН,
	|	РеализацияТоваровУслуг.Организация.КПП КАК ГрузоотправительКПП,
	|	РеализацияТоваровУслуг.Организация.ОГРН КАК ГрузоотправительОГРН,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК ГрузоотправительАдреc,
	|	РеализацияТоваровУслуг.Контрагент.Представление КАК ПолучательНаименование,
	|	РеализацияТоваровУслуг.Контрагент.ИНН КАК ПолучательИНН,
	|	РеализацияТоваровУслуг.Контрагент.КПП КАК ПолучательКПП,
	|	РеализацияТоваровУслуг.Контрагент.РегистрационныйНомер КАК ПолучательОГРН,
	|	КонтрагентыКонтактнаяИнформация.Представление КАК ПолучательАдрес
	|ПОМЕСТИТЬ втРеализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО РеализацияТоваровУслуг.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ПО РеализацияТоваровУслуг.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка
	|			И (КонтрагентыКонтактнаяИнформация.Тип = &Адрес)
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.Характеристика КАК Харка,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
	|	УпаковкиЕдиницыИзмерения.Знаменатель КАК Знаменатель,
	|	РеализацияТоваровУслугТовары.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ВЫБОР
	|		КОГДА УпаковкиЕдиницыИзмерения.Ссылка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслугТовары.Количество / (УпаковкиЕдиницыИзмерения.Числитель / УпаковкиЕдиницыИзмерения.Знаменатель)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КолвоКоробок
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|		ПО (РеализацияТоваровУслугТовары.Номенклатура = УпаковкиЕдиницыИзмерения.Владелец)
	|			И (УпаковкиЕдиницыИзмерения.Наименование ПОДОБНО ""%Коробка стреп лента и скотч%"")
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.Ссылка
	|			ИЗ
	|				втРеализация КАК Т)
	|ИТОГИ
	|	СУММА(КолвоКоробок)
	|ПО
	|	НоменклатураПредставление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданный.ДокументОснование КАК ДокументОснование,
	|	СчетФактураВыданный.Ссылка КАК Ссылка,
	|	СчетФактураВыданный.Номер КАК НомерСФ,
	|	СчетФактураВыданный.Дата КАК ДатаСФ
	|ПОМЕСТИТЬ втСчетаФактуры
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.ДокументОснование = &Ссылка
	|	И НЕ СчетФактураВыданный.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Кол
	|ПОМЕСТИТЬ втВыводСтрокиВидНоменклатуры
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Номенклатура.ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРеализация.Грузоотправитель.СтранаПостоянногоМестонахождения.Представление КАК СтранаПроисхождения,
	|	втРеализация.Ссылка.Склад.ТекущийОтветственный.Фамилия + "" "" + втРеализация.Ссылка.Склад.ТекущийОтветственный.Инициалы КАК Сотрудник,
	|	втРеализация.Ссылка.Склад.ТекущаяДолжностьОтветственного КАК Должность,
	|	втРеализация.Дата КАК Дата
	|ПОМЕСТИТЬ втДопДанные
	|ИЗ
	|	втРеализация КАК втРеализация";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("ИННЭлис", "6152001000");
	Запрос.УстановитьПараметр("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Факс", Перечисления.ТипыКонтактнойИнформации.Факс);
	Запрос.УстановитьПараметр("ВебСтраница", Перечисления.ТипыКонтактнойИнформации.ВебСтраница);       
	Запрос.УстановитьПараметр("Другое", Перечисления.ТипыКонтактнойИнформации.Другое);
	Запрос.УстановитьПараметр("ЭлПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	РезультатыЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ФайлХранилищеЛого = Неопределено; 
	
	Шапка = РезультатыЗапросов[2].Выбрать();
	Если РезультатыЗапросов[3].Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Логотип организации не установлен!";
		Сообщение.Сообщить();                                 
	Иначе
		ЛоготипВыборка = РезультатыЗапросов[3].Выбрать();
		Если ЛоготипВыборка.Следующий() Тогда
			ФайлХранилищеЛого = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(ЛоготипВыборка.Ссылка), Ложь);	
		КонецЕсли;	
	КонецЕсли;
	
	Пока Шапка.Следующий() Цикл
		
		//Начало вывода документа
		// склонение банка
		ФорматнаяСтрока = "ПД=Предложный";
		РезультатСколнения = ПолучитьСклоненияСтроки(Шапка.НаименованиеБанка, ,ФорматнаяСтрока);
		
		ОбластьШапка.Параметры.Заполнить(Шапка);
		ОбластьШапка.Параметры.Логотип = ФайлХранилищеЛого;
		
		Если Не ЗначениеЗаполнено(ОбластьШапка.Параметры.ВебСтраница) Тогда
			ОбластьШапка.Параметры.ВебСтраница = Шапка.Другое;
		КонецЕсли;
		
		ОбластьШапка.Параметры.НаименованиеБанка = РезультатСколнения[0];
		ОбластьШапка2.Параметры.Заполнить(Шапка);
		
		ОбластьРеквизиты.Параметры.Заполнить(Шапка);
		//Конец вывода документа
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьШапка2);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	РеквизитыВыборка = РезультатыЗапросов[4].Выбрать();
	
	Пока РеквизитыВыборка.Следующий() Цикл
		
		ОбластьРеквизиты.Параметры.Заполнить(РеквизитыВыборка);	
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьРеквизиты);
	
	СтрокаСФВыборка = РезультатыЗапросов[6].Выбрать();
	
	Пока СтрокаСФВыборка.Следующий() Цикл
		
		ОбластьСтрокаСФ = Макет.ПолучитьОбласть("ОбластьСтрокаСФ");
		ОбластьСтрокаСФ.Параметры.НомерСФ = СтрокаСФВыборка.НомерСФ;
		ОбластьСтрокаСФ.Параметры.ДатаСФ = Формат(СтрокаСФВыборка.ДатаСФ, "ДФ=dd.MM.yyyy");
		ТабличныйДокумент.Вывести(ОбластьСтрокаСФ);
		
	КонецЦикла;
	
	
	ТабличныйДокумент.Вывести(ОбластьНаименование);
	
	СтрокаВидВыборка = РезультатыЗапросов[7].Выбрать();
	
	Пока СтрокаВидВыборка.Следующий() Цикл
		
		ОбластьСтрокаНаименование = Макет.ПолучитьОбласть("СтрокаНаименование");
		ОбластьСтрокаНаименование.Параметры.Заполнить(СтрокаВидВыборка);	
		ТабличныйДокумент.Вывести(ОбластьСтрокаНаименование);
		
	КонецЦикла;
	
	ДопДанные = РезультатыЗапросов[8].Выбрать();
	
	Если ДопДанные.Следующий() Тогда
		
		ОбластьСтрана.Параметры.Заполнить(ДопДанные);
		ОбластьДолжностьДата.Параметры.Заполнить(ДопДанные);
		
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьСтрана);
	
	
	УпаковкаСтрокаВыборка = РезультатыЗапросов[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	КолвоКоробок = 0;
	
	// на всякий случай оставлю
	МассивИнфСообщ = Новый Массив;
	
	Пока УпаковкаСтрокаВыборка.Следующий() Цикл
		
		Если УпаковкаСтрокаВыборка.КолвоКоробок = 0 Тогда
			МассивИнфСообщ.Добавить(СтрШаблон("По номенклатуре %1 нет упаковок.",
			УпаковкаСтрокаВыборка.НоменклатураПредставление));
			Продолжить;
		ИначеЕсли УпаковкаСтрокаВыборка.КолвоКоробок > 0 Тогда 
			КолвоКоробок = КолвоКоробок + Окр(УпаковкаСтрокаВыборка.КолвоКоробок + 0.5, 0, 0);; 		
		КонецЕсли;
		
	КонецЦикла;                                                     
	
	ОбластьУпаковкаСтрока = Макет.ПолучитьОбласть("УпаковкаСтрока");
	Если КолвоКоробок > 0 Тогда	
		//ОбластьУпаковкаСтрока.Параметры.Колво = КолвоКоробок;
		РезСтрока = ПолучитьСклоненияСтрокиПоЧислу(,
		КолвоКоробок,
		"картонный короб обтянутый стреп лентой и фирменным скотчем.");
		Результат = РезСтрока[0];
		НомерВтПроб = СтрНайти(Результат, " ", , , 3);
		Результат = Сред(Результат, 0, НомерВтПроб - 1) + "," + Сред(Результат, НомерВтПроб);
		ОбластьУпаковкаСтрока.Параметры.РодУпаковки = Результат;    
	Иначе
		ОбластьУпаковкаСтрока.Параметры.ИнфСообщение = "По номенклатуре нет упаковок.";		
	КонецЕсли;
	
	//Для Каждого Инф Из МассивИнфСообщ Цикл
	//	
	//	ОбластьУпаковкаСтрока = Макет.ПолучитьОбласть("УпаковкаСтрока");		
	//	ОбластьУпаковкаСтрока.Параметры.ИнфСообщение = Инф;
	//	ТабличныйДокумент.Вывести(ОбластьУпаковкаСтрока);
	//	
	//КонецЦикла;             
	
	ТабличныйДокумент.Вывести(ОбластьУпаковкаСтрока);
	
	ТабличныйДокумент.Вывести(ОбластьДолжностьДата);
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатьСпецификацияНаТовар(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_СпецификацияНаТовар";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_СпецификацияНаТовар");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Организация КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.Контрагент КАК Получатель,
	|	РеализацияТоваровУслуг.Организация.НаименованиеПолное КАК ПолноеЮрНаименование,
	|	РеализацияТоваровУслуг.Организация.ИНН КАК ИНН,
	|	РеализацияТоваровУслуг.Организация.КПП КАК КПП,
	|	РеализацияТоваровУслуг.Организация.ОГРН КАК ОГРН,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Адреc,
	|	ОрганизацииКонтактнаяИнформация2.Представление КАК Телефон,
	|	РеализацияТоваровУслуг.Контрагент.НаименованиеПолное КАК ПолноеЮрНаименованиеПокупатель,
	|	РеализацияТоваровУслуг.Контрагент.ИНН КАК ИННПокупатель,
	|	РеализацияТоваровУслуг.Контрагент.КПП КАК КПППокупатель,
	|	РеализацияТоваровУслуг.Контрагент.РегистрационныйНомер КАК ОГРНПокупатель,
	|	КонтрагентыКонтактнаяИнформация.Представление КАК АдресПокупатель,
	|	КонтрагентыКонтактнаяИнформация2.Представление КАК ТелефонПокупатель
	|ПОМЕСТИТЬ втРеализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО РеализацияТоваровУслуг.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация2
	|		ПО РеализацияТоваровУслуг.Организация = ОрганизацииКонтактнаяИнформация2.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация2.Тип = &Телефон)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ПО РеализацияТоваровУслуг.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка
	|			И (КонтрагентыКонтактнаяИнформация.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация2
	|		ПО РеализацияТоваровУслуг.Контрагент = КонтрагентыКонтактнаяИнформация2.Ссылка
	|			И (КонтрагентыКонтактнаяИнформация2.Тип = &Телефон)
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРеализация.Ссылка КАК Ссылка,
	|	втРеализация.Дата КАК Дата,
	|	втРеализация.Грузоотправитель КАК Грузоотправитель,
	|	втРеализация.Получатель КАК Получатель,
	|	втРеализация.ПолноеЮрНаименование КАК ПолноеЮрНаименование,
	|	втРеализация.ИНН КАК ИНН,
	|	втРеализация.КПП КАК КПП,
	|	втРеализация.ОГРН КАК ОГРН,
	|	втРеализация.Адреc КАК Адреc,
	|	втРеализация.Телефон КАК Телефон,
	|	втРеализация.ПолноеЮрНаименованиеПокупатель КАК ПолноеЮрНаименованиеПокупатель,
	|	втРеализация.ИННПокупатель КАК ИННПокупатель,
	|	втРеализация.КПППокупатель КАК КПППокупатель,
	|	втРеализация.ОГРНПокупатель КАК ОГРНПокупатель,
	|	втРеализация.АдресПокупатель КАК АдресПокупатель,
	|	втРеализация.ТелефонПокупатель КАК ТелефонПокупатель,
	|	БанковскиеСчетаОрганизаций.БИКБанка КАК БИК,
	|	БанковскиеСчетаОрганизаций.НаименованиеБанка КАК НаименованиеБанка,
	|	БанковскиеСчетаОрганизаций.НомерСчета КАК РасчСчет,
	|	БанковскиеСчетаОрганизаций.КоррСчетБанка КАК КоррСчет,
	|	БанковскиеСчетаКонтрагентов.БИКБанка КАК БИКПокупатель,
	|	БанковскиеСчетаКонтрагентов.НаименованиеБанка КАК НаименованиеБанкаПокупатель,
	|	БанковскиеСчетаКонтрагентов.НомерСчета КАК РасчСчетПокупатель,
	|	БанковскиеСчетаКонтрагентов.КоррСчетБанка КАК КоррСчетПокупатель
	|ПОМЕСТИТЬ втРеализацияРеквизиты
	|ИЗ
	|	втРеализация КАК втРеализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
	|		ПО втРеализация.Получатель = БанковскиеСчетаКонтрагентов.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ПО втРеализация.Грузоотправитель = БанковскиеСчетаОрганизаций.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура.Представление КАК Наименование,
	|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|	РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения.Представление КАК ЕдИзмерения,
	|	РеализацияТоваровУслугТовары.Ссылка.Валюта.Представление КАК Валюта
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Наименование КАК НаименованиеКол,
	|	втТовары.Сумма КАК Сумма,
	|	втТовары.Валюта КАК Валюта
	|ИЗ
	|	втТовары КАК втТовары
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Наименование),
	|	СУММА(Сумма)
	|ПО
	|	втТовары.Валюта КАК Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Рук.ФизическоеЛицо.Фамилия + "" "" + Рук.ФизическоеЛицо.Инициалы КАК Руководитель,
	|	Бух.ФизическоеЛицо.Фамилия + "" "" + Бух.ФизическоеЛицо.Инициалы КАК ГлавБух
	|ИЗ
	|	втРеализация КАК втРеализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛицаОрганизаций КАК Бух
	|		ПО втРеализация.Грузоотправитель = Бух.Владелец
	|			И (Бух.Должность = ""Главный бухгалтер"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛицаОрганизаций КАК Рук
	|		ПО втРеализация.Грузоотправитель = Рук.Владелец
	|			И (Рук.Должность = ""Руководитель"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРеализация.Ссылка.Номер КАК НомерСпецификации,
	|	втРеализация.Ссылка.Дата КАК ДатаСпецификации,
	|	втРеализация.Ссылка.Договор.Представление КАК СоглашениеПредставление,
	|	втРеализация.Ссылка.Договор.Номер КАК ДоговорНомер,
	|	втРеализация.Ссылка.Договор.Дата КАК ДоговорДата
	|ПОМЕСТИТЬ втЗаголовок
	|ИЗ
	|	втРеализация КАК втРеализация";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	РезультатыЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ВыборкаЗаголовок = РезультатыЗапросов[5].Выбрать();
	Если ВыборкаЗаголовок.Следующий() Тогда
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаЗаголовок);
		ОбластьЗаголовок.Параметры.ДатаСпецификации = Формат(ВыборкаЗаголовок.ДатаСпецификации,
		"ДФ=dd.MM.yyyy");
		ОбластьЗаголовок.Параметры.ДоговорДата = Формат(ВыборкаЗаголовок.ДоговорДата,
		"ДФ=dd.MM.yyyy");
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	
	ОбластьРеквизиты = Макет.ПолучитьОбласть("Реквизиты");
	ВыборкаРеквизиты = РезультатыЗапросов[1].Выбрать();
	Если ВыборкаРеквизиты.Следующий() Тогда
		ОбластьРеквизиты.Параметры.Заполнить(ВыборкаРеквизиты);
		ФорматнаяСтрока = "ПД=Предложный";
		РезультатСколнения1 = ПолучитьСклоненияСтроки(ВыборкаРеквизиты.НаименованиеБанка, ,ФорматнаяСтрока);
		РезультатСколнения2 = ПолучитьСклоненияСтроки(ВыборкаРеквизиты.НаименованиеБанкаПокупатель, ,ФорматнаяСтрока);
		ОбластьРеквизиты.Параметры.НаименованиеБанка = ?(РезультатСколнения1.Количество() <> 0, РезультатСколнения1[0], ВыборкаРеквизиты.НаименованиеБанка);
		ОбластьРеквизиты.Параметры.НаименованиеБанкаПокупатель = ?(РезультатСколнения2.Количество() <> 0, РезультатСколнения2[0], ВыборкаРеквизиты.НаименованиеБанкаПокупатель);
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьРеквизиты);
	
	
	ВыборкаТовары = РезультатыЗапросов[2].Выбрать();
	СуммаВсего = 0;
	Валюта = Неопределено;
	Пока ВыборкаТовары.Следующий() Цикл
		
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");		
		ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаТовары);
		
		ОбластьСтрокаТаблицы.Параметры.Сумма = Формат(ВыборкаТовары.Сумма, "ЧДЦ=2; ЧГ=0");
		ОбластьСтрокаТаблицы.Параметры.Цена = Формат(ВыборкаТовары.Цена, "ЧДЦ=2; ЧГ=0");
		
		
		СуммаВсего = СуммаВсего + ВыборкаТовары.Сумма;
		Валюта = ВыборкаТовары.Валюта;
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
		
	КонецЦикла;
	
	ОбластьИтогиТаблицы = Макет.ПолучитьОбласть("ИтогиТаблицы");
	ОбластьИтогиТаблицы.Параметры.СуммаВсего = СуммаВсего;
	ОбластьИтогиТаблицы.Параметры.Валюта = Валюта;
	ТабличныйДокумент.Вывести(ОбластьИтогиТаблицы);
	
	ОбластьДопИнфо = Макет.ПолучитьОбласть("ИтогиДоп");
	
	ВыборкаДоп = РезультатыЗапросов[3].Выбрать();
	
	Если ВыборкаДоп.Следующий() Тогда
		
		ОбластьДопИнфо.Параметры.КолНаименование = ВыборкаДоп.НаименованиеКол;
		ОбластьДопИнфо.Параметры.СуммаВсего = Формат(ВыборкаДоп.Сумма, "ЧДЦ=2; ЧГ=0");
		ОбластьДопИнфо.Параметры.Валюта = ВыборкаДоп.Валюта;
		ОбластьДопИнфо.Параметры.СуммаВсегоТекстом = ЧислоПрописью(ВыборкаДоп.Сумма,
		"Л = ru_RU; ДП = Истина",
		"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		ТабличныйДокумент.Вывести(ОбластьДопИнфо);
	КонецЕсли;                                                
	
	ОбластьРукБух = Макет.ПолучитьОбласть("РукБух");
	ВыборкаРукБух = РезультатыЗапросов[4].Выбрать();
	Если ВыборкаРукБух.Следующий() Тогда
		ОбластьРукБух.Параметры.Заполнить(ВыборкаРукБух);	
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьРукБух);
	
	Возврат ТабличныйДокумент;			
	
КонецФункции

Функция ПечатьВесИСостав(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ВесИСостав";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_ВесИСостав");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Валюта КАК Валюта
	|ПОМЕСТИТЬ втРеализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка.Валюта КАК Валюта,
	|	РеализацияТоваровУслугТовары.Номенклатура.Представление КАК Наименование,
	|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|	РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения.Представление КАК ЕдИзмерения,
	|	РеализацияТоваровУслугТовары.Упаковка КАК Упаковка,
	|	РеализацияТоваровУслугТовары.Номенклатура.ВесЧислитель КАК ВесЧ,
	|	РеализацияТоваровУслугТовары.Номенклатура.ВесЗнаменатель КАК ВесЗ,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Номенклатура.ВесЧислитель = 0
	|			ТОГДА РеализацияТоваровУслугТовары.Количество * 0
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Количество * (РеализацияТоваровУслугТовары.Номенклатура.ВесЧислитель / РеализацияТоваровУслугТовары.Номенклатура.ВесЗнаменатель)
	|	КОНЕЦ КАК ВесНетто,
	|	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
	|	УпаковкиЕдиницыИзмерения.Знаменатель КАК Знаменатель,
	|	УпаковкиЕдиницыИзмерения.Вес КАК Вес,
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК УпаковкаЕД,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|		ПО (РеализацияТоваровУслугТовары.Номенклатура = УпаковкиЕдиницыИзмерения.Владелец)
	|			И (УпаковкиЕдиницыИзмерения.Наименование ПОДОБНО ""%Коробка стреп лента и скотч%"")
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втСвойствоСостав
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.ИдентификаторДляФормул = ""СоставСайт""
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект КАК Объект,
	|	ДополнительныеСведения.Свойство КАК Свойство,
	|	ДополнительныеСведения.Значение КАК Значение
	|ПОМЕСТИТЬ втСведения
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство В
	|				(ВЫБРАТЬ
	|					Т.Ссылка
	|				ИЗ
	|					втСвойствоСостав КАК Т)
	|			И ДополнительныеСведения.Объект В
	|				(ВЫБРАТЬ
	|					Т.Номенклатура
	|				ИЗ
	|					втТовары КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Валюта КАК Валюта,
	|	втТовары.Наименование КАК Наименование,
	|	втТовары.ЕдИзмерения КАК ЕдИзмерения,
	|	втТовары.Количество КАК Количество,
	|	втТовары.Цена КАК Цена,
	|	втТовары.Сумма КАК Сумма,
	|	втТовары.ВесНетто КАК ВесНетто,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Числитель КАК Числитель,
	|	втТовары.Знаменатель КАК Знаменатель,
	|	втТовары.Вес КАК Вес,
	|	втТовары.УпаковкаЕД КАК УпаковкаЕД,
	|	втСведения.Значение КАК Состав
	|ИЗ
	|	втТовары КАК втТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСведения КАК втСведения
	|		ПО (втТовары.Номенклатура = втСведения.Объект)
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(ВесНетто)
	|ПО
	|	ОБЩИЕ";
	
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0]); 
	
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ВыборкаОбщая.Следующий() Тогда
		
		СуммаИтого = ВыборкаОбщая.Сумма;
		ВесНеттоИтого = ВыборкаОбщая.ВесНетто;
		ВесБруттоИтого = 0;
		Валюта = Неопределено;
		
		Выборка = ВыборкаОбщая.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
			ОбластьСтрокаТаблицы.Параметры.Заполнить(Выборка);            	
			
			КонечноеЧислоУпаковок = 0;
			ВесБрутто = 0;	  
			
			Если Выборка.Знаменатель <> Null Тогда
				
				Если Выборка.Знаменатель <> 0 И Выборка.Числитель <> 0 Тогда
					КоличествоУпаковок = Выборка.Количество / (Выборка.Числитель / Выборка.Знаменатель); 
					ЦелаяЧасть = Цел(КоличествоУпаковок);
					ДробнаяЧасть = КоличествоУпаковок - ЦелаяЧасть;
					КонечноеЧислоУпаковок = ?(ДробнаяЧасть = 0, ЦелаяЧасть, ЦелаяЧасть + 1);
					ВесБрутто = Выборка.Вес * КонечноеЧислоУпаковок;
				КонецЕсли;	
				
			КонецЕсли;
			
			ОбластьСтрокаТаблицы.Параметры.ВесБрутто = ВесБрутто;
			ВесБруттоИтого = ВесБруттоИтого + ВесБрутто;	
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы); 
			Валюта = Выборка.Валюта;
		КонецЦикла;
		
		ОбластьИтогиТаблицы = Макет.ПолучитьОбласть("ИтогиТаблицы");
		ОбластьИтогиТаблицы.Параметры.СуммаИтого = Формат(СуммаИтого, "ЧДЦ=2; ЧГ=0");
		ОбластьИтогиТаблицы.Параметры.ВесНеттоИтого = Формат(ВесНеттоИтого, "ЧДЦ=2; ЧГ=0");
		ОбластьИтогиТаблицы.Параметры.ВесБруттоИтого = Формат(ВесБруттоИтого, "ЧДЦ=2; ЧГ=0");
		ОбластьИтогиТаблицы.Параметры.Валюта = Валюта;
		
		ТабличныйДокумент.Вывести(ОбластьИтогиТаблицы);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьСоставТкани(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_СоставТкани";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_СоставТкани");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Организация КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.Контрагент КАК Получатель,
	|	РеализацияТоваровУслуг.Организация.НаименованиеПолное КАК ПолноеЮрНаименование,
	|	РеализацияТоваровУслуг.Организация.ИНН КАК ИНН,
	|	РеализацияТоваровУслуг.Организация.КПП КАК КПП,
	|	РеализацияТоваровУслуг.Организация.ОГРН КАК ОГРН,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Адреc,
	|	ОрганизацииКонтактнаяИнформация2.Представление КАК Телефон,
	|	РеализацияТоваровУслуг.Контрагент.НаименованиеПолное КАК ПолноеЮрНаименованиеПокупатель,
	|	РеализацияТоваровУслуг.Контрагент.ИНН КАК ИННПокупатель,
	|	РеализацияТоваровУслуг.Контрагент.КПП КАК КПППокупатель,
	|	РеализацияТоваровУслуг.Контрагент.РегистрационныйНомер КАК ОГРНПокупатель,
	|	КонтрагентыКонтактнаяИнформация.Представление КАК АдресПокупатель,
	|	КонтрагентыКонтактнаяИнформация2.Представление КАК ТелефонПокупатель
	|ПОМЕСТИТЬ втРеализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО (РеализацияТоваровУслуг.Организация = ОрганизацииКонтактнаяИнформация.Ссылка)
	|			И (ОрганизацииКонтактнаяИнформация.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация2
	|		ПО (РеализацияТоваровУслуг.Организация = ОрганизацииКонтактнаяИнформация2.Ссылка)
	|			И (ОрганизацииКонтактнаяИнформация2.Тип = &Телефон)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ПО (РеализацияТоваровУслуг.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка)
	|			И (КонтрагентыКонтактнаяИнформация.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация2
	|		ПО (РеализацияТоваровУслуг.Контрагент = КонтрагентыКонтактнаяИнформация2.Ссылка)
	|			И (КонтрагентыКонтактнаяИнформация2.Тип = &Телефон)
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРеализация.Ссылка КАК Ссылка,
	|	втРеализация.Ссылка.Номер КАК НомерСпецификации,
	|	втРеализация.Ссылка.Дата КАК ДатаСпецификации,
	|	втРеализация.Дата КАК Дата,
	|	втРеализация.Грузоотправитель КАК Грузоотправитель,
	|	втРеализация.Получатель КАК Получатель,
	|	втРеализация.ПолноеЮрНаименование КАК ПолноеЮрНаименование,
	|	втРеализация.ИНН КАК ИНН,
	|	втРеализация.КПП КАК КПП,
	|	втРеализация.ОГРН КАК ОГРН,
	|	втРеализация.Адреc КАК Адреc,
	|	втРеализация.Телефон КАК Телефон,
	|	втРеализация.ПолноеЮрНаименованиеПокупатель КАК ПолноеЮрНаименованиеПокупатель,
	|	втРеализация.ИННПокупатель КАК ИННПокупатель,
	|	втРеализация.КПППокупатель КАК КПППокупатель,
	|	втРеализация.ОГРНПокупатель КАК ОГРНПокупатель,
	|	втРеализация.АдресПокупатель КАК АдресПокупатель,
	|	втРеализация.ТелефонПокупатель КАК ТелефонПокупатель,
	|	БанковскиеСчетаОрганизаций.БИКБанка КАК БИК,
	|	БанковскиеСчетаОрганизаций.НаименованиеБанка КАК НаименованиеБанка,
	|	БанковскиеСчетаОрганизаций.НомерСчета КАК РасчСчет,
	|	БанковскиеСчетаОрганизаций.КоррСчетБанка КАК КоррСчет,
	|	БанковскиеСчетаКонтрагентов.БИКБанка КАК БИКПокупатель,
	|	БанковскиеСчетаКонтрагентов.НаименованиеБанка КАК НаименованиеБанкаПокупатель,
	|	БанковскиеСчетаКонтрагентов.НомерСчета КАК РасчСчетПокупатель,
	|	БанковскиеСчетаКонтрагентов.КоррСчетБанка КАК КоррСчетПокупатель
	|ПОМЕСТИТЬ втРеализацияРеквизиты
	|ИЗ
	|	втРеализация КАК втРеализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
	|		ПО втРеализация.Получатель = БанковскиеСчетаКонтрагентов.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ПО втРеализация.Грузоотправитель = БанковскиеСчетаОрганизаций.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура.Представление КАК ГруппировкаНоменклатура,
	|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТовары.СуммаСНДС КАК Сумма,
	|	РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения.Представление КАК ЕдИзмерения,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.ГруппировкаНоменклатура КАК ГруппировкаНоменклатура,
	|	втТовары.Характеристика.Представление КАК Наименование,
	|	втТовары.ЕдИзмерения КАК ЕдИзмерения,
	|	втТовары.Количество КАК Количество,
	|	втТовары.Цена КАК Цена,
	|	втТовары.Сумма КАК Сумма
	|ИЗ
	|	втТовары КАК втТовары
	|ИТОГИ ПО
	|	ГруппировкаНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРеализация.Ссылка.Номер КАК НомерСпецификации,
	|	втРеализация.Ссылка.Дата КАК ДатаСпецификации,
	|	втРеализация.Ссылка.Договор.Представление КАК ДоговорСпецификации,
	|	втРеализация.Ссылка.Договор.Дата КАК ДатаДоговораСпецификации
	|ПОМЕСТИТЬ втЗаголовок
	|ИЗ
	|	втРеализация КАК втРеализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Рук.ФизическоеЛицо.Фамилия + "" "" + Рук.ФизическоеЛицо.Инициалы КАК Руководитель,
	|	Бух.ФизическоеЛицо.Фамилия + "" "" + Бух.ФизическоеЛицо.Инициалы КАК ГлавБух
	|ИЗ
	|	втРеализация КАК втРеализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛицаОрганизаций КАК Бух
	|		ПО втРеализация.Грузоотправитель = Бух.Владелец
	|			И (Бух.Должность = ""Главный бухгалтер"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛицаОрганизаций КАК Рук
	|		ПО втРеализация.Грузоотправитель = Рук.Владелец
	|			И (Рук.Должность = ""Руководитель"")";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	РезультатыЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ВыборкаЗаголовок = РезультатыЗапросов[4].Выбрать();
	Если ВыборкаЗаголовок.Следующий() Тогда
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаЗаголовок);
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	ОбластьРеквизиты = Макет.ПолучитьОбласть("Реквизиты");
	ВыборкаРеквизиты = РезультатыЗапросов[1].Выбрать();
	Если ВыборкаРеквизиты.Следующий() Тогда
		ОбластьРеквизиты.Параметры.Заполнить(ВыборкаРеквизиты);
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьРеквизиты);
	
	ВыборкаНоменклатура = РезультатыЗапросов[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НомерСтроки = 1;
	Пока ВыборкаНоменклатура.Следующий() Цикл
		ОбластьГруппировкаНоменклатура = Макет.ПолучитьОбласть("ГруппировкаНоменклатура");
		ОбластьГруппировкаНоменклатура.Параметры.Заполнить(ВыборкаНоменклатура);
		ТабличныйДокумент.Вывести(ОбластьГруппировкаНоменклатура);
		
		Выборка = ВыборкаНоменклатура.Выбрать();
		Пока Выборка.Следующий() Цикл
			// добавить потом состав ткани !
			ОбластьСтрокаГруппировки = Макет.ПолучитьОбласть("СтрокаГруппировки");
			ОбластьСтрокаГруппировки.Параметры.Заполнить(Выборка);
			ОбластьСтрокаГруппировки.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьСтрокаГруппировки);
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ОбластьРукБух = Макет.ПолучитьОбласть("РукБух");
	ВыборкаРукБух = РезультатыЗапросов[5].Выбрать();
	Если ВыборкаРукБух.Следующий() Тогда
		ОбластьРукБух.Параметры.Заполнить(ВыборкаРукБух);	
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьРукБух);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьСпецификация(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Спецификация";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_Спецификация");
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	// надо переделать
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втСвойствоСостав
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.ИдентификаторДляФормул = ""СоставСайт""
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК РТУСсылка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РеализацияТоваровУслуг.Организация) КАК ЮрЛицо,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.Номенклатура.КСП_АртикулУПП.Цвет КАК Цвет,
	|	РеализацияТоваровУслугТовары.Номенклатура.КСП_АртикулУПП.ДатаИзготовления КАК ДатаИзготовления,
	|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	|	РеализацияТоваровУслугТовары.Упаковка КАК Упаковка,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТовары.СуммаСНДС КАК СуммаСНДС,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО (РеализацияТоваровУслугТовары.Ссылка = РеализацияТоваровУслуг.Ссылка)
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.РТУСсылка КАК РТУСсылка,
	|	втТовары.ЮрЛицо КАК ЮрЛицо,
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	втТовары.Номенклатура.Артикул КАК Модель,
	|	втТовары.Номенклатура.Марка.Представление КАК Бренд,
	|	втТовары.Номенклатура.НаименованиеПолное КАК Наименование,
	|	втТовары.Номенклатура.СтранаПроисхождения.Представление КАК Страна,
	|	втТовары.Номенклатура.КодТНВЭД.Представление КАК НоменклатураКодТНВЭДПредставление,
	|	втТовары.Номенклатура.ВесЕдиницаИзмерения КАК НоменклатураВесЕдиницаИзмерения,
	|	втТовары.Номенклатура.ВесЧислитель КАК НоменклатураВесЧислитель,
	|	втТовары.Номенклатура.ВесЗнаменатель КАК НоменклатураВесЗнаменатель,
	|	ВЫБОР
	|		КОГДА втТовары.Номенклатура.ВесЗнаменатель <> 0
	|			ТОГДА втТовары.Номенклатура.ВесЧислитель / втТовары.Номенклатура.ВесЗнаменатель
	|		ИНАЧЕ втТовары.Номенклатура.ВесЧислитель / 1
	|	КОНЕЦ КАК ВесЕдиницы,
	|	втТовары.Номенклатура.Описание КАК Описание,
	|	втТовары.Характеристика.Представление КАК ХарактеристикаПредставление,
	|	втТовары.Количество КАК Количество,
	|	втТовары.Цена КАК Цена,
	|	втТовары.СуммаСНДС КАК Сумма,
	|	втТовары.Цвет КАК Цвет,
	|	втТовары.ДатаИзготовления КАК ДатаИзготовления,
	|	втТовары.Номенклатура.ВидНоменклатуры КАК НоменклатураВидНоменклатуры,
	|	втТовары.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ втТов
	|ИЗ
	|	втТовары КАК втТовары
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект КАК Объект,
	|	ДополнительныеСведения.Свойство КАК Свойство,
	|	ДополнительныеСведения.Значение КАК Значение
	|ПОМЕСТИТЬ втСведения
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство В
	|			(ВЫБРАТЬ
	|				Т.Ссылка
	|			ИЗ
	|				втСвойствоСостав КАК Т)
	|	И ДополнительныеСведения.Объект В
	|			(ВЫБРАТЬ
	|				Т.Номенклатура
	|			ИЗ
	|				втТов КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СертификатыНоменклатуры.Ссылка КАК Ссылка,
	|	СертификатыНоменклатуры.Статус КАК Статус,
	|	СертификатыНоменклатуры.ЭтоГруппа КАК ЭтоГруппа,
	|	ОбластиДействияСертификатовНоменклатуры.Номенклатура КАК Номенклатура,
	|	СертификатыНоменклатуры.Номер КАК Номер
	|ПОМЕСТИТЬ втТовССерт
	|ИЗ
	|	Справочник.СертификатыНоменклатуры КАК СертификатыНоменклатуры
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ОбластиДействияСертификатовНоменклатуры КАК ОбластиДействияСертификатовНоменклатуры
	|		ПО СертификатыНоменклатуры.Ссылка = ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры
	|			И (ОбластиДействияСертификатовНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Т.Номенклатура
	|				ИЗ
	|					втТов КАК Т))
	|ГДЕ
	|	СертификатыНоменклатуры.Статус = &Статус
	|	И НЕ СертификатыНоменклатуры.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТов.РТУСсылка КАК РТУСсылка,
	|	втТов.ЮрЛицо КАК ЮрЛицо,
	|	втТов.Номенклатура КАК Номенклатура,
	|	втТов.Характеристика КАК Характеристика,
	|	втТов.Модель КАК Модель,
	|	втТов.Бренд КАК Бренд,
	|	втТов.Наименование КАК Наименование,
	|	втТов.Страна КАК Страна,
	|	втТов.НоменклатураКодТНВЭДПредставление КАК ТНВЭД,
	|	втТов.НоменклатураВесЕдиницаИзмерения КАК НоменклатураВесЕдиницаИзмерения,
	|	втТов.НоменклатураВесЧислитель КАК НоменклатураВесЧислитель,
	|	втТов.НоменклатураВесЗнаменатель КАК НоменклатураВесЗнаменатель,
	|	втТов.ВесЕдиницы КАК ВесЕдиницы,
	|	втТов.Описание КАК Описание,
	|	втТов.ХарактеристикаПредставление КАК ХарактеристикаПредставление,
	|	втТов.Количество КАК Количество,
	|	втТов.СтавкаНДС КАК СтавкаНДС,
	|	втТов.Цвет КАК Цвет,
	//|	втТов.ДатаИзготовления КАК ДатаПроизводства,// будут подтягиваться из другого места (его пока нет)
	|	втТов.Цена КАК Цена,
	|	втТов.Сумма КАК Сумма,
	|	втТов.НоменклатураВидНоменклатуры КАК НоменклатураВидНоменклатуры,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК шк,
	|	втТов.Номенклатура.СрокГодности КАК СрокГодности,
	|	втТов.Номенклатура.ЕдиницаИзмеренияСрокаГодности КАК СрокГодностиЕд,
	|	втТовССерт.Номер КАК НомерСертификата,
	|	втСведения.Значение КАК СоставИзделия
	|ИЗ
	|	втТов КАК втТов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО (втТов.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура)
	|			И (втТов.Характеристика = ШтрихкодыНоменклатуры.Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТовССерт КАК втТовССерт
	|		ПО (втТов.Номенклатура = втТовССерт.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСведения КАК втСведения
	|		ПО (втТов.Номенклатура = втСведения.Объект)
	|ИТОГИ ПО
	|	РТУСсылка,
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыСертификатовНоменклатуры.Действующий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПередача = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	// ИТОГИ сделаны для заполнения штрихкодов
	Пока ВыборкаПередача.Следующий() Цикл
		
		ВыборкаНоменклатура = ВыборкаПередача.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНоменклатура.Следующий() Цикл
			
			ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
			ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
			
			Сч = 1;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если Сч = 1 Тогда	
					ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
					ОбластьСтрока.Параметры["шк" + Строка(Сч)] = ВыборкаДетальныеЗаписи.шк; 
					ОбластьСтрока.Параметры.Размер = ВыборкаДетальныеЗаписи.ХарактеристикаПредставление; // точно ли так
				ИначеЕсли Сч < 9 Тогда
					ОбластьСтрока.Параметры["шк" + Строка(Сч)] = ВыборкаДетальныеЗаписи.шк;
				Иначе
					Продолжить;
				КонецЕсли;
				Сч = Сч + 1;	
			КонецЦикла;
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);	
			
		КонецЦикла;
		
	КонецЦикла;
	
	РасчетШириныКолонок(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции 


Процедура РасчетШириныКолонок(ТабличныйДокумент)
	
	Перем МаксимальноеКоличествоСтрок, МаксимальнаяШиринаКолонки;
	Перем КонечнаяСтрока, НачальнаяСтрока, ТекущаяКолонка, ТекущаяСтрока, НачалоДанных;
	Перем ОбластьШапки, ОбластьПодвала;
	Перем ШиринаКолонки, ТекстЯчейки, НомерСтрокиТекста;
	Перем КоличествоУровнейГруппировокСтрок, Отступ;
	Перем ШириныКолонок;
	
	// Максимальное количество строк отчета, которые будут использованы для расчета ширин колонок
	
	МаксимальноеКоличествоСтрок = 50;
	// Ограничение максимальной ширины колонки
	
	МаксимальнаяШиринаКолонки = 50;
	// Массив, в который будут помещаться ширины колонок
	
	ШириныКолонок = Новый Массив;
	// Получим количество уровней группировок в отчете для учета автоматического отступа
	
	КоличествоУровнейГруппировокСтрок = ТабличныйДокумент.КоличествоУровнейГруппировокСтрок();
	
	// Инициализируем начальные строки
	
	НачальнаяСтрока = 0;
	НачалоДанных = 0;
	
	// Найдем в результирующем документе область шапки таблицы
	
	ОбластьШапки = ТабличныйДокумент.Области.Найти("ШапкаТаблицы");
	Если ТипЗнч(ОбластьШапки) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		
		// Из шапки таблицы получим начальную строку с которой будем рассчитывать ширины
		НачальнаяСтрока = ОбластьШапки.Верх;
		НачалоДанных = ОбластьШапки.Низ + 1;
	Иначе
		
		// Если область шапки таблицы не найдена, найдем область шапки строк
		ОбластьШапки = ТабличныйДокумент.Области.Найти("ШапкаСтрок");
		Если ТипЗнч(ОбластьШапки) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			
			// Из шапки таблицы получим начальную строку с которой будем рассчитывать ширины
			НачальнаяСтрока = ОбластьШапки.Верх;
			НачалоДанных = ОбластьШапки.Низ + 1;
			
		КонецЕсли;
	КонецЕсли;
	
	// Получим область подвала отчета и вычислим конечную строку расчета
	
	ОбластьПодвала = ТабличныйДокумент.Области.Найти("Подвал");
	Если ТипЗнч(ОбластьПодвала) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		// Область подвала найдена
		КонечнаяСтрока = ОбластьПодвала.Верх - 1;
		Если КонечнаяСтрока - НачальнаяСтрока > МаксимальноеКоличествоСтрок Тогда
			КонечнаяСтрока = НачальнаяСтрока + МаксимальноеКоличествоСтрок;
		КонецЕсли;
	Иначе 
		// Область подвала не найдена
		КонечнаяСтрока = НачальнаяСтрока + МаксимальноеКоличествоСтрок;
	КонецЕсли;
	
	// Ограничим конечную строку
	КонечнаяСтрока = Мин(КонечнаяСтрока, ТабличныйДокумент.ВысотаТаблицы);
	// Переберем все колонки отчета
	Для ТекущаяКолонка = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		АвтоОтступ = 0;
		// Переберем строки, которые будут использованы для расчета ширин колонок
		Для ТекущаяСтрока = НачальнаяСтрока По КонечнаяСтрока Цикл
			ШиринаКолонки = 0;
			// Получим область текущей ячейки
			ОбластьЯчейки = ТабличныйДокумент.Область(ТекущаяСтрока, ТекущаяКолонка);
			Если ОбластьЯчейки.Лево <> ТекущаяКолонка Или ОбластьЯчейки.Верх <> ТекущаяСтрока Тогда
				// Данная ячейка принадлежит объединенным ячейкам и не является начальной ячейкой
				Продолжить;
			КонецЕсли;
			Если КоличествоУровнейГруппировокСтрок > 0 И ТекущаяСтрока = НачалоДанных Тогда
				// Для первой строки с данными получим значение автоотступа
				АвтоОтступ = ОбластьЯчейки.АвтоОтступ;
			КонецЕсли;
			// Получим текст ячейки
			ТекстЯчейки = ОбластьЯчейки.Текст;
			// Для каждой строки из текста ячейки рассчитаем количество символов в строке
			Для НомерСтрокиТекста = 1 По СтрЧислоСтрок(ТекстЯчейки) Цикл
				ШиринаТекстаЯчейки = СтрДлина(СтрПолучитьСтроку(ТекстЯчейки, НомерСтрокиТекста));
				// Если используется автоотступ, то прибавим к ширине ячейки его величину
				Если АвтоОтступ <> Неопределено И АвтоОтступ > 0 Тогда
					ШиринаТекстаЯчейки = ШиринаТекстаЯчейки + КоличествоУровнейГруппировокСтрок * АвтоОтступ;
				КонецЕсли;
				ШиринаКолонки = Макс(ШиринаКолонки, ШиринаТекстаЯчейки);
			КонецЦикла;
			
			Если ШиринаКолонки > МаксимальнаяШиринаКолонки Тогда
				// Ограничим ширину колонки
				ШиринаКолонки = МаксимальнаяШиринаКолонки;
			КонецЕсли;
			Если ШиринаКолонки <> 0 Тогда
				// Ширина колонки рассчитана
				// Определим, сколько ячеек по ширине используется в области для текущей ячейки
				КоличествоКолонок = ОбластьЯчейки.Право - ОбластьЯчейки.Лево;
				// Переберем все ячейки, расположенные в области
				Для НомерКолонки = 0 По КоличествоКолонок Цикл
					Если ШириныКолонок.ВГраница() > ТекущаяКолонка - 1 + НомерКолонки Тогда
						// В массиве ширин колонок уже был элемент для текущей колонки
						Если ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки] = Неопределено Тогда
							// Значение ширины колонки еще не было установлено
							ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки] = ШиринаКолонки / (КоличествоКолонок + 1);
						Иначе
							// Значение ширины колонки уже было установлено
							// Вычислим максимум ширины колонки
							ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки] = 
							Макс(ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки], ШиринаКолонки / (КоличествоКолонок + 1));
						КонецЕсли;
					Иначе
						// В массиве ширин колонок еще не было элемента для данной колонки
						// Добавим элемент в массив ширин колонок
						ШириныКолонок.Вставить(ТекущаяКолонка - 1 + НомерКолонки, ШиринаКолонки / (КоличествоКолонок + 1));
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;    // Конец цикла перебора строк
	КонецЦикла;    // Конец цикла перебора колонок
	
	// Переберем все элементы в массиве вычисленных ширин колонок
	Для ТекущаяКолонка = 0 По ШириныКолонок.ВГраница() Цикл
		Если ШириныКолонок[ТекущаяКолонка] <> Неопределено Тогда
			// Ширина колонок установлена
			// Установим ширину области ячеек
			ТабличныйДокумент.Область(, ТекущаяКолонка + 1, НачалоДанных, ТекущаяКолонка + 1).ШиринаКолонки = ШириныКолонок[ТекущаяКолонка] + 1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры  

&ИзменениеИКонтроль("СформироватьКомплектПечатныхФорм")
Функция КСП_СформироватьКомплектПечатныхФорм(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати)
	
	Перем АдресКомплектаПечатныхФорм;
	
	Если ТипЗнч(ПараметрыПечати) = Тип("Структура") И ПараметрыПечати.Свойство("АдресКомплектаПечатныхФорм", АдресКомплектаПечатныхФорм) Тогда
		
		КомплектПечатныхФорм = ПолучитьИзВременногоХранилища(АдресКомплектаПечатныхФорм);
		
	Иначе
		
		КомплектПечатныхФорм = РегистрыСведений.НастройкиПечатиОбъектов.КомплектПечатныхФорм(
		Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя(),
		МассивОбъектов, Неопределено);
		
	КонецЕсли;
	
	Если КомплектПечатныхФорм = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеализацияТоваровУслугЛокализация.СформироватьКомплектПечатныхФорм(МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	КомплектПечатныхФорм);
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"Накладная");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		СформироватьПечатнуюФормуНакладная(КомплектПечати.Объекты, ОбъектыПечати, Неопределено));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"НакладнаяБезСкидок");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		СформироватьПечатнуюФормуНакладная(КомплектПечати.Объекты, ОбъектыПечати, Новый Структура("ОтображатьСкидки", Ложь)));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"РасходнаяНакладная");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		СформироватьПечатнуюФормуРасходнаяНакладная(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"Акт");
	ПараметрыПечати.Удалить("ОтображатьСкидки");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьАктОбОказанииУслуг.СформироватьПечатнуюФормуАктОбОказанииУслуг(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"АктБезСкидок");
	ПараметрыПечати.Вставить("ОтображатьСкидки", Ложь);
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьАктОбОказанииУслуг.СформироватьПечатнуюФормуАктОбОказанииУслуг(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СчетНаОплату");
	ПараметрыПечати.Удалить("ОтображатьСкидки");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуСчетНаОплату(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СчетНаОплатуБезСкидок");
	ПараметрыПечати.Вставить("ОтображатьСкидки", Ложь);
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуСчетНаОплату(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СчетНаОплатуСФаксимиле");
	ПараметрыПечати.Удалить("ОтображатьСкидки");
	ПараметрыПечати.Вставить("ОтображатьФаксимиле", Истина);
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуСчетНаОплату(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СчетНаОплатуСФаксимилеБезСкидок");
	ПараметрыПечати.Вставить("ОтображатьСкидки", Ложь);
	ПараметрыПечати.Вставить("ОтображатьФаксимиле", Истина);
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуСчетНаОплату(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"InvoiceInt");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуInvoice(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"ProformaInvoice");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуProformaInvoice(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"ЗаданиеНаОтборРазмещениеТовара");
	
	ПараметрыПечати.Вставить("ТипЗадания", "ЗаданиеНаОтбор");
	
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьЗаданияНаОтборРазмещениеТоваров.СформироватьЗаданиеНаОтборРазмещениеТовара(СтруктураТипов,
		ОбъектыПечати,
		ПараметрыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СертификатыНоменклатурыРеестр");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Справочники.СертификатыНоменклатуры.СформироватьПечатнуюФормуРеестрСертификатовНоменклатуры(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СертификатыНоменклатурыИзображенияИзДокументов");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Справочники.СертификатыНоменклатуры.СформироватьПечатнуюФормуИзображенияСертификатовИзДокументов(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СертификатыНоменклатурыИзображенияИзДокументовБезДублей");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Справочники.СертификатыНоменклатуры.СформироватьПечатнуюФормуИзображенияСертификатовИзДокументовБезДублей(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;
	
	#Вставка 
	// для комплекта с настройкой
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"УпаковочныйЛистБеларусь");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		ПечатьУпаковочныйЛистБеларусь(КомплектПечати.Объекты, ОбъектыПечати),
		);
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"УпаковочныйЛистГрузия");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		ПечатьУпаковочныйЛистГрузия(КомплектПечати.Объекты, ОбъектыПечати),
		);
	КонецЦикла; 
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"УпаковочныйЛистКазахстан");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		ПечатьУпаковочныйЛистКазахстан(КомплектПечати.Объекты, ОбъектыПечати),
		);
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"ДекларацияБеларусь");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		ПечатьДекларацияБеларусь(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"ДекларацияАрмения");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		ПечатьДекларацияАрмения(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СпецификацияНаТовар");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		ПечатьСпецификацияНаТовар(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СоставТкани");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		ПечатьСоставТкани(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"ВесИСостав");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		ПечатьВесИСостав(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;
	
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"Спецификация");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		ПечатьСпецификация(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;
	
	#КонецВставки
	
	РегистрыСведений.НастройкиПечатиОбъектов.СформироватьКомплектВнешнихПечатныхФорм(
	"Документ.РеализацияТоваровУслуг",
	МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати);
	
	
КонецФункции

&ИзменениеИКонтроль("КомплектПечатныхФорм")
Функция КСП_КомплектПечатныхФорм()
	
	КомплектПечатныхФорм = РегистрыСведений.НастройкиПечатиОбъектов.ПодготовитьКомплектПечатныхФорм();
	
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "РасходнаяНакладная", НСтр("ru = 'Расходная накладная';
	|en = 'Sales invoice'"),                         0);
	
	Если ПолучитьФункциональнуюОпцию("ВыбиратьВариантВыводаСкидокПриПечатиДокументовПродажи") Тогда
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "Накладная", НСтр("ru = 'Реализация товаров (выводить скидки)';
		|en = 'Goods sales (display discounts)'"),             0);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "НакладнаяБезСкидок", НСтр("ru = 'Реализация товаров (не выводить скидки)';
		|en = 'Goods sales (do not display discounts)'"), 0);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "Акт", НСтр("ru = 'Акт об оказании услуг (выводить скидки)';
		|en = 'Certificate of rendered services (display discounts)'"),                2);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "АктБезСкидок", НСтр("ru = 'Акт об оказании услуг (не выводить скидки)';
		|en = 'Certificate of rendered services (do not display discounts)'"),    0);
	Иначе
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "Накладная", НСтр("ru = 'Реализация товаров';
		|en = 'Goods sales'"),                               0);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "Акт", НСтр("ru = 'Акт об оказании услуг';
		|en = 'Certificate of rendered services'"),                                  2);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("НеИспользоватьСчетаНаОплатуВыбиратьВариантВыводаСкидок") Тогда
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "СчетНаОплату", НСтр("ru = 'Счет на оплату (выводить скидки)';
		|en = 'Commercial invoice (display discounts)'"), 1);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "СчетНаОплатуБезСкидок", НСтр("ru = 'Счет на оплату (не выводить скидки)';
		|en = 'Commercial invoice (do not display discounts)'"), 0);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "СчетНаОплатуСФаксимиле", НСтр("ru = 'Счет на оплату с факсимиле (выводить скидки)';
		|en = 'Commercial invoice with facsimile (display discounts)'"), 0);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "СчетНаОплатуСФаксимилеБезСкидок", НСтр("ru = 'Счет на оплату с факсимиле (не выводить скидки)';
		|en = 'Commercial invoice with facsimile (do not display discounts)'"), 0);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("НеИспользоватьСчетаНаОплатуНеВыбиратьВариантВыводаСкидок") Тогда
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "СчетНаОплату", НСтр("ru = 'Счет на оплату';
		|en = 'Commercial invoice'"), 1);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "СчетНаОплатуСФаксимиле", НСтр("ru = 'Счет на оплату с факсимиле';
		|en = 'Commercial invoice with facsimile'"), 0);
	КонецЕсли;
	
	Если Константы.ИспользоватьМеждународныеПечатныеФормы.Получить() Тогда
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "InvoiceInt", НСтр("ru = 'Invoice';
		|en = 'Invoice'"), 2);
		Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСчетаНаОплатуКлиентам") Тогда
			РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "ProformaInvoice", НСтр("ru = 'Proforma invoice';
			|en = 'Proforma invoice'"), 1);
		КонецЕсли;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСертификатыНоменклатуры") Тогда
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
		"СертификатыНоменклатурыРеестр",
		НСтр("ru = 'Сертификаты (реестр)';
		|en = 'Certificates (registry)'"),
		0);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
		"СертификатыНоменклатурыИзображенияИзДокументов",
		НСтр("ru = 'Сертификаты (по каждой позиции документа)';
		|en = 'Certificates (by each document item)'"),
		0);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
		"СертификатыНоменклатурыИзображенияИзДокументовБезДублей",
		НСтр("ru = 'Сертификаты (по одному на сертификат)';
		|en = 'Certificates (one per certificate)'"),
		0);
	КонецЕсли;
	
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "ЗаданиеНаОтборРазмещениеТовара", НСтр("ru = 'Задание на отбор товаров';
	|en = 'Picking job'"),         0);
	
	#Вставка
	// для комплекта с настройкой
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
	"УпаковочныйЛистБеларусь", НСтр("ru = 'Упаковочный лист (Беларусь, Армения) КСП'"), 0);
	
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
	"УпаковочныйЛистКазахстан", НСтр("ru = 'Упаковочный лист (Казахстан) КСП'"), 0);
	
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
	"УпаковочныйЛистГрузия", НСтр("ru = 'Упаковочный лист (Грузия) КСП'"), 0);
	
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
	"ДекларацияБеларусь", НСтр("ru = 'Выписка из прайс-листа продукции КСП'"), 0);
	
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
	"ДекларацияАрмения", НСтр("ru = 'Декларация КСП'"), 0);
	
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
	"СпецификацияНаТовар", НСтр("ru = 'Спецификация на товар КСП'"), 0);
	
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
	"СоставТкани", НСтр("ru = 'Состав ткани КСП'"), 0);
	
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
	"ВесИСостав", НСтр("ru = 'Вес и состав КСП'"), 0);
	
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
	"Спецификация", НСтр("ru = 'Спецификация КСП'"), 0);
	#КонецВставки
	
	РеализацияТоваровУслугЛокализация.КомплектПечатныхФорм(КомплектПечатныхФорм);
	
	Возврат КомплектПечатныхФорм;
	
КонецФункции

// >  Кодерлайн 2024.07.16 УваровДС  