
&После("ДобавитьКомандыПечати")
Процедура КСП_ДобавитьКомандыПечати(КомандыПечати)
	
	// Печатные формы для Белорусии
	// УпаковочныйЛист (такой же для Армении)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Идентификатор = "УпаковочныйЛист";                     
	КомандаПечати.Представление = НСтр("ru = 'Упаковочный лист'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Декларация
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Идентификатор = "ДекларацияБеларусь";                     
	КомандаПечати.Представление = НСтр("ru = 'Выписка из прайс-листа продукции (Беларусь)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	///////////////////////////////////////////////////////////////////
	
	// Печатные формы для Армении
	// Декларация
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Идентификатор = "ДекларацияАрмения";                     
	КомандаПечати.Представление = НСтр("ru = 'Декларация (Армения)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	///////////////////////////////////////////////////////////////////
	
	// Печатные формы для Грузии
	// Спецификация на товар
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Идентификатор = "СпецификацияНаТовар";                     
	КомандаПечати.Представление = НСтр("ru = 'Спецификация на товар (Грузия)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;	
	
	// Состав ткани
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Идентификатор = "СоставТкани";                     
	КомандаПечати.Представление = НСтр("ru = 'Состав ткани (Грузия)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Вес и состав
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Идентификатор = "ВесИСостав";                     
	КомандаПечати.Представление = НСтр("ru = 'Вес и состав (Грузия)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

//ВЫБРАТЬ
//	Контрагенты.Ссылка КАК Ссылка,
//	Контрагенты.Наименование КАК Наименование,
//	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
//	Контрагенты.СтранаРегистрации КАК СтранаРегистрации,
//	Контрагенты.СтранаРегистрации.Наименование <> "РОССИЯ" КАК Нерезидент
//ИЗ
//	Справочник.Контрагенты КАК Контрагенты

&После("Печать")
Процедура КСП_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	// Печатные формы для Белорусии
	// УпаковочныйЛист (такой же для Армении)
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УпаковочныйЛист") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"УпаковочныйЛист",
		НСтр("ru = 'КСП ПФ MXL Упаковочный лист'"),
		ПечатьУпаковочныйЛист(МассивОбъектов, ОбъектыПечати), ,
		"Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_УпаковочныйЛист");
		
		ПараметрыВывода.ЗаголовокФормы = "Упаковочный лист " + Строка(МассивОбъектов[0].Ссылка);
		
	КонецЕсли;
	
	// Декларация
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДекларацияБеларусь") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ДекларацияБеларусь",
		НСтр("ru = 'КСП ПФ MXL Декларация беларусь'"),
		ПечатьДекларацияБеларусь(МассивОбъектов, ОбъектыПечати), ,
		"Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_ДекларацияБеларусь");
		
		ПараметрыВывода.ЗаголовокФормы = "Выписка из прайс-листа Беларусь " + Строка(МассивОбъектов[0].Ссылка);
		
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////
	
	// Печатные формы для Армении
	// Декларация
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДекларацияАрмения") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ДекларацияАрмения",
		НСтр("ru = 'КСП ПФ MXL Декларация Армения'"),
		ПечатьДекларацияАрмения(МассивОбъектов, ОбъектыПечати), ,
		"Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_ДекларацияАрмения");
		
		ПараметрыВывода.ЗаголовокФормы = "Декларация Армения " + Строка(МассивОбъектов[0].Ссылка);
		
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////
	
	// Печатные формы для Грузии
	// Спецификация на товар
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СпецификацияНаТовар") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"СпецификацияНаТовар",
		НСтр("ru = 'КСП ПФ MXL Спецификация на товар'"),
		ПечатьСпецификацияНаТовар(МассивОбъектов, ОбъектыПечати), ,
		"Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_СпецификацияНаТовар");
		
		ПараметрыВывода.ЗаголовокФормы = "Спецификация на товар " + Строка(МассивОбъектов[0].Ссылка);
		
	КонецЕсли;
	
	// Состав ткани
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СоставТкани") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"СоставТкани",
		НСтр("ru = 'КСП ПФ MXL Состав ткани'"),
		ПечатьСоставТкани(МассивОбъектов, ОбъектыПечати), ,
		"Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_СоставТкани");
		
		ПараметрыВывода.ЗаголовокФормы = "Состав ткани " + Строка(МассивОбъектов[0].Ссылка);
		
	КонецЕсли;
	
	// Вес и состав
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВесИСостав") Тогда	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ВесИСостав",
		НСтр("ru = 'КСП ПФ MXL Вес и состав'"),
		ПечатьВесИСостав(МассивОбъектов, ОбъектыПечати), ,
		"Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_ВесИСостав");
		
		ПараметрыВывода.ЗаголовокФормы = "Вес и состав " + Строка(МассивОбъектов[0].Ссылка);
		
	КонецЕсли;	
	
КонецПроцедуры


Функция ПечатьУпаковочныйЛист(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_УпаковочныйЛист";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_УпаковочныйЛист");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьЗаголовок.Параметры.Дата = Формат(МассивОбъектов[0].Дата, "ДФ='MMMM yyyy'");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	// добавить потом МАССУ (нетто, брутто)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.ВерсияДанных КАК ВерсияДанных,
	|	РеализацияТоваровУслуг.ПометкаУдаления КАК ПометкаУдаления,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Проведен КАК Проведен,
	|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	РеализацияТоваровУслуг.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	РеализацияТоваровУслуг.БанковскийСчетГрузоотправителя КАК БанковскийСчетГрузоотправителя,
	|	РеализацияТоваровУслуг.БанковскийСчетГрузополучателя КАК БанковскийСчетГрузополучателя,
	|	РеализацияТоваровУслуг.Валюта КАК Валюта,
	|	РеализацияТоваровУслуг.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	РеализацияТоваровУслуг.Грузоотправитель КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.Грузополучатель КАК Грузополучатель,
	|	РеализацияТоваровУслуг.УдалитьДатаРаспоряжения КАК УдалитьДатаРаспоряжения,
	|	РеализацияТоваровУслуг.ДоверенностьВыдана КАК ДоверенностьВыдана,
	|	РеализацияТоваровУслуг.ДоверенностьДата КАК ДоверенностьДата,
	|	РеализацияТоваровУслуг.ДоверенностьЛицо КАК ДоверенностьЛицо,
	|	РеализацияТоваровУслуг.ДоверенностьНомер КАК ДоверенностьНомер,
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК ЗаказКлиента,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Менеджер КАК Менеджер,
	|	РеализацияТоваровУслуг.НалогообложениеНДС КАК НалогообложениеНДС,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваровУслуг.Партнер КАК Партнер,
	|	РеализацияТоваровУслуг.Подразделение КАК Подразделение,
	|	РеализацияТоваровУслуг.Сделка КАК Сделка,
	|	РеализацияТоваровУслуг.СкидкиРассчитаны КАК СкидкиРассчитаны,
	|	РеализацияТоваровУслуг.Склад КАК Склад,
	|	РеализацияТоваровУслуг.Согласован КАК Согласован,
	|	РеализацияТоваровУслуг.Соглашение КАК Соглашение,
	|	РеализацияТоваровУслуг.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	РеализацияТоваровУслуг.Комментарий КАК Комментарий,
	|	РеализацияТоваровУслуг.ФормаОплаты КАК ФормаОплаты,
	|	РеализацияТоваровУслуг.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	РеализацияТоваровУслуг.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	РеализацияТоваровУслуг.Касса КАК Касса,
	|	РеализацияТоваровУслуг.Отпустил КАК Отпустил,
	|	РеализацияТоваровУслуг.ОтпустилДолжность КАК ОтпустилДолжность,
	|	РеализацияТоваровУслуг.РеализацияПоЗаказам КАК РеализацияПоЗаказам,
	|	РеализацияТоваровУслуг.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	РеализацияТоваровУслуг.КартаЛояльности КАК КартаЛояльности,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.Основание КАК Основание,
	|	РеализацияТоваровУслуг.Статус КАК Статус,
	|	РеализацияТоваровУслуг.Автор КАК Автор,
	|	РеализацияТоваровУслуг.СпособДоставки КАК СпособДоставки,
	|	РеализацияТоваровУслуг.ЗонаДоставки КАК ЗонаДоставки,
	|	РеализацияТоваровУслуг.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	РеализацияТоваровУслуг.ПеревозчикПартнер КАК ПеревозчикПартнер,
	|	РеализацияТоваровУслуг.ВремяДоставкиС КАК ВремяДоставкиС,
	|	РеализацияТоваровУслуг.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	РеализацияТоваровУслуг.АдресДоставкиПеревозчика КАК АдресДоставкиПеревозчика,
	|	РеализацияТоваровУслуг.АдресДоставкиПеревозчикаЗначенияПолей КАК АдресДоставкиПеревозчикаЗначенияПолей,
	|	РеализацияТоваровУслуг.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	РеализацияТоваровУслуг.КонтактноеЛицо КАК КонтактноеЛицо,
	|	РеализацияТоваровУслуг.Руководитель КАК Руководитель,
	|	РеализацияТоваровУслуг.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	РеализацияТоваровУслуг.ПорядокРасчетов КАК ПорядокРасчетов,
	|	РеализацияТоваровУслуг.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
	|	РеализацияТоваровУслуг.ДатаВозвратаМногооборотнойТары КАК ДатаВозвратаМногооборотнойТары,
	|	РеализацияТоваровУслуг.СостояниеЗаполненияМногооборотнойТары КАК СостояниеЗаполненияМногооборотнойТары,
	|	РеализацияТоваровУслуг.ВидыЗапасовУказаныВручную КАК ВидыЗапасовУказаныВручную,
	|	РеализацияТоваровУслуг.ТребуетсяЗалогЗаТару КАК ТребуетсяЗалогЗаТару,
	|	РеализацияТоваровУслуг.ОснованиеДата КАК ОснованиеДата,
	|	РеализацияТоваровУслуг.ОснованиеНомер КАК ОснованиеНомер,
	|	РеализацияТоваровУслуг.ДопоставкаПоРеализации КАК ДопоставкаПоРеализации,
	|	РеализацияТоваровУслуг.ДатаПереходаПраваСобственности КАК ДатаПереходаПраваСобственности,
	|	РеализацияТоваровУслуг.ВариантОформленияПродажи КАК ВариантОформленияПродажи,
	|	РеализацияТоваровУслуг.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	|	РеализацияТоваровУслуг.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	РеализацияТоваровУслуг.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	РеализацияТоваровУслуг.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	РеализацияТоваровУслуг.КурсЧислитель КАК КурсЧислитель,
	|	РеализацияТоваровУслуг.КурсЗнаменатель КАК КурсЗнаменатель,
	|	РеализацияТоваровУслуг.ЕстьМаркируемаяПродукцияГИСМ КАК ЕстьМаркируемаяПродукцияГИСМ,
	|	РеализацияТоваровУслуг.СуммаВзаиморасчетовПоТаре КАК СуммаВзаиморасчетовПоТаре,
	|	РеализацияТоваровУслуг.ОплатаВВалюте КАК ОплатаВВалюте,
	|	РеализацияТоваровУслуг.Курьер КАК Курьер,
	|	РеализацияТоваровУслуг.Сборщик КАК Сборщик,
	|	РеализацияТоваровУслуг.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	РеализацияТоваровУслуг.АдресДоставкиПеревозчикаЗначение КАК АдресДоставкиПеревозчикаЗначение,
	|	РеализацияТоваровУслуг.ВариантВыбытияМаркируемойПродукции КАК ВариантВыбытияМаркируемойПродукции,
	|	РеализацияТоваровУслуг.КлиентКонтрагент КАК КлиентКонтрагент,
	|	РеализацияТоваровУслуг.КлиентПартнер КАК КлиентПартнер,
	|	РеализацияТоваровУслуг.КлиентДоговор КАК КлиентДоговор,
	|	РеализацияТоваровУслуг.ЭтапГосконтрактаЕИС КАК ЭтапГосконтрактаЕИС,
	|	РеализацияТоваровУслуг.ОбъектРасчетовУпр КАК ОбъектРасчетовУпр,
	|	РеализацияТоваровУслуг.ГрафикОплаты КАК ГрафикОплаты,
	|	РеализацияТоваровУслуг.Представление КАК Представление,
	|	РеализацияТоваровУслуг.МоментВремени КАК МоментВремени
	|ПОМЕСТИТЬ втРеализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	|	втРеализация.Контрагент.Представление КАК КонтрагентПредставление,
	|	РеализацияТоваровУслугТовары.Номенклатура.Представление КАК НоменклатураПредставление,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|	РеализацияТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	РеализацияТоваровУслугТовары.Номенклатура.КодТНВЭД КАК НоменклатураКодТНВЭД,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Номенклатура.ВесЗнаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВесНеЗадан,
	|	РеализацияТоваровУслугТовары.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК УпаковкаНеЗадана
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	втРеализация КАК втРеализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО втРеализация.Ссылка = РеализацияТоваровУслугТовары.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				втР.Ссылка
	|			ИЗ
	|				втРеализация КАК втР)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Ссылка КАК Ссылка,
	|	втТовары.КонтрагентПредставление КАК КонтрагентПредставление,
	|	втТовары.НоменклатураПредставление КАК НоменклатураПредставление,
	|	втТовары.Количество КАК Количество,
	|	втТовары.Сумма КАК Сумма,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	втТовары.НоменклатураКодТНВЭД КАК НоменклатураКодТНВЭД,
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.ВесНеЗадан КАК ВесНеЗадан,
	|	втТовары.Упаковка КАК Упаковка,
	|	втТовары.УпаковкаНеЗадана КАК УпаковкаНеЗадана,
	|	ВЫБОР
	|		КОГДА втТовары.ВесНеЗадан = 1
	|			ТОГДА 0
	|		ИНАЧЕ втТовары.Количество * втТовары.Номенклатура.ВесЧислитель / втТовары.Номенклатура.ВесЗнаменатель
	|	КОНЕЦ КАК НоменклатураНетто,
	|	ВЫБОР
	|		КОГДА втТовары.УпаковкаНеЗадана = 1
	|			ТОГДА ВЫБОР
	|					КОГДА УпаковкиЕдиницыИзмерения.Вес <> 0
	|							И УпаковкиЕдиницыИзмерения.Знаменатель <> 0
	|						ТОГДА втТовары.Количество / (УпаковкиЕдиницыИзмерения.Числитель / УпаковкиЕдиницыИзмерения.Знаменатель) * УпаковкиЕдиницыИзмерения.Вес
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА УпаковкиЕдиницыИзмерения.Вес <> 0
	|						И УпаковкиЕдиницыИзмерения.Знаменатель <> 0
	|					ТОГДА втТовары.Количество / (УпаковкиЕдиницыИзмерения.Числитель / УпаковкиЕдиницыИзмерения.Знаменатель) * УпаковкиЕдиницыИзмерения.Вес
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК НоменклатураБрутто,
	|	УпаковкиЕдиницыИзмерения.Вес КАК УпаковкаВес,
	|	УпаковкиЕдиницыИзмерения.Числитель КАК УпаковкаКоличество,
	|	УпаковкиЕдиницыИзмерения.Знаменатель КАК УпаковкаЗнаменатель,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Ссылка, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НетУпаковок,
	|	втТовары.Номенклатура.ЕдиницаДляОтчетов КАК НоменклатураЕдиницаДляОтчетов,
	|	втТовары.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК НоменклатураКоэффициентЕдиницыДляОтчетов
	|ПОМЕСТИТЬ втПромежТовары
	|ИЗ
	|	втТовары КАК втТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|		ПО (втТовары.Номенклатура = УпаковкиЕдиницыИзмерения.Владелец
	|				И втТовары.Номенклатура.КоэффициентЕдиницыДляОтчетов = УпаковкиЕдиницыИзмерения.Числитель
	|				И втТовары.УпаковкаНеЗадана <> 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПромежТовары.Ссылка КАК Ссылка,
	|	втПромежТовары.КонтрагентПредставление КАК Контрагент,
	|	втПромежТовары.НоменклатураКодТНВЭД КАК ТНВЭД,
	|	втПромежТовары.НоменклатураПредставление КАК Номенклатура,
	|	втПромежТовары.Количество КАК Количество,
	|	втПромежТовары.Сумма КАК Сумма,
	|	втПромежТовары.НоменклатураНетто КАК НоменклатураНетто,
	|	втПромежТовары.НоменклатураБрутто КАК НоменклатураБрутто,
	|	ВЫБОР
	|		КОГДА втПромежТовары.УпаковкаНеЗадана = 1
	|				И втПромежТовары.НоменклатураКоэффициентЕдиницыДляОтчетов <> 0
	|				И втПромежТовары.НетУпаковок = 0
	|			ТОГДА втПромежТовары.Количество / втПромежТовары.НоменклатураКоэффициентЕдиницыДляОтчетов
	|		ИНАЧЕ ВЫБОР
	|				КОГДА втПромежТовары.КоличествоУпаковок <> втПромежТовары.Количество
	|					ТОГДА втПромежТовары.КоличествоУпаковок
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК ОбщееКоличествоУпаковок
	|ИЗ
	|	втПромежТовары КАК втПромежТовары
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(НоменклатураНетто),
	|	СУММА(НоменклатураБрутто),
	|	СУММА(ОбщееКоличествоУпаковок)
	|ПО
	|	Контрагент,
	|	ТНВЭД,
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0].Ссылка); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКонтрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаКонтрагент.Следующий() Тогда
		
		// добавить потом массу
		ОбластьОбщее = Макет.ПолучитьОбласть("ОбластьОбщее");
		ОбластьОбщее.Параметры.ОбщееКоличествоКоробок = Окр(ВыборкаКонтрагент.ОбщееКоличествоУпаковок + 0.5, 0, 0);
		ОбластьОбщее.Параметры.ОбщийВесБрутто = ВыборкаКонтрагент.НоменклатураБрутто;
		ОбластьОбщее.Параметры.ОбщийВесНетто = ВыборкаКонтрагент.НоменклатураНетто;
		ОбластьОбщее.Параметры.РазницаБруттоНетто = ВыборкаКонтрагент.НоменклатураБрутто - ВыборкаКонтрагент.НоменклатураНетто;
		ТабличныйДокумент.Вывести(ОбластьОбщее);
		
		ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОбластьСтрокаКонтрагент = Макет.ПолучитьОбласть("ОбластьСтрокаКонтрагент");
		ОбластьСтрокаКонтрагент.Параметры.КонтрагентГруппировка = ВыборкаКонтрагент.Контрагент;
		ОбластьСтрокаКонтрагент.Параметры.КонтрагентГруппировкаКоличествоИтог = ВыборкаКонтрагент.Количество;
		ОбластьСтрокаКонтрагент.Параметры.КонтрагентГруппировкаСуммаИтог = ВыборкаКонтрагент.Сумма;
		ОбластьСтрокаКонтрагент.Параметры.КонтрагентГруппировкаНетто = ВыборкаКонтрагент.НоменклатураНетто;
		ОбластьСтрокаКонтрагент.Параметры.КонтрагентГруппировкаБрутто = ВыборкаКонтрагент.НоменклатураБрутто;
		
		ТабличныйДокумент.Вывести(ОбластьСтрокаКонтрагент);
		
		ВыборкаТНВЭД = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаТНВЭД.Следующий() Цикл
			
			ОбластьСтрокаТНВЭД = Макет.ПолучитьОбласть("ОбластьСтрокаТНВЭД");
			ОбластьСтрокаТНВЭД.Параметры.ТНВЭДГруппировка = ВыборкаТНВЭД.ТНВЭД;
			ОбластьСтрокаТНВЭД.Параметры.ТНВЭДГруппировкаКоличествоИтог = ВыборкаТНВЭД.Количество;
			ОбластьСтрокаТНВЭД.Параметры.ТНВЭДГруппировкаСуммаИтог = ВыборкаТНВЭД.Сумма;
			ОбластьСтрокаТНВЭД.Параметры.ТНВЭДГруппировкаНеттоИтог = ВыборкаТНВЭД.НоменклатураНетто;
			ОбластьСтрокаТНВЭД.Параметры.ТНВЭДГруппировкаБруттоИтог = ВыборкаТНВЭД.НоменклатураБрутто;
			ТабличныйДокумент.Вывести(ОбластьСтрокаТНВЭД);
			
			ВыборкаНоменклатура = ВыборкаТНВЭД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаНоменклатура.Следующий() Цикл
				
				ОбластьСтрокаНоменклатура = Макет.ПолучитьОбласть("ОбластьСтрокаНоменклатура");		
				ОбластьСтрокаНоменклатура.Параметры.НоменклатураНаименование = ВыборкаНоменклатура.Номенклатура; 
				ОбластьСтрокаНоменклатура.Параметры.НоменклатураКоличество = ВыборкаНоменклатура.Количество;
				ОбластьСтрокаНоменклатура.Параметры.НоменклатураСумма = ВыборкаНоменклатура.Сумма;
				ОбластьСтрокаНоменклатура.Параметры.НоменклатураНетто = ВыборкаНоменклатура.НоменклатураНетто;
				ОбластьСтрокаНоменклатура.Параметры.НоменклатураБрутто = ВыборкаНоменклатура.НоменклатураБрутто;
				ТабличныйДокумент.Вывести(ОбластьСтрокаНоменклатура);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьДекларацияБеларусь(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ДекларацияБеларусь";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_ДекларацияБеларусь");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.НаименованиеПолное КАК НаименованиеПолное,
	|	Организации.КПП КАК КПП,
	|	Организации.ИНН КАК ИНН,
	|	Организации.ОГРН КАК ОГРН,
	|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	БанковскиеСчетаОрганизаций.НомерСчета КАК НомерСчета,
	|	БанковскиеСчетаОрганизаций.КоррСчетБанка КАК КоррСчетБанка,
	|	БанковскиеСчетаОрганизаций.Банк КАК Банк,
	|	БанковскиеСчетаОрганизаций.БИКБанка КАК БИКБанка,
	|	БанковскиеСчетаОрганизаций.Ссылка КАК СчетСсылка
	|ПОМЕСТИТЬ втОргИБанкЭлис
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ПО (Организации.Ссылка = БанковскиеСчетаОрганизаций.Владелец)
	|ГДЕ
	|	Организации.ИНН = &ИННЭлис
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.Тип КАК Тип,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
	|	ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втКонт
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОргИБанкЭлис.Ссылка КАК Ссылка,
	|	втОргИБанкЭлис.НаименованиеПолное КАК ПолноеЮрНаименование,
	|	втОргИБанкЭлис.КПП КАК КПП,
	|	втОргИБанкЭлис.ИНН КАК ИНН,
	|	втОргИБанкЭлис.ОГРН КАК ОГРН,
	|	втОргИБанкЭлис.НаименованиеСокращенное КАК СокрЮрНаименование,
	|	втОргИБанкЭлис.СчетСсылка КАК СчетСсылка,
	|	втОргИБанкЭлис.СчетСсылка.Представление КАК СчетПредставление,
	|	втОргИБанкЭлис.НомерСчета КАК РасчСчет,
	|	втОргИБанкЭлис.КоррСчетБанка КАК КоррСчет,
	|	втОргИБанкЭлис.Банк.Наименование КАК НаименованиеБанка,
	|	втОргИБанкЭлис.БИКБанка КАК БИК,
	|	Адрес.Представление КАК Адрес,
	|	ВебСтраница.Представление КАК ВебСтраница,
	|	Телефон.Представление КАК Телефон,
	|	Факс.Представление КАК Факс,
	|	ЭлПочта.Представление КАК ЭлПочта
	|ПОМЕСТИТЬ втШапка
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Телефон
	|		ПО втОргИБанкЭлис.Ссылка = Телефон.Ссылка
	|			И (Телефон.Тип = &Телефон)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Адрес
	|		ПО втОргИБанкЭлис.Ссылка = Адрес.Ссылка
	|			И (Адрес.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Факс
	|		ПО втОргИБанкЭлис.Ссылка = Факс.Ссылка
	|			И (Факс.Тип = &Факс)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ВебСтраница
	|		ПО втОргИБанкЭлис.Ссылка = ВебСтраница.Ссылка
	|			И (ВебСтраница.Тип = &ВебСтраница)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ЭлПочта
	|		ПО втОргИБанкЭлис.Ссылка = ЭлПочта.Ссылка
	|			И (ЭлПочта.Тип = &ЭлПочта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииПрисоединенныеФайлы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втЛоготипОрганизации
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОрганизацииПрисоединенныеФайлы КАК ОрганизацииПрисоединенныеФайлы
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииПрисоединенныеФайлы.ВладелецФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Дата КАК Дата
	|ПОМЕСТИТЬ втРеализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &РеализацияСсылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.Ссылка
	|			ИЗ
	|				втРеализация КАК Т)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерСтр,
	|	ЦеныНоменклатуры25СрезПоследних.Номенклатура.Представление КАК Наименование,
	|	ЦеныНоменклатуры25СрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ втЦены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
	|			&Дата,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						втТовары.Номенклатура
	|					ИЗ
	|						втТовары КАК втТовары)
	|				И ВидЦены = &ВидЦены) КАК ЦеныНоменклатуры25СрезПоследних";
	
	Запрос.УстановитьПараметр("РеализацияСсылка", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("ИННЭлис", "6152001000");
	Запрос.УстановитьПараметр("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Факс", Перечисления.ТипыКонтактнойИнформации.Факс);
	Запрос.УстановитьПараметр("ВебСтраница", Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	Запрос.УстановитьПараметр("ЭлПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Цена розницы Основная"));
	Запрос.УстановитьПараметр("Дата", КонецМесяца(МассивОбъектов[0].Дата));
	
	РезультатыЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();	
	
	ФайлХранилищеЛого = Неопределено; 
	
	Шапка = РезультатыЗапросов[2].Выбрать();
	Если РезультатыЗапросов[3].Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Логотип организации не установлен!";
		Сообщение.Сообщить();                                 
	Иначе
		ЛоготипВыборка = РезультатыЗапросов[3].Выбрать();
		Если ЛоготипВыборка.Следующий() Тогда
			ФайлХранилищеЛого = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(ЛоготипВыборка.Ссылка), Ложь);	
		КонецЕсли;	
	КонецЕсли;
	
	Пока Шапка.Следующий() Цикл
		
		//Начало вывода документа
		// склонение банка
		ФорматнаяСтрока = "ПД=Предложный";
		РезультатСколнения = ПолучитьСклоненияСтроки(Шапка.НаименованиеБанка, ,ФорматнаяСтрока);
		
		ОбластьШапка.Параметры.Заполнить(Шапка);
		ОбластьШапка.Параметры.Логотип = ФайлХранилищеЛого;
		
		ОбластьШапка.Параметры.НаименованиеБанка = РезультатСколнения[0];
		ОбластьШапка2.Параметры.Заполнить(Шапка);
		ОбластьШапка2.Параметры.Дата = Формат(КонецДня(МассивОбъектов[0].Дата), "ДФ=dd.MM.yyyy");
		
		//Конец вывода документа
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьШапка2);
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ЦеныВыборка = РезультатыЗапросов[6].Выбрать();
	
	Пока ЦеныВыборка.Следующий() Цикл
		
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьСтрокаТаблицы.Параметры.Заполнить(ЦеныВыборка);
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатьДекларацияАрмения(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ДекларацияАрмения";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_ДекларацияАрмения");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьРеквизиты = Макет.ПолучитьОбласть("Реквизиты");
	
	ОбластьНаименование = Макет.ПолучитьОбласть("Наименование");
	
	ОбластьФутер = Макет.ПолучитьОбласть("Футер");
	
	// Получаем запросом необходимые данные.
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.НаименованиеПолное КАК НаименованиеПолное,
	|	Организации.КПП КАК КПП,
	|	Организации.ИНН КАК ИНН,
	|	Организации.ОГРН КАК ОГРН,
	|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	БанковскиеСчетаОрганизаций.НомерСчета КАК НомерСчета,
	|	БанковскиеСчетаОрганизаций.КоррСчетБанка КАК КоррСчетБанка,
	|	БанковскиеСчетаОрганизаций.Банк КАК Банк,
	|	БанковскиеСчетаОрганизаций.БИКБанка КАК БИКБанка,
	|	БанковскиеСчетаОрганизаций.Ссылка КАК СчетСсылка
	|ПОМЕСТИТЬ втОргИБанкЭлис
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ПО (Организации.Ссылка = БанковскиеСчетаОрганизаций.Владелец)
	|ГДЕ
	|	Организации.ИНН = &ИННЭлис
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.Тип КАК Тип,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
	|	ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втКонт
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОргИБанкЭлис.Ссылка КАК Ссылка,
	|	втОргИБанкЭлис.НаименованиеПолное КАК ПолноеЮрНаименование,
	|	втОргИБанкЭлис.КПП КАК КПП,
	|	втОргИБанкЭлис.ИНН КАК ИНН,
	|	втОргИБанкЭлис.ОГРН КАК ОГРН,
	|	втОргИБанкЭлис.НаименованиеСокращенное КАК СокрЮрНаименование,
	|	втОргИБанкЭлис.СчетСсылка КАК СчетСсылка,
	|	втОргИБанкЭлис.СчетСсылка.Представление КАК СчетПредставление,
	|	втОргИБанкЭлис.НомерСчета КАК РасчСчет,
	|	втОргИБанкЭлис.КоррСчетБанка КАК КоррСчет,
	|	втОргИБанкЭлис.Банк.Наименование КАК НаименованиеБанка,
	|	втОргИБанкЭлис.БИКБанка КАК БИК,
	|	Адрес.Представление КАК Адрес,
	|	ВебСтраница.Представление КАК ВебСтраница,
	|	Телефон.Представление КАК Телефон,
	|	Факс.Представление КАК Факс,
	|	ЭлПочта.Представление КАК ЭлПочта
	|ПОМЕСТИТЬ втШапка
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Телефон
	|		ПО втОргИБанкЭлис.Ссылка = Телефон.Ссылка
	|			И (Телефон.Тип = &Телефон)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Адрес
	|		ПО втОргИБанкЭлис.Ссылка = Адрес.Ссылка
	|			И (Адрес.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК Факс
	|		ПО втОргИБанкЭлис.Ссылка = Факс.Ссылка
	|			И (Факс.Тип = &Факс)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ВебСтраница
	|		ПО втОргИБанкЭлис.Ссылка = ВебСтраница.Ссылка
	|			И (ВебСтраница.Тип = &ВебСтраница)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКонт КАК ЭлПочта
	|		ПО втОргИБанкЭлис.Ссылка = ЭлПочта.Ссылка
	|			И (ЭлПочта.Тип = &ЭлПочта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииПрисоединенныеФайлы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втЛоготипОрганизации
	|ИЗ
	|	втОргИБанкЭлис КАК втОргИБанкЭлис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОрганизацииПрисоединенныеФайлы КАК ОрганизацииПрисоединенныеФайлы
	|		ПО втОргИБанкЭлис.Ссылка = ОрганизацииПрисоединенныеФайлы.ВладелецФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.КСП_ТаможенныйОрган КАК ТаможенныйОрган,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Организация КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.Контрагент КАК Получатель,
	|	РеализацияТоваровУслуг.Организация.Представление КАК ГрузоотправительНаименование,
	|	РеализацияТоваровУслуг.Организация.ИНН КАК ГрузоотправительИНН,
	|	РеализацияТоваровУслуг.Организация.КПП КАК ГрузоотправительКПП,
	|	РеализацияТоваровУслуг.Организация.ОГРН КАК ГрузоотправительОГРН,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК ГрузоотправительАдреc,
	|	РеализацияТоваровУслуг.Контрагент.Представление КАК ПолучательНаименование,
	|	РеализацияТоваровУслуг.Контрагент.ИНН КАК ПолучательИНН,
	|	РеализацияТоваровУслуг.Контрагент.КПП КАК ПолучательКПП,
	|	РеализацияТоваровУслуг.Контрагент.РегистрационныйНомер КАК ПолучательОГРН,
	|	КонтрагентыКонтактнаяИнформация.Представление КАК ПолучательАдрес
	|ПОМЕСТИТЬ втРеализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО РеализацияТоваровУслуг.Организация = ОрганизацииКонтактнаяИнформация.Ссылка
	|			И (ОрганизацииКонтактнаяИнформация.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ПО РеализацияТоваровУслуг.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка
	|			И (КонтрагентыКонтактнаяИнформация.Тип = &Адрес)
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданный.ДокументОснование КАК ДокументОснование,
	|	СчетФактураВыданный.Ссылка КАК Ссылка,
	|	СчетФактураВыданный.Номер КАК НомерСФ,
	|	СчетФактураВыданный.Дата КАК ДатаСФ
	|ПОМЕСТИТЬ втСчетаФактуры
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.ДокументОснование = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Кол
	|ПОМЕСТИТЬ втВыводСтрокиВидНоменклатуры
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Номенклатура.ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРеализация.Грузоотправитель.СтранаПостоянногоМестонахождения.Представление КАК СтранаПроисхождения,
	|	втРеализация.Ссылка.Склад.ТекущийОтветственный.Фамилия + "" "" + втРеализация.Ссылка.Склад.ТекущийОтветственный.Инициалы КАК Сотрудник,
	|	втРеализация.Ссылка.Склад.ТекущаяДолжностьОтветственного КАК Должность,
	|	втРеализация.Дата КАК Дата
	|ПОМЕСТИТЬ втДопДанные
	|ИЗ
	|	втРеализация КАК втРеализация";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("ИННЭлис", "6152001000");
	Запрос.УстановитьПараметр("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Факс", Перечисления.ТипыКонтактнойИнформации.Факс);
	Запрос.УстановитьПараметр("ВебСтраница", Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	Запрос.УстановитьПараметр("ЭлПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	РезультатыЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ДопДанныеТЗ = РезультатыЗапросов[7].Выгрузить();
	
	Для Каждого СтрокаТЗ ИЗ ДопДанныеТЗ Цикл	 
		ОбластьФутер.Параметры.СтранаПроисхождения = СтрокаТЗ.СтранаПроисхождения;	
		Прервать;
	КонецЦикла;
	
	ФайлХранилищеЛого = Неопределено; 
	
	Шапка = РезультатыЗапросов[2].Выбрать();
	Если РезультатыЗапросов[3].Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Логотип организации не установлен!";
		Сообщение.Сообщить();                                 
	Иначе
		ЛоготипВыборка = РезультатыЗапросов[3].Выбрать();
		Если ЛоготипВыборка.Следующий() Тогда
			ФайлХранилищеЛого = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(ЛоготипВыборка.Ссылка), Ложь);	
		КонецЕсли;	
	КонецЕсли;
	
	Пока Шапка.Следующий() Цикл
		
		//Начало вывода документа
		// склонение банка
		ФорматнаяСтрока = "ПД=Предложный";
		РезультатСколнения = ПолучитьСклоненияСтроки(Шапка.НаименованиеБанка, ,ФорматнаяСтрока);
		
		ОбластьШапка.Параметры.Заполнить(Шапка);
		ОбластьШапка.Параметры.Логотип = ФайлХранилищеЛого;
		
		ОбластьШапка.Параметры.НаименованиеБанка = РезультатСколнения[0];
		ОбластьШапка2.Параметры.Заполнить(Шапка);
		
		ОбластьРеквизиты.Параметры.Заполнить(Шапка);
		//Конец вывода документа
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьШапка2);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	РеквизитыВыборка = РезультатыЗапросов[4].Выбрать();
	
	Пока РеквизитыВыборка.Следующий() Цикл
		
		ОбластьРеквизиты.Параметры.Заполнить(РеквизитыВыборка);	
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьРеквизиты);
	
	СтрокаСФВыборка = РезультатыЗапросов[5].Выбрать();
	
	Пока СтрокаСФВыборка.Следующий() Цикл
		
		ОбластьСтрокаСФ = Макет.ПолучитьОбласть("ОбластьСтрокаСФ");
		ОбластьСтрокаСФ.Параметры.НомерСФ = СтрокаСФВыборка.НомерСФ;
		ОбластьСтрокаСФ.Параметры.ДатаСФ = Формат(СтрокаСФВыборка.ДатаСФ, "ДФ=dd.MM.yyyy");
		ТабличныйДокумент.Вывести(ОбластьСтрокаСФ);
		
	КонецЦикла;
	
	
	ТабличныйДокумент.Вывести(ОбластьНаименование);
	
	СтрокаВидВыборка = РезультатыЗапросов[6].Выбрать();
	
	Пока СтрокаВидВыборка.Следующий() Цикл
		
		ОбластьСтрокаНаименование = Макет.ПолучитьОбласть("СтрокаНаименование");
		ОбластьСтрокаНаименование.Параметры.Заполнить(СтрокаВидВыборка);	
		ТабличныйДокумент.Вывести(ОбластьСтрокаНаименование);
		
	КонецЦикла;
	
	ДопДанные = РезультатыЗапросов[7].Выбрать();
	
	Пока ДопДанные.Следующий() Цикл
		
		ОбластьФутер.Параметры.Заполнить(ДопДанные);		
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьФутер);	
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

Функция ПечатьСпецификацияНаТовар(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_СпецификацияНаТовар";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_СпецификацияНаТовар");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Организация КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.Контрагент КАК Получатель,
	|	РеализацияТоваровУслуг.Организация.НаименованиеПолное КАК ПолноеЮрНаименование,
	|	РеализацияТоваровУслуг.Организация.ИНН КАК ИНН,
	|	РеализацияТоваровУслуг.Организация.КПП КАК КПП,
	|	РеализацияТоваровУслуг.Организация.ОГРН КАК ОГРН,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Адреc,
	|	ОрганизацииКонтактнаяИнформация2.Представление КАК Телефон,
	|	РеализацияТоваровУслуг.Контрагент.НаименованиеПолное КАК ПолноеЮрНаименованиеПокупатель,
	|	РеализацияТоваровУслуг.Контрагент.ИНН КАК ИННПокупатель,
	|	РеализацияТоваровУслуг.Контрагент.КПП КАК КПППокупатель,
	|	РеализацияТоваровУслуг.Контрагент.РегистрационныйНомер КАК ОГРНПокупатель,
	|	КонтрагентыКонтактнаяИнформация.Представление КАК АдресПокупатель,
	|	КонтрагентыКонтактнаяИнформация2.Представление КАК ТелефонПокупатель
	|ПОМЕСТИТЬ втРеализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО (РеализацияТоваровУслуг.Организация = ОрганизацииКонтактнаяИнформация.Ссылка)
	|			И (ОрганизацииКонтактнаяИнформация.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация2
	|		ПО (РеализацияТоваровУслуг.Организация = ОрганизацииКонтактнаяИнформация2.Ссылка)
	|			И (ОрганизацииКонтактнаяИнформация2.Тип = &Телефон)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ПО (РеализацияТоваровУслуг.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка)
	|			И (КонтрагентыКонтактнаяИнформация.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация2
	|		ПО (РеализацияТоваровУслуг.Контрагент = КонтрагентыКонтактнаяИнформация2.Ссылка)
	|			И (КонтрагентыКонтактнаяИнформация2.Тип = &Телефон)
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРеализация.Ссылка КАК Ссылка,
	|	втРеализация.Дата КАК Дата,
	|	втРеализация.Грузоотправитель КАК Грузоотправитель,
	|	втРеализация.Получатель КАК Получатель,
	|	втРеализация.ПолноеЮрНаименование КАК ПолноеЮрНаименование,
	|	втРеализация.ИНН КАК ИНН,
	|	втРеализация.КПП КАК КПП,
	|	втРеализация.ОГРН КАК ОГРН,
	|	втРеализация.Адреc КАК Адреc,
	|	втРеализация.Телефон КАК Телефон,
	|	втРеализация.ПолноеЮрНаименованиеПокупатель КАК ПолноеЮрНаименованиеПокупатель,
	|	втРеализация.ИННПокупатель КАК ИННПокупатель,
	|	втРеализация.КПППокупатель КАК КПППокупатель,
	|	втРеализация.ОГРНПокупатель КАК ОГРНПокупатель,
	|	втРеализация.АдресПокупатель КАК АдресПокупатель,
	|	втРеализация.ТелефонПокупатель КАК ТелефонПокупатель,
	|	БанковскиеСчетаОрганизаций.БИКБанка КАК БИК,
	|	БанковскиеСчетаОрганизаций.НаименованиеБанка КАК НаименованиеБанка,
	|	БанковскиеСчетаОрганизаций.НомерСчета КАК РасчСчет,
	|	БанковскиеСчетаОрганизаций.КоррСчетБанка КАК КоррСчет,
	|	БанковскиеСчетаКонтрагентов.БИКБанка КАК БИКПокупатель,
	|	БанковскиеСчетаКонтрагентов.НаименованиеБанка КАК НаименованиеБанкаПокупатель,
	|	БанковскиеСчетаКонтрагентов.НомерСчета КАК РасчСчетПокупатель,
	|	БанковскиеСчетаКонтрагентов.КоррСчетБанка КАК КоррСчетПокупатель
	|ПОМЕСТИТЬ втРеализацияРеквизиты
	|ИЗ
	|	втРеализация КАК втРеализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
	|		ПО втРеализация.Получатель = БанковскиеСчетаКонтрагентов.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ПО втРеализация.Грузоотправитель = БанковскиеСчетаОрганизаций.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура.Представление КАК Наименование,
	|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|	РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения.Представление КАК ЕдИзмерения
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Наименование КАК Наименование,
	|	втТовары.ЕдИзмерения КАК ЕдИзмерения,
	|	СУММА(втТовары.Количество) КАК Количество,
	|	СРЕДНЕЕ(втТовары.Цена) КАК Цена,
	|	СУММА(втТовары.Сумма) КАК Сумма
	|ПОМЕСТИТЬ втТоварыГруп
	|ИЗ
	|	втТовары КАК втТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Наименование,
	|	втТовары.ЕдИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Рук.ФизическоеЛицо.Фамилия + "" "" + Рук.ФизическоеЛицо.Инициалы КАК Руководитель,
	|	Бух.ФизическоеЛицо.Фамилия + "" "" + Бух.ФизическоеЛицо.Инициалы КАК ГлавБух
	|ИЗ
	|	втРеализация КАК втРеализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛицаОрганизаций КАК Бух
	|		ПО (втРеализация.Грузоотправитель = Бух.Владелец)
	|			И (Бух.Должность = ""Главный бухгалтер"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛицаОрганизаций КАК Рук
	|		ПО (втРеализация.Грузоотправитель = Рук.Владелец)
	|			И (Рук.Должность = ""Руководитель"")
	|		;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРеализация.Ссылка.Номер КАК НомерСпецификации,
	|	втРеализация.Ссылка.Дата КАК ДатаСпецификации,
	|	втРеализация.Ссылка.Договор.Представление КАК ДоговорСпецификации,
	|	втРеализация.Ссылка.Договор.Дата КАК ДатаДоговораСпецификации
	|ПОМЕСТИТЬ втЗаголовок
	|ИЗ
	|	втРеализация КАК втРеализация";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	РезультатыЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ВыборкаЗаголовок = РезультатыЗапросов[5].Выбрать();
	Если ВыборкаЗаголовок.Следующий() Тогда
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаЗаголовок);
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	
	ОбластьРеквизиты = Макет.ПолучитьОбласть("Реквизиты");
	ВыборкаРеквизиты = РезультатыЗапросов[1].Выбрать();
	Если ВыборкаРеквизиты.Следующий() Тогда
		ОбластьРеквизиты.Параметры.Заполнить(ВыборкаРеквизиты);
		ФорматнаяСтрока = "ПД=Предложный";
		РезультатСколнения1 = ПолучитьСклоненияСтроки(ВыборкаРеквизиты.НаименованиеБанка, ,ФорматнаяСтрока);
		РезультатСколнения2 = ПолучитьСклоненияСтроки(ВыборкаРеквизиты.НаименованиеБанкаПокупатель, ,ФорматнаяСтрока);
		ОбластьРеквизиты.Параметры.НаименованиеБанка = ?(РезультатСколнения1.Количество() <> 0, РезультатСколнения1[0], ВыборкаРеквизиты.НаименованиеБанка);
		ОбластьРеквизиты.Параметры.НаименованиеБанкаПокупатель = ?(РезультатСколнения2.Количество() <> 0, РезультатСколнения2[0], ВыборкаРеквизиты.НаименованиеБанкаПокупатель);
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьРеквизиты);
	
	
	ВыборкаТовары = РезультатыЗапросов[2].Выбрать();
	СуммаВсего = 0;
	Пока ВыборкаТовары.Следующий() Цикл
		
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");		
		ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаТовары);
		СуммаВсего = СуммаВсего + ВыборкаТовары.Сумма;
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
		
	КонецЦикла;
	
	ОбластьИтогиТаблицы = Макет.ПолучитьОбласть("ИтогиТаблицы");
	ОбластьИтогиТаблицы.Параметры.СуммаВсего = СуммаВсего;
	ТабличныйДокумент.Вывести(ОбластьИтогиТаблицы);
	
	
	ОбластьРукБух = Макет.ПолучитьОбласть("РукБух");
	ВыборкаРукБух = РезультатыЗапросов[4].Выбрать();
	Если ВыборкаРукБух.Следующий() Тогда
		ОбластьРукБух.Параметры.Заполнить(ВыборкаРукБух);	
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьРукБух);
	
	Возврат ТабличныйДокумент;			
	
КонецФункции

Функция ПечатьВесИСостав(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ВесИСостав";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_ВесИСостав");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|		РеализацияТоваровУслуг.Ссылка КАК Ссылка
	|	ПОМЕСТИТЬ втРеализация
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|	ГДЕ
	|		РеализацияТоваровУслуг.Ссылка = &Ссылка
	|	
	|	ИНДЕКСИРОВАТЬ ПО
	|		Ссылка
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		РеализацияТоваровУслугТовары.Номенклатура.Представление КАК Наименование,
	|		РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	|		РеализацияТоваровУслугТовары.Количество КАК Количество,
	|		РеализацияТоваровУслугТовары.Цена КАК Цена,
	|		РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|		РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения.Представление КАК ЕдИзмерения,
	|		РеализацияТоваровУслугТовары.Упаковка КАК Упаковка,
	|		РеализацияТоваровУслугТовары.Номенклатура.ВесЧислитель КАК ВесЧ,
	|		РеализацияТоваровУслугТовары.Номенклатура.ВесЗнаменатель КАК ВесЗ,
	|		РеализацияТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|		РеализацияТоваровУслугТовары.Упаковка.Числитель КАК УпаковкаЧислитель,
	|		РеализацияТоваровУслугТовары.Упаковка.Знаменатель КАК УпаковкаЗнаменатель,
	|		ВЫБОР
	|			КОГДА РеализацияТоваровУслугТовары.Номенклатура.ВесЧислитель = 0
	|				ТОГДА РеализацияТоваровУслугТовары.Количество * 0
	|			ИНАЧЕ РеализацияТоваровУслугТовары.Количество * (РеализацияТоваровУслугТовары.Номенклатура.ВесЧислитель / РеализацияТоваровУслугТовары.Номенклатура.ВесЗнаменатель)
	|		КОНЕЦ КАК ВесНетто,
	|		ВЫБОР
	|			КОГДА РеализацияТоваровУслугТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				ТОГДА РеализацияТоваровУслугТовары.Количество / (УпаковкиЕдиницыИзмерения.Числитель / ВЫБОР
	|						КОГДА УпаковкиЕдиницыИзмерения.Знаменатель = 0
	|							ТОГДА 1
	|						ИНАЧЕ УпаковкиЕдиницыИзмерения.Знаменатель
	|					КОНЕЦ) * УпаковкиЕдиницыИзмерения.Вес
	|			ИНАЧЕ РеализацияТоваровУслугТовары.Количество / (УпаковкиЕдиницыИзмерения.Числитель / ВЫБОР
	|					КОГДА УпаковкиЕдиницыИзмерения.Знаменатель = 0
	|						ТОГДА 1
	|					ИНАЧЕ УпаковкиЕдиницыИзмерения.Знаменатель
	|				КОНЕЦ) * УпаковкиЕдиницыИзмерения.Вес
	|		КОНЕЦ КАК ВесБрутто,
	|		УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
	|		УпаковкиЕдиницыИзмерения.Знаменатель КАК Знаменатель,
	|		УпаковкиЕдиницыИзмерения.Вес КАК Вес,
	|		УпаковкиЕдиницыИзмерения.Ссылка КАК УпаковкаЕД
	|	ПОМЕСТИТЬ втТовары
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|			ПО РеализацияТоваровУслугТовары.Номенклатура = УпаковкиЕдиницыИзмерения.Владелец
	|				И РеализацияТоваровУслугТовары.Номенклатура.КоэффициентЕдиницыДляОтчетов = УпаковкиЕдиницыИзмерения.Числитель
	|	ГДЕ
	|		РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ
	|		втТовары.Наименование КАК Наименование,
	|		втТовары.ЕдИзмерения КАК ЕдИзмерения,
	|		втТовары.Количество КАК Количество,
	|		втТовары.Цена КАК Цена,
	|		втТовары.Сумма КАК Сумма,
	|		втТовары.ВесНетто КАК ВесНетто,
	|		втТовары.ВесБрутто КАК ВесБрутто, 
	|		втТовары.Характеристика КАК Характеристика,
	|		втТовары.УпаковкаЕД КАК УпаковкаЕД
	|	ИЗ
	|		втТовары КАК втТовары
	|	ИТОГИ
	|		СУММА(Сумма),
	|		СУММА(ВесНетто),
	|		СУММА(ВесБрутто)
	|	ПО
	|		ОБЩИЕ";
	
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0]);	
	
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ВыборкаОбщая.Следующий() Тогда
		
		СуммаИтого = ВыборкаОбщая.Сумма;
		ВесНеттоИтого = ВыборкаОбщая.ВесНетто;
		ВесБруттоИтого = ВыборкаОбщая.ВесБрутто;
		
		Выборка = ВыборкаОбщая.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
			ОбластьСтрокаТаблицы.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
		КонецЦикла;
		
		ОбластьИтогиТаблицы = Макет.ПолучитьОбласть("ИтогиТаблицы");
		ОбластьИтогиТаблицы.Параметры.СуммаИтого = Формат(СуммаИтого, "ЧДЦ=2; ЧГ=0");
		ОбластьИтогиТаблицы.Параметры.ВесНеттоИтого = Формат(ВесНеттоИтого, "ЧДЦ=2; ЧГ=0");
		ОбластьИтогиТаблицы.Параметры.ВесБруттоИтого = Формат(ВесБруттоИтого, "ЧДЦ=2; ЧГ=0");
		
		ТабличныйДокумент.Вывести(ОбластьИтогиТаблицы);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьСоставТкани(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_СоставТкани";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.КСП_ПФ_MXL_СоставТкани");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Организация КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.Контрагент КАК Получатель,
	|	РеализацияТоваровУслуг.Организация.НаименованиеПолное КАК ПолноеЮрНаименование,
	|	РеализацияТоваровУслуг.Организация.ИНН КАК ИНН,
	|	РеализацияТоваровУслуг.Организация.КПП КАК КПП,
	|	РеализацияТоваровУслуг.Организация.ОГРН КАК ОГРН,
	|	ОрганизацииКонтактнаяИнформация.Представление КАК Адреc,
	|	ОрганизацииКонтактнаяИнформация2.Представление КАК Телефон,
	|	РеализацияТоваровУслуг.Контрагент.НаименованиеПолное КАК ПолноеЮрНаименованиеПокупатель,
	|	РеализацияТоваровУслуг.Контрагент.ИНН КАК ИННПокупатель,
	|	РеализацияТоваровУслуг.Контрагент.КПП КАК КПППокупатель,
	|	РеализацияТоваровУслуг.Контрагент.РегистрационныйНомер КАК ОГРНПокупатель,
	|	КонтрагентыКонтактнаяИнформация.Представление КАК АдресПокупатель,
	|	КонтрагентыКонтактнаяИнформация2.Представление КАК ТелефонПокупатель
	|ПОМЕСТИТЬ втРеализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ПО (РеализацияТоваровУслуг.Организация = ОрганизацииКонтактнаяИнформация.Ссылка)
	|			И (ОрганизацииКонтактнаяИнформация.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация2
	|		ПО (РеализацияТоваровУслуг.Организация = ОрганизацииКонтактнаяИнформация2.Ссылка)
	|			И (ОрганизацииКонтактнаяИнформация2.Тип = &Телефон)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ПО (РеализацияТоваровУслуг.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка)
	|			И (КонтрагентыКонтактнаяИнформация.Тип = &Адрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация2
	|		ПО (РеализацияТоваровУслуг.Контрагент = КонтрагентыКонтактнаяИнформация2.Ссылка)
	|			И (КонтрагентыКонтактнаяИнформация2.Тип = &Телефон)
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРеализация.Ссылка КАК Ссылка,
	|	втРеализация.Ссылка.Номер КАК НомерСпецификации,
	|	втРеализация.Ссылка.Дата КАК ДатаСпецификации,
	|	втРеализация.Дата КАК Дата,
	|	втРеализация.Грузоотправитель КАК Грузоотправитель,
	|	втРеализация.Получатель КАК Получатель,
	|	втРеализация.ПолноеЮрНаименование КАК ПолноеЮрНаименование,
	|	втРеализация.ИНН КАК ИНН,
	|	втРеализация.КПП КАК КПП,
	|	втРеализация.ОГРН КАК ОГРН,
	|	втРеализация.Адреc КАК Адреc,
	|	втРеализация.Телефон КАК Телефон,
	|	втРеализация.ПолноеЮрНаименованиеПокупатель КАК ПолноеЮрНаименованиеПокупатель,
	|	втРеализация.ИННПокупатель КАК ИННПокупатель,
	|	втРеализация.КПППокупатель КАК КПППокупатель,
	|	втРеализация.ОГРНПокупатель КАК ОГРНПокупатель,
	|	втРеализация.АдресПокупатель КАК АдресПокупатель,
	|	втРеализация.ТелефонПокупатель КАК ТелефонПокупатель,
	|	БанковскиеСчетаОрганизаций.БИКБанка КАК БИК,
	|	БанковскиеСчетаОрганизаций.НаименованиеБанка КАК НаименованиеБанка,
	|	БанковскиеСчетаОрганизаций.НомерСчета КАК РасчСчет,
	|	БанковскиеСчетаОрганизаций.КоррСчетБанка КАК КоррСчет,
	|	БанковскиеСчетаКонтрагентов.БИКБанка КАК БИКПокупатель,
	|	БанковскиеСчетаКонтрагентов.НаименованиеБанка КАК НаименованиеБанкаПокупатель,
	|	БанковскиеСчетаКонтрагентов.НомерСчета КАК РасчСчетПокупатель,
	|	БанковскиеСчетаКонтрагентов.КоррСчетБанка КАК КоррСчетПокупатель
	|ПОМЕСТИТЬ втРеализацияРеквизиты
	|ИЗ
	|	втРеализация КАК втРеализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
	|		ПО втРеализация.Получатель = БанковскиеСчетаКонтрагентов.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ПО втРеализация.Грузоотправитель = БанковскиеСчетаОрганизаций.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура.Представление КАК ГруппировкаНоменклатура,
	|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТовары.СуммаСНДС КАК Сумма,
	|	РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения.Представление КАК ЕдИзмерения,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.ГруппировкаНоменклатура КАК ГруппировкаНоменклатура,
	|	втТовары.Характеристика.Представление КАК Наименование,
	|	втТовары.ЕдИзмерения КАК ЕдИзмерения,
	|	втТовары.Количество КАК Количество,
	|	втТовары.Цена КАК Цена,
	|	втТовары.Сумма КАК Сумма
	|ИЗ
	|	втТовары КАК втТовары
	|ИТОГИ ПО
	|	ГруппировкаНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРеализация.Ссылка.Номер КАК НомерСпецификации,
	|	втРеализация.Ссылка.Дата КАК ДатаСпецификации,
	|	втРеализация.Ссылка.Договор.Представление КАК ДоговорСпецификации,
	|	втРеализация.Ссылка.Договор.Дата КАК ДатаДоговораСпецификации
	|ПОМЕСТИТЬ втЗаголовок
	|ИЗ
	|	втРеализация КАК втРеализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Рук.ФизическоеЛицо.Фамилия + "" "" + Рук.ФизическоеЛицо.Инициалы КАК Руководитель,
	|	Бух.ФизическоеЛицо.Фамилия + "" "" + Бух.ФизическоеЛицо.Инициалы КАК ГлавБух
	|ИЗ
	|	втРеализация КАК втРеализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛицаОрганизаций КАК Бух
	|		ПО втРеализация.Грузоотправитель = Бух.Владелец
	|			И (Бух.Должность = ""Главный бухгалтер"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛицаОрганизаций КАК Рук
	|		ПО втРеализация.Грузоотправитель = Рук.Владелец
	|			И (Рук.Должность = ""Руководитель"")";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов[0]);
	Запрос.УстановитьПараметр("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	РезультатыЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ВыборкаЗаголовок = РезультатыЗапросов[4].Выбрать();
	Если ВыборкаЗаголовок.Следующий() Тогда
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаЗаголовок);
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	ОбластьРеквизиты = Макет.ПолучитьОбласть("Реквизиты");
	ВыборкаРеквизиты = РезультатыЗапросов[1].Выбрать();
	Если ВыборкаРеквизиты.Следующий() Тогда
		ОбластьРеквизиты.Параметры.Заполнить(ВыборкаРеквизиты);
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьРеквизиты);
	
	ВыборкаНоменклатура = РезультатыЗапросов[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НомерСтроки = 1;
	Пока ВыборкаНоменклатура.Следующий() Цикл
		ОбластьГруппировкаНоменклатура = Макет.ПолучитьОбласть("ГруппировкаНоменклатура");
		ОбластьГруппировкаНоменклатура.Параметры.Заполнить(ВыборкаНоменклатура);
		ТабличныйДокумент.Вывести(ОбластьГруппировкаНоменклатура);
		
		Выборка = ВыборкаНоменклатура.Выбрать();
		Пока Выборка.Следующий() Цикл
			// добавить потом состав ткани !
			ОбластьСтрокаГруппировки = Макет.ПолучитьОбласть("СтрокаГруппировки");
			ОбластьСтрокаГруппировки.Параметры.Заполнить(Выборка);
			ОбластьСтрокаГруппировки.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьСтрокаГруппировки);
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ОбластьРукБух = Макет.ПолучитьОбласть("РукБух");
	ВыборкаРукБух = РезультатыЗапросов[5].Выбрать();
	Если ВыборкаРукБух.Следующий() Тогда
		ОбластьРукБух.Параметры.Заполнить(ВыборкаРукБух);	
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьРукБух);
	
	Возврат ТабличныйДокумент;
	
КонецФункции
