Процедура КСП_ДвиженияТаможенныеДекларацииЭкспорт(ПараметрыРегистрации)

	ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ПараметрыРегистрации.Организация); 
	
	// +++ УваровДС 04/12/2023
		
	Запись = РегистрыСведений.ТаможенныеДекларацииЭкспортКРегистрации.СоздатьМенеджерЗаписи();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПередачаТоваровМеждуОрганизациями.Организация КАК Организация,
		|	ПередачаТоваровМеждуОрганизациями.Организация.КСП_Контрагент КАК Контрагент,
		|	ПередачаТоваровМеждуОрганизациями.Дата КАК ДатаРеализации
		|ИЗ
		|	Документ.ПередачаТоваровМеждуОрганизациями КАК ПередачаТоваровМеждуОрганизациями
		|ГДЕ
		|	ПередачаТоваровМеждуОрганизациями.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись.РеализацияЭкспорт = Ссылка;
		Запись.Прочитать();                           
		
		Запись.РеализацияЭкспорт = Ссылка;	
		Запись.СуммаДокумента = 0;
		Запись.Организация = Выборка.Организация;
		Запись.Контрагент = Выборка.Контрагент; //Организация.КСП_Контрагент
		Запись.ДатаРеализации = Выборка.ДатаРеализации;
		Запись.Валюта = ВалютаРегламентированногоУчета;
		Запись.СуммаДокумента = ЦенообразованиеКлиентСервер.ПолучитьСуммуДокумента(Товары, ЦенаВключаетНДС);
		
		// если уже есть тогда заместить
		Если Запись.Выбран() Тогда
			Запись.Записать();
			Продолжить;
		КонецЕсли;
		
		// запись к уже существующим
		Запись.Записать(Ложь);
		
	КонецЦикла;	
	
	// почему в документе 0, попробывать ОбновитьСостояние из менеджера объекта РС
	
	// --- УваровДС
	
	// лейсан	
	//НовыйДокумент = Документы.ТаможеннаяДекларацияЭкспорт.СоздатьДокумент();
	//НовыйДокумент.Дата = ПараметрыРегистрации.Дата;
	//НовыйДокумент.Записать();
	
КонецПроцедуры


&После("ОбработкаПроведения")
Процедура КСП_ОбработкаПроведения(Отказ, РежимПроведения)
	//лейсан +++
	ПараметрыРегистрации = Документы.ПередачаТоваровМеждуОрганизациями.ПараметрыРегистрацииСчетовФактурВыданных(ЭтотОбъект);
    КСП_ДвиженияТаможенныеДекларацииЭкспорт(ПараметрыРегистрации);
	//лейсан ---	
КонецПроцедуры
