Процедура КСП_ДвиженияТаможенныеДекларацииЭкспорт(ПараметрыРегистрации)
	ВалютаРегламентированногоУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ПараметрыРегистрации.Организация); 
	
	МенеджерЗаписи = РегистрыСведений.ТаможенныеДекларацииЭкспортКРегистрации.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.РеализацияЭкспорт = ПараметрыРегистрации.Ссылка;
	МенеджерЗаписи.Организация = ПараметрыРегистрации.Организация;
	МенеджерЗаписи.ДатаРеализации = ПараметрыРегистрации.Дата;
	МенеджерЗаписи.СуммаДокумента = 0;
	МенеджерЗаписи.Контрагент = ПараметрыРегистрации.Организация.КСП_Контрагент;
	МенеджерЗаписи.Валюта = ВалютаРегламентированногоУчета;
	
	МенеджерЗаписи.Записать();
	
	
	НовыйДокумент = Документы.ТаможеннаяДекларацияЭкспорт.СоздатьДокумент();
	НовыйДокумент.Дата = ПараметрыРегистрации.Дата;
	НовыйДокумент.Записать();
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура КСП_ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПараметрыРегистрации = Документы.ПередачаТоваровМеждуОрганизациями.ПараметрыРегистрацииСчетовФактурВыданных(ЭтотОбъект);
    КСП_ДвиженияТаможенныеДекларацииЭкспорт(ПараметрыРегистрации);
	
КонецПроцедуры
