
#Область КСП_ПрограммныйИнтерфейс

#Область КСП_ОбработчикиСобытий

&Вместо("ОбработкаПроведения")
Процедура КСП_ОбработкаПроведения(Объект, Отказ, РежимПроведения)
	
	Движения = Объект.Движения;
	ДополнительныеСвойства = Объект.ДополнительныеСвойства;
	
	//КСП_СчетаНаОплату.КСП_ОбработатьЗачетПредоплаты(Объект, Отказ); // Раскоментить по отмашке
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Ложь);
	СтруктураПараметры.Вставить("УправляемыеСкидки", Неопределено);
	
	СкидкиНаценкиСервер.Рассчитать(Объект, СтруктураПараметры);
	СкидкиРассчитаны = Истина;
	
КонецПроцедуры

&Вместо("ПередЗаписью")
Процедура КСП_ПередЗаписью(Объект, Отказ, РежимЗаписи, РежимПроведения)
	
	Для каждого Строка Из Объект.Товары Цикл
		Если НЕ ЗначениеЗаполнено(Строка.КСП_ИдентификаторСтрокиЗаказа) Тогда
			Строка.КСП_ИдентификаторСтрокиЗаказа = Новый УникальныйИдентификатор;
		КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(Строка.КСП_НужноПривязатьПредоплатуБезСчета) Тогда
		//	Строка.КСП_НужноПривязатьПредоплатуБезСчета = Ложь;
		//КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&Вместо("ПриКопировании")
Процедура КСП_ПриКопировании(Объект, ОбъектКопирования)
	
	Объект.КСП_ПроцентПредоплаты = 0;
	Объект.КСП_СуммаПредоплаты = 0;
	
	Для каждого Строка Из Объект.Товары Цикл
		Строка.КСП_ИдентификаторСтрокиЗаказа = Новый УникальныйИдентификатор;
		//Строка.КСП_НужноПривязатьПредоплатуБезСчета = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

