#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт   
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ПустаяСсылка()));
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = ОбъектМетаданных.Имя;
	КомандаПечати.Представление = ОбъектМетаданных.Синоним;
	КомандаПечати.МенеджерПечати    = ОбъектМетаданных.ПолноеИмя();
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.Порядок = 10;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "НАКЛАДНАЯНАФУРНИТУРУ";
	КомандаПечати.Представление = "Накладная на фурнитуру";
	КомандаПечати.МенеджерПечати    = ОбъектМетаданных.ПолноеИмя();
	КомандаПечати.СписокФорм    = "ФормаДокумента";
	КомандаПечати.Порядок = 11;
КонецПроцедуры
// Функция помещает в структуру все данные, отображаемые при печати документа.
// Вызывается из функции ПечатьСписаниеТоваров и из веб-приложения
//
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьДанныеДляПечатиПВ(ТекущийДокумент) Экспорт
	
	ПараметрыПечати = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ПВ.Ссылка КАК Ссылка,
	|	ПВ.Номер КАК Номер,
	|	ПВ.Дата КАК Дата,
	|	ПВ.Организация КАК Организация,
	|	ПВ.Контрагент КАК Контрагент,
	|	ПВ.Номенклатура КАК Номенклатура,
	|	ПВ.Характеристика КАК Характеристика,
	|	ПВ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПВ.ОбщееКоличество КАК ОбщееКоличество,
	|	ПВ.Завершена КАК Завершена,
	|	ПВ.ПроцентКондиции КАК ПроцентКондиции,
	|	ПВ.ДокументОснование КАК ДокументОснование,
	|	ПВ.ДокументОснование.Распоряжение.Подразделение КАК ПредставлениеПодразделения,
	|	ПВ.ДокументОснование.Склад КАК ПредставлениеСклада,
	|	ПВ.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Номенклатура.НаименованиеПолное КАК Товар,
	|		Номенклатура.Код КАК Код,
	|		Номенклатура.Артикул КАК Артикул,
	|		Количество КАК Количество,  
	|		КоличествоПоставщика КАК КоличествоПоставщика,  
	|		КоличествоБрак как КоличествоБрак,
	|		Характеристика КАК Характеристика,
	|		Серия КАК Серия
	|	) КАК Товары
	|ИЗ
	|	Документ.КСП_ПроверочнаяВедомость КАК ПВ
	|ГДЕ
	|	ПВ.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПВ.Товары.НомерСтроки";
	
		
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
	
	// Выводим шапку накладной
	ПараметрыПечати.Вставить("ТекстЗаголовка", СформироватьЗаголовокДокумента(Шапка, "Проверочная ведомость"));
    ПараметрыПечати.Вставить("Ссылка", Шапка.Ссылка);
	ПараметрыПечати.Вставить("Завершена", Шапка.Завершена);
	ПараметрыПечати.Вставить("Дата", Шапка.Дата);
	ПараметрыПечати.Вставить("Номер", Шапка.Номер);
	ПараметрыПечати.Вставить("ПредставлениеОрганизации", Шапка.Организация.Наименование);
	ПараметрыПечати.Вставить("ПредставлениеПодразделения", Шапка.ПредставлениеПодразделения);
	ПараметрыПечати.Вставить("Организация", Шапка.Организация);
    ПараметрыПечати.Вставить("ПредставлениеСклада", Шапка.ПредставлениеСклада);
    ПараметрыПечати.Вставить("Контрагент", Шапка.Контрагент);
    ПараметрыПечати.Вставить("Номенклатура", Шапка.Номенклатура);
    ПараметрыПечати.Вставить("Характеристика", Шапка.Характеристика);
    ПараметрыПечати.Вставить("ЕдиницаИзмерения", Шапка.ЕдиницаИзмерения);
    ПараметрыПечати.Вставить("ДокументОснование", Шапка.ДокументОснование);
    ПараметрыПечати.Вставить("ОбщееКоличество", Шапка.ОбщееКоличество);
    ПараметрыПечати.Вставить("ПроцентКондиции", Шапка.ПроцентКондиции);
    КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов();
	ИмяКолонкиКодов = КолонкаКодов.ИмяКолонки;
	ПредставлениеКолонкиКодов = КолонкаКодов.ПредставлениеКолонки;
	ПараметрыПечати.Вставить("ВыводитьКоды",ЗначениеЗаполнено(КолонкаКодов));
	ПараметрыПечати.Вставить("ИмяКолонкиКодов",ИмяКолонкиКодов);
	Позиции = Новый Массив;
	СуммаИтого = 0;
	Ном        = 0;

	// Товары
	Пока ВыборкаСтрокТовары.Следующий() Цикл
		
		ПараметрыПозиции = Новый Структура;
		ПараметрыПозиции.Вставить("Номенклатура", ВыборкаСтрокТовары.Номенклатура);		

		Ном = Ном + 1;

		ПараметрыПозиции.Вставить("НомерСтроки", Ном);

		Если ПараметрыПечати.ВыводитьКоды Тогда
			Если ПараметрыПечати.ИмяКолонкиКодов = "Артикул" Тогда
				ПараметрыПозиции.Вставить("Артикул", ВыборкаСтрокТовары.Артикул);
			Иначе
				ПараметрыПозиции.Вставить("Артикул", ВыборкаСтрокТовары.Код);
			КонецЕсли;
		КонецЕсли;

		ПараметрыПозиции.Вставить("Товар", ВыборкаСтрокТовары.Товар) ;//+ ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары));

		//Если ПараметрыПечати.ФлагПечатиМест Тогда
		//	ПараметрыПозиции.Вставить("КоличествоМест", ВыборкаСтрокТовары.КоличествоМест);
		//	ПараметрыПозиции.Вставить("ЕдиницаИзмеренияМест", ВыборкаСтрокТовары.ЕдиницаИзмеренияМест);
		//КонецЕсли;
		
		ПараметрыПозиции.Вставить("ХарактеристикаНоменклатуры", ВыборкаСтрокТовары.Характеристика);
		ПараметрыПозиции.Вставить("Количество", ВыборкаСтрокТовары.Количество);
		ПараметрыПозиции.Вставить("КоличествоПоставщика", ВыборкаСтрокТовары.КоличествоПоставщика);
		ПараметрыПозиции.Вставить("КоличествоБрак", ВыборкаСтрокТовары.КоличествоБрак);
		ПараметрыПозиции.Вставить("ЕдиницаИзмерения", ВыборкаСтрокТовары.Номенклатура.ЕдиницаИзмерения);
		//Если ВыборкаСтрокТовары.Количество <> 0 Тогда
		//	ПараметрыПозиции.Вставить("Цена", Сумма/ВыборкаСтрокТовары.Количество);
		//КонецЕсли;
		//ПараметрыПозиции.Вставить("Сумма", ВыборкаСтрокТовары.Сумма);
		//Если ПараметрыПечати.ЭтоСкладНТТ Тогда
		//	Сумма = ВыборкаСтрокТовары.Сумма;
		//Иначе
			
		//	ПараметрыПозиции.Вставить("Сумма", Сумма);
		//КонецЕсли;

		//СуммаИтого = СуммаИтого + Сумма;
		
		//#Если ВнешнееСоединение Тогда
		//WEBПриложения.ПодготовитьСтруктуруДляВнешнегоСоединения(ПараметрыПозиции);
		//#КонецЕсли

		Позиции.Добавить(ПараметрыПозиции);
		
	КонецЦикла;

		
	ПараметрыПечати.Вставить("Позиции", Позиции);

//	ПараметрыПечати.Вставить("Всего", ФорматСумм(СуммаИтого));

//	// Вывести Сумму прописью
//	ПараметрыПечати.Вставить("ИтоговаяСтрока", "Всего наименований " + Ном
//	                                       + ", на сумму " + ФорматСумм(СуммаИтого, ВалютаПечати));
//	ПараметрыПечати.Вставить("СуммаПрописью", СформироватьСуммуПрописью(СуммаИтого, Ложь));
	
	
	Возврат ПараметрыПечати;

КонецФункции //ПолучитьДанныеДляПечатиСписанияТоваров()
// Функция формирует представление заголовка документа
//
// Возвращаемое значение:
//  Строка - представление номера документа
//
Функция СформироватьЗаголовокДокумента(ДокументОбъект, НазваниеДокумента = "") Экспорт
	
	Если ДокументОбъект = Неопределено Тогда
		Возврат "";
	Иначе
		Возврат ?(НЕ ЗначениеЗаполнено(НазваниеДокумента), ДокументОбъект.Метаданные().Синоним, НазваниеДокумента) + " № " + ДокументОбъект.Номер
		                          + " от " + Формат(ДокументОбъект.Дата, "ДФ='дд ММММ гггг'") + " г.";
	КонецЕсли;

КонецФункции // СформироватьЗаголовокДокумента()
// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
// 
Функция ПолучитьЦенуПоступленияПоНоменклатуре(ДокументОснование,Номенклатура,Характеристика) Экспорт
	ДокПоступления=ДокументОснование.Распоряжение;
	Если Не ЗначениеЗаполнено(ДокПоступления) тогда
		возврат 0;
	КонецЕсли;
	Если ТипЗнч(ДокПоступления) <> Тип("ДокументСсылка.ПриобретениеТоваровУслуг") тогда
		возврат 0;
	КонецЕсли;
	СтрОтбора=новый Структура;
	СтрОтбора.Вставить("Номенклатура",Номенклатура);
	СтрОтбора.Вставить("Характеристика",Характеристика);
	НайдСтроки=ДокПоступления.Товары.НайтиСтроки(СтрОтбора);
	СуммаПоставщика=0;
	КоличествоПоставщика=0;
	Для каждого ТекНайдСтрока Из НайдСтроки Цикл
		Если НЕ ДокПоступления.СуммаВключаетНДС Тогда
			СуммаПоставщика=СуммаПоставщика+ТекНайдСтрока.Сумма+ТекНайдСтрока.СуммаНДС;
		иначе
			СуммаПоставщика=СуммаПоставщика+ТекНайдСтрока.Сумма;
		КонецЕсли; 
		КоличествоПоставщика=КоличествоПоставщика+ТекНайдСтрока.Количество;
	КонецЦикла; 
	Если НЕ ДокПоступления.ВалютаДокумента=Константы.ВалютаРегламентированногоУчета.Получить() Тогда
		СуммаПоставщика=Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(СуммаПоставщика, ДокПоступления.ВалютаДокумента,Константы.ВалютаРегламентированногоУчета.Получить() , ДокПоступления.КурсВзаиморасчетов, ДокПоступления.КратностьВзаиморасчетов, ДокПоступления.Дата);		
	КонецЕсли; 
	Цена=?(КоличествоПоставщика=0,0,Окр(СуммаПоставщика/КоличествоПоставщика,2));
	возврат Цена;
КонецФункции
Функция ПолучитьСуммуПоступленияПоНоменклатуре(ДокументОснование,Номенклатура,Характеристика,КоличествоПоставщика=0) Экспорт
	ДокПоступления=ДокументОснование.Распоряжение;
	Если Не ЗначениеЗаполнено(ДокПоступления) тогда
		возврат 0;
	КонецЕсли;
	Если ТипЗнч(ДокПоступления) <> Тип("ДокументСсылка.ПриобретениеТоваровУслуг") тогда
		возврат 0;
	КонецЕсли;
	СтрОтбора=новый Структура;
	СтрОтбора.Вставить("Номенклатура",Номенклатура);
	СтрОтбора.Вставить("Характеристика",Характеристика);
	Если ТипЗнч(ДокПоступления)=Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		НайдСтроки=ДокПоступления.Товары.НайтиСтроки(СтрОтбора);
	иначеЕсли ТипЗнч(ДокПоступления)=Тип("ДокументСсылка.ПоступлениеТоваровИзПереработки") Тогда
		возврат 0;
	КонецЕсли; 
	СуммаПоставщика=0;
	Для каждого ТекНайдСтрока Из НайдСтроки Цикл
		Если ЗначениеЗаполнено(КоличествоПоставщика) и Не КоличествоПоставщика=ТекНайдСтрока.Количество Тогда
			продолжить;	
		КонецЕсли; 
		Если НЕ ДокПоступления.ЦенаВключаетНДС Тогда
			СуммаПоставщика=СуммаПоставщика+ТекНайдСтрока.Сумма+ТекНайдСтрока.СуммаНДС;
		иначе
			СуммаПоставщика=СуммаПоставщика+ТекНайдСтрока.Сумма;
		КонецЕсли; 
	КонецЦикла; 
	Если НЕ ДокПоступления.Валюта=Константы.ВалютаРегламентированногоУчета.Получить() Тогда
		СуммаПоставщика = ПересчитатьИзВалютыВВалюту(СуммаПоставщика,  ДокПоступления.Валюта,Константы.ВалютаРегламентированногоУчета.Получить(),
				   ДокПоступления.КурсЧислитель/ДокПоступления.КурсЗнаменатель, 1,1,1);
	КонецЕсли; 
	возврат СуммаПоставщика;
КонецФункции   
// Эта функция пересчитывает сумму из валюты ВалютаНач по курсу ПоКурсуНач 
// в валюту ВалютаКон по курсу ПоКурсуКон
//
// Параметры:      
//	Сумма          - сумма, которую следует пересчитать;
//	ВалютаНач      - ссылка на элемент справочника Валют;
//                   определяет валюты из которой надо пересчитвать;
//	ВалютаКон      - ссылка на элемент справочника Валют;
//                   определяет валюты в которую надо пересчитвать;
// 	ПоКурсуНач     - курс из которого надо пересчитать;
// 	ПоКурсуКон     - курс в который надо пересчитать;
// 	ПоКратностьНач - кратность из которого надо пересчитать (по умолчанию = 1);
// 	ПоКратностьКон - кратность в который надо пересчитать  (по умолчанию = 1);
//
// Возвращаемое значение: 
//  Сумма, пересчитанная в другую валюту
//
Функция ПересчитатьИзВалютыВВалюту(Сумма, ВалютаНач, ВалютаКон, ПоКурсуНач, ПоКурсуКон, 
	ПоКратностьНач =1, ПоКратностьКон = 1 ) Экспорт
	
	Если (ВалютаНач = ВалютаКон) Тогда
		
		// Считаем, что пересчет не нужен.
		Возврат Сумма;
	КонецЕсли;
	
	Если (ПоКурсуНач = ПоКурсуКон) 
		и (ПоКратностьНач = ПоКратностьКон) Тогда
		
		// пересчет суммы не требуется
		Возврат Сумма;
	КонецЕсли;
	
	Если ПоКурсуНач     = 0 
		или ПоКурсуКон     = 0 
		или ПоКратностьНач = 0 
		или ПоКратностьКон = 0 Тогда
		Сообщить("При пересчете из валюты '"+ВалютаНач+"' в валюту '"+ВалютаКон+"' обнаружен нулевой курс.");
		Возврат 0;
	КонецЕсли;
	
	Возврат Окр((Сумма * ПоКурсуНач * ПоКратностьКон) / (ПоКурсуКон * ПоКратностьНач), 2);
	
КонецФункции //ПересчитатьИзВалютыВВалюту()

// Функция производит поиск документа заданного вида (счета-фактуры), имеющего в табличной части "ДокументыОснования" значение,
// равное переданной ссылке.
//
// Параметры:
//  ДокументСсылка  - ссылка на документ, для которого надо найти подчиненный документ,
//  ВидСчетаФактуры - строка, вид документа, по умолчанию "СчетФактураВыданный"
//
// Возвращаемое значение:
//  Если нашли, то возвращаем ссылку, не нашли - Неопределено
//
Функция НайтиПодчиненныйДокумент(ДокументСсылка, ВидДокумента = "СчетФактураВыданный", РазрешитьВыборСФНаАвансИлиСР = Истина, ФлагТолькоПроведенные = Ложь, РазрешитьВыборТолькоСФНаАванс = Ложь, РазрешитьВыборТолькоСФНаСР = Ложь, СтавкаНДСсАванса = Неопределено, ДоговорАванса = Неопределено) Экспорт

	НайденныйДокумент = Неопределено;
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда

		Запрос = Новый Запрос;

		// Установим параметры запроса
		Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);

		Запрос.Текст = 
		"ВЫБРАТЬ различные
		|	Ссылка 
		|ИЗ
		|	Документ." + ВидДокумента + ".ДокументыОснования Как ТЧ_Документов
		|
		|ГДЕ
		|	ТЧ_Документов.ДокументОснование = &ДокументСсылка";
		Если ФлагТолькоПроведенные Тогда
			Запрос.Текст = Запрос.Текст + "
				|	И ТЧ_Документов.Ссылка.Проведен И НЕ ТЧ_Документов.Ссылка.ПометкаУдаления
				|";
		КонецЕсли;
		Если ВидДокумента = "СчетФактураВыданный" И Не РазрешитьВыборСФНаАвансИлиСР Тогда
			Запрос.Текст = Запрос.Текст + " И Не Ссылка.ВидСчетаФактуры = Значение(Перечисление.ВидСчетаФактурыВыставленного.НаАванс) И не Ссылка.ВидСчетаФактуры = Значение(Перечисление.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу)";			
			//Запрос.Текст = Запрос.Текст + " И Не Ссылка.НаАванс И не Ссылка.НаСуммовуюРазницу";			
		ИначеЕсли ВидДокумента = "СчетФактураВыданный" И РазрешитьВыборСФНаАвансИлиСР и РазрешитьВыборТолькоСФНаАванс Тогда
			Запрос.Текст = Запрос.Текст + " И Ссылка.ВидСчетаФактуры = Значение(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)";
			//Запрос.Текст = Запрос.Текст + " И Ссылка.НаАванс";
			Если ЗначениеЗаполнено(СтавкаНДСсАванса) Тогда
				Запрос.Текст = Запрос.Текст + " И Ссылка.СтавкаНДС = &СтавкаНДСсАванса";
				Запрос.УстановитьПараметр("СтавкаНДСсАванса", СтавкаНДСсАванса);
			КонецЕсли; 
			Если ЗначениеЗаполнено(ДоговорАванса) Тогда
				Запрос.Текст = Запрос.Текст + " И Ссылка.ДоговорКонтрагента = &ДоговорАванса";
				Запрос.УстановитьПараметр("ДоговорАванса", ДоговорАванса);
			КонецЕсли; 
		ИначеЕсли ВидДокумента = "СчетФактураВыданный" И РазрешитьВыборСФНаАвансИлиСР и РазрешитьВыборТолькоСФНаСР Тогда
			Запрос.Текст = Запрос.Текст + " И Ссылка.ВидСчетаФактуры = Значение(Перечисление.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу)";
			//Запрос.Текст = Запрос.Текст + " И Ссылка.НаСуммовуюРазницу";
			Если ЗначениеЗаполнено(СтавкаНДСсАванса) Тогда
				Запрос.Текст = Запрос.Текст + " И Ссылка.СтавкаНДС = &СтавкаНДСсАванса";
				Запрос.УстановитьПараметр("СтавкаНДСсАванса", СтавкаНДСсАванса);
			КонецЕсли; 
		КонецЕсли;

		ВыборкаИзЗапроса = Запрос.Выполнить().Выбрать();

		Если ВыборкаИзЗапроса.Следующий() Тогда
			НайденныйДокумент = ВыборкаИзЗапроса.Ссылка;
		КонецЕсли;

	КонецЕсли;

	Возврат НайденныйДокумент;
	
КонецФункции // НайтиПодчиненныйДокумент()

Функция ПечатьПВ(МассивОбъектов, ОбъектыПечати,  ВыводитьЦены = Ложь, ТолькоПоРозничнымЦенам = Ложь) Экспорт
	
	ПараметрыПечати = ПолучитьДанныеДляПечатиПВ(МассивОбъектов.Получить(0));

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КСП_ПроверочнаяВедомость";

	Макет = ПолучитьМакет("ПФ_MXL_ПроверочнаяВедомость");

	//Если Не ПараметрыПечати.Завершена Тогда
	//	Предупреждение("Проверочная ведомость должна быть Завершена и проведена",60);
	//	возврат ТабДокумент;
	//КонецЕсли; 
	ТабДок=Новый ТабличныйДокумент ;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПроверочнаяВедомость";	
	//Заполнение основной шапки
	Шапка1=Макет.ПолучитьОбласть("Шапка1");
	ОблСтрока=Макет.ПолучитьОбласть("Строка");
	ОблПодвал=Макет.ПолучитьОбласть("Подвал");
	ДокументОснование = ПараметрыПечати.ДокументОснование;
	Шапка1.Параметры.Фирма=ПараметрыПечати.Организация;
	Шапка1.Параметры.Номер=сокрлп(ПараметрыПечати.Номер);
	Шапка1.Параметры.ДокументОснованиеНомер=сокрлп(ДокументОснование.Номер);
	Шапка1.Параметры.ДокументОснованиеДата=сокрлп(ДокументОснование.Дата);
	Шапка1.Параметры.Номенклатура=ПараметрыПечати.Номенклатура;
	Шапка1.Параметры.ХарактеристикаНоменклатуры=ПараметрыПечати.Характеристика;
	Шапка1.Параметры.Контрагент=ПараметрыПечати.Контрагент;
	ПроцентКондиции = ПараметрыПечати.ПроцентКондиции;
	ОбщееКоличество = ПараметрыПечати.ОбщееКоличество;
	Отбор=новый Структура;
	Отбор.Вставить("КСП_ПроверочнаяВедомость",ПараметрыПечати.Ссылка);
	//Отбор.Вставить("Номенклатура",ПараметрыПечати.Номенклатура);
	//Отбор.Вставить("Характеристика",ПараметрыПечати.Характеристика);
	//Отбор.Вставить("Упаковка",ПараметрыПечати.ЕдиницаИзмерения);
	НайдСтрока=ДокументОснование.Товары.НайтиСтроки(Отбор);
	ОбщееКоличествоПоНакладной=НайдСтрока[0].Количество;
	Шапка1.Параметры.ОбщееКоличествоПоНакладной=ОбщееКоличествоПоНакладной;
	Шапка1.Параметры.ОбщееКоличество=ОбщееКоличество;
	Шапка1.Параметры.ДатаПромера=сокрлп(ПараметрыПечати.Дата);
	ПостуПТоваров= ДокументОснование.Распоряжение;
	Если  ЗначениеЗаполнено(ПостуПТоваров) тогда
		//Попытаемся найти счет фактуру
		СчетФактура = НайтиПодчиненныйДокумент(ПостуПТоваров,"СчетФактураПолученный",Истина);
		Если ЗначениеЗаполнено(СчетФактура) Тогда
			Шапка1.Параметры.СчФ = СчетФактура.Номер+" от "+СчетФактура.ДатаЗаписиКнигиПокупок;
		КонецЕсли;	                                              
	КонецЕсли; 
	Шапка1.Параметры.КондиционныйПроц="";
	//}Курдюмов А.Н.
	//ДМВ Если ДокументОснование.СпецТипНакладной=Перечисления.СпецТипНакладной.ПряжаЛот Тогда
	Если ПараметрыПечати.ССылка.СпецТипНакладной=Перечисления.КСП_СпецТипНакладной.ПряжаЛот Тогда
		СтрокаОрдера=ДокументОснование.Товары.Найти(ПараметрыПечати.Ссылка,"КСП_ПроверочнаяВедомость");
		ДопустимыйМинимум=СтрокаОрдера.Количество*(1-ПроцентКондиции/100);
		ПроцентКолОтОбщегоКондиционногоОбъема=Окр(100-ОбщееКоличество*100/ДопустимыйМинимум,1);
		СуммаНедостачи= Окр(ПолучитьСуммуПоступленияПоНоменклатуре(ПараметрыПечати.ДокументОснование,СтрокаОрдера.Номенклатура,СтрокаОрдера.Характеристика)*ПроцентКолОтОбщегоКондиционногоОбъема/100,2);
		Шапка1.Параметры.КондиционныйПроц="% кондиционности "+СокрЛП(ПроцентКондиции)+"%. Допустимый мин.="+СокрЛП(Окр(ОбщееКоличествоПоНакладной*(1-ПроцентКондиции/100),3))+"кг.";
	КонецЕсли; 
	
	
	
	ТабДок.Вывести(Шапка1) ;
	//Заполнение  шапки табл части
	Шапка=Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Шапка) ; 
	Товары = ПараметрыПечати.Позиции; 
	КоличествоБрак = 0;
	Для каждого ТекСтрока Из Товары Цикл
		ОблСтрока.Параметры.Заполнить(ТекСтрока);
		ОблСтрока.Параметры.Проц=""; 
		КоличествоБрак = КоличествоБрак + ТекСтрока.КоличествоБрак;
		ТабДок.Вывести(ОблСтрока) ;
	КонецЦикла;
	ПроцентКолОтОбщегоОбъема=Окр(100-ОбщееКоличество*100/ОбщееКоличествоПоНакладной,1);
	СуммаНедостачи= Окр(ПолучитьСуммуПоступленияПоНоменклатуре(ПараметрыПечати.ДокументОснование,ПараметрыПечати.Номенклатура,ПараметрыПечати.Характеристика)*ПроцентКолОтОбщегоОбъема/100,2);
	ОблПодвал.Параметры.Проц=ПроцентКолОтОбщегоОбъема;
	ОблПодвал.Параметры.КоличествоПоставщика=ОбщееКоличествоПоНакладной;
	ОблПодвал.Параметры.Количество=ОбщееКоличество;
	ОблПодвал.Параметры.КоличествоБрак=КоличествоБрак;
	ОблПодвал.Параметры.ИзлишкиФакт=0;
	ОблПодвал.Параметры.НедостачаФакт=0;
	ОблПодвал.Параметры.НедостачаСверхНормы=0;
	ОблПодвал.Параметры.СуммаПретензии=0;
	ДопустимыйМинимум=ОбщееКоличествоПоНакладной*(1-ПроцентКондиции/100);
	
	Если ОбщееКоличествоПоНакладной<ОбщееКоличество Тогда
		ОблПодвал.Параметры.ИзлишкиФакт=ОбщееКоличество-ОбщееКоличествоПоНакладной;	
	иначеЕсли ОбщееКоличествоПоНакладной>ОбщееКоличество Тогда
		ОблПодвал.Параметры.НедостачаФакт=ОбщееКоличествоПоНакладной-ОбщееКоличество;
		//ДМВ было Если ДокументОснование.СпецТипНакладной=Перечисления.СпецТипНакладной.ПряжаЛот Тогда
		Если ПараметрыПечати.Ссылка.СпецТипНакладной=Перечисления.СпецТипНакладной.ПряжаЛот Тогда
			ДопустимыйМинимум=ОбщееКоличествоПоНакладной*(1-ПроцентКондиции/100);
			Если ОбщееКоличество<ДопустимыйМинимум Тогда
				ПроцентКолОтОбщегоОбъема=Окр(100-ОбщееКоличество*100/ОбщееКоличествоПоНакладной,1);
				ПроцентКолОтОбщегоОбъема=Макс(ПроцентКолОтОбщегоОбъема-ПроцентКондиции,0);
				СуммаНедостачи= Окр(ПолучитьСуммуПоступленияПоНоменклатуре(ПараметрыПечати.ДокументОснование,ПараметрыПечати.Номенклатура, ПараметрыПечати.Характеристика)*ПроцентКолОтОбщегоОбъема/100,2);
			КонецЕсли; 
		иначе	
			Если ПроцентКолОтОбщегоОбъема>2  Тогда
				ОблПодвал.Параметры.НедостачаСверхНормы=ОбщееКоличествоПоНакладной-ОбщееКоличество;
				ОблПодвал.Параметры.СуммаПретензии=СуммаНедостачи;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	ТабДок.Вывести(ОблПодвал) ;
	Возврат ТабДок;

КонецФункции // ПечатьСписаниеТоваров()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КСП_ПРОВЕРОЧНАЯВЕДОМОСТЬ") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "КСП_ПРОВЕРОЧНАЯВЕДОМОСТЬ",
				"Проверочная ведомость",
				ПечатьПВ(МассивОбъектов, ОбъектыПечати));//ПечатьНакладной(МассивОбъектов, ОбъектыПечати));
				
	КонецЕсли;

    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НАКЛАДНАЯНАФУРНИТУРУ") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "НАКЛАДНАЯНАФУРНИТУРУ",
				"Накладная на фурнитуру",
				ПечатьНакладнаяНаФурнитуру(МассивОбъектов, ОбъектыПечати));//ПечатьНакладной(МассивОбъектов, ОбъектыПечати));
				
	КонецЕсли;

КонецПроцедуры
 Функция ПечатьНакладнаяНаФурнитуру(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ДокументСсылка = МассивОбъектов.Получить(0).ДокументСписания;

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НакладнаяНаФурнитуру";

	// Вывод заголовка
	Макет = ПолучитьМакет("ПФ_MXL_НакладнаяНаФурнитуру");
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Заполнить(ДокументСсылка);
	Область.Параметры.Заголовок="Требование накладная на выдачу фурнитуры ";
	//Если ЗначениеЗаполнено(СекцияОснование) Тогда
	//	Область.Параметры.ТекстЗаголовка="Ассортимент "+Строка(СекцияОснование.МодельНоменклатура.Родитель)+" Модель "+Строка(СекцияОснование.ПроизводственнаяМодель)+" "+Строка(СекцияОснование) ;
	//КонецЕсли ;	
	
	ТабДокумент.Вывести(Область);
	
	Запрос=Новый Запрос ;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	СписаниеНедостачТоваровТовары.Номенклатура КАК Номенклатура,
	|	СписаниеНедостачТоваровТовары.Характеристика КАК ХарактеристикаНоменклатуры,
	|	СписаниеНедостачТоваровТовары.Количество КАК Количество
	|ИЗ
	|	Документ.СписаниеНедостачТоваров.Товары КАК СписаниеНедостачТоваровТовары
	|ГДЕ
	|	СписаниеНедостачТоваровТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Номенклатура,
	|	Характеристика"  ;
	
	
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка) ;	
	Рез=Запрос.Выполнить() ;
	Выб1=Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам) ;
	Пока Выб1.Следующий() Цикл
		Выб2=Выб1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам) ;
		Пока Выб2.Следующий() Цикл
			
			Стр = Макет.ПолучитьОбласть("Строка");
			Стр.Параметры.ПечКод			= ПолучитьКодФурнитуры(Выб2.Номенклатура,Выб2.ХарактеристикаНоменклатуры);
			Стр.Параметры.ПечГруппа			= Выб2.Номенклатура.Родитель.Родитель;
			//Стр.Параметры.ПечХарактер		= Выб2.Номенклатура.ВнутреннийТовар.ХарактерФурнитуры;
			Стр.Параметры.ПечПоставщик		= Выб2.Номенклатура.Родитель;
			Стр.Параметры.ПечФурнитура		= Выб2.Номенклатура;
			Стр.Параметры.ПечХарактеристика	= Выб2.ХарактеристикаНоменклатуры;
			Стр.Параметры.ПечКоличество		= Выб2.Количество;
			ТабДокумент.Вывести(Стр);
			
		КонецЦикла ;	
	КонецЦикла ;	
	
	Область = Макет.ПолучитьОбласть("Подписи");
	ТабДокумент.Вывести(Область);
	
	Возврат ТабДокумент ;
	

КонецФункции // ПечатьСписаниеТоваров()
Функция ПолучитьКодФурнитуры(Номенклатура,Характеристика,Качество = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Штрихкод как Код,
	|	Штрихкоды.Номенклатура,
	|	Штрихкоды.Характеристика как ХарактеристикаНоменклатуры
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Номенклатура = &ВыбВладелец
	|	И Штрихкоды.Характеристика = &ВыбХарактеристикаНоменклатуры
	|	//И Штрихкоды.Качество = &Качество";
	Запрос.УстановитьПараметр("ВыбВладелец",Номенклатура);
	Запрос.УстановитьПараметр("ВыбХарактеристикаНоменклатуры",Характеристика);
	Если Не ЗначениеЗаполнено(Качество) Тогда
		Запрос.УстановитьПараметр("Качество",Справочники.КСП_Качество.Новый);
	иначе
		Запрос.УстановитьПараметр("Качество",Качество);
	КонецЕсли; 
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Код;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ДоступныеДляШаблоновПечатныеФормы() Экспорт
	
	МассивДоступныхПечатныхФорм = Новый Массив;
	
	Возврат МассивДоступныхПечатныхФорм

КонецФункции
// Возвращает параметры указания серий для товаров, указанных в документе.
//
// Параметры:
//		Объект - Структура - структура значений реквизитов объекта, необходимых для заполнения параметров указания серий.
//
// Возвращаемое значение:
//		Структура - состав полей структуры задается в функции НоменклатураКлиентСервер.ПараметрыУказанияСерий.
//
Функция ПараметрыУказанияСерий(Объект) Экспорт
	
	ПараметрыУказанияСерий = НоменклатураКлиентСервер.ПараметрыУказанияСерий();
	ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.КСП_ПроверочнаяВедомость";
	
	ПараметрыУказанияСерий.ИмяПоляСклад = "Склад";
	ПараметрыСерийСклада = СкладыСервер.ИспользованиеСерийНаСкладе(Объект.Склад, Истина);
	
	ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры = 
		ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатурыСклад", Новый Структура("Склад",Объект.Склад));
	
	ПараметрыУказанияСерий.ИспользуютсяТоварныеМеста = Истина;
	
	//ПараметрыУказанияСерий.СкладскиеОперации.Добавить(Объект.СкладскаяОперация);
	
	//ПараметрыУказанияСерий.ИспользоватьАдресноеХранение = СкладыСервер.ИспользоватьАдресноеХранение(Объект.СкладСырья, Объект.Помещение, Объект.Дата);
	
	ПараметрыУказанияСерий.ИмяТЧТовары = "Товары";
	ПараметрыУказанияСерий.ИмяТЧСерии = "Серии";
	
	//ПараметрыУказанияСерий.ПоляСвязи.Добавить("УпаковочныйЛистРодитель");
	
	//Если ПараметрыУказанияСерий.ИспользоватьАдресноеХранение Тогда
	//	ПараметрыУказанияСерий.ПоляСвязи.Добавить("Упаковка");
		ПараметрыУказанияСерий.ИмяПоляКоличество = "Количество";	
	//КонецЕсли;
	
	//Если Объект.СкладскаяОперация = Перечисления.СкладскиеОперации.ВозвратНепринятыхТоваров Тогда
	//	ПараметрыУказанияСерий.ПоляСвязи.Добавить("ДокументОтгрузки");
	//КонецЕсли;
	ПараметрыУказанияСерий.ПоляСвязи.Добавить("Помещение");
	ПараметрыУказанияСерий.ИмяПоляПомещение = "Помещение";
	ПараметрыУказанияСерий.ЭтоОрдер = Ложь;
		
	//Если Объект.Статус = Перечисления.СтатусыПриходныхОрдеров.КПоступлению
	//	Или Объект.Статус = Перечисления.СтатусыПриходныхОрдеров.ТребуетсяОбработка 
	//	Или Объект.Статус = Перечисления.СтатусыПриходныхОрдеров.ВРаботе Тогда
	//	ПараметрыУказанияСерий.ПодготовкаОрдера = Истина;
	//КонецЕсли;
	
	ПараметрыУказанияСерий.Дата = Объект.Дата;
	
	//ПараметрыУказанияСерий.ИменаПолейДляОпределенияРаспоряжения.Добавить("Распоряжение");
	ПараметрыУказанияСерий.РегистрироватьСерии = Истина;
	
	Возврат ПараметрыУказанияСерий;
	
КонецФункции
// Имена реквизитов, от значений которых зависят параметры указания серий
//
//	Возвращаемое значение:
//		Строка - имена реквизитов, перечисленные через запятую.
//
Функция ИменаРеквизитовДляЗаполненияПараметровУказанияСерий() Экспорт
	ИменаРеквизитов = "Дата";
	
	Возврат ИменаРеквизитов;
КонецФункции

#КонецОбласти 

#КонецЕсли