Функция ПроверкаНаСоответствиеПриходнойНакладной() экспорт
	//НовыйМеханизмПрихода=ВспомогательныеФункции.НовыйМеханизмПрихода(СпецТипНакладной,Дата);
	//Если НЕ НовыйМеханизмПрихода тогда
	//	возврат Истина;
	//КонецЕсли;
	ДокПоступление=ДокументОснование.Распоряжение;
	Если Не ЗначениеЗаполнено(ДокПоступление) Тогда
		возврат Ложь;
	КонецЕсли;
	Если Не ДокПоступление.Проведен Тогда
		возврат Ложь;
	КонецЕсли; 
	//Если ТипЗнч(ДокПоступление)=Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда Ведомость делается на одну номенклатуру, нельзя проверять весь документ
	//	Если Не Товары.Итог("Количество")=ДокПоступление.Товары.Итог("Количество") Тогда
	//		возврат Ложь;
	//	КонецЕсли; 
	//иначеЕсли ТипЗнч(ДокПоступление)=Тип("ДокументСсылка.ПоступлениеТоваровИзПереработки") Тогда
	//	Если Не Товары.Итог("Количество")=ДокПоступление.Продукция.Итог("Количество") Тогда
	//		возврат Ложь;
	//	КонецЕсли; 
	//КонецЕсли; 
	возврат Истина;
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	НовыйМеханизмПрихода=Истина;//ВспомогательныеФункции.НовыйМеханизмПрихода(ДокументОснование.СпецТипНакладной,ДокументОснование.Дата);
	//Если РольДоступна("ПолныеПрава") и РежимЗаписи=РежимЗаписиДокумента.Запись и ТолькоЗаписатьИнтДокумент Тогда
	//	возврат;
	//КонецЕсли; 
	//
	//Если Не СпецТипНакладной=ДокументОснование.СпецТипНакладной Тогда
	//	СпецТипНакладной=ДокументОснование.СпецТипНакладной;
	//КонецЕсли; 
	//Если Не ЗначениеЗаполнено(СкладСырья) Тогда
	//	СкладСырья=ДокументОснование.СкладСырья;
	//КонецЕсли; 
	Если Завершена Тогда
		Если Не СогласованиеОтклоненийСогласование.Найти(Ложь,"Завершено")=Неопределено тогда
			Сообщить("Существуют не завершенные Согласования. Завершить документ нельзя!",СтатусСообщения.Внимание);
			Завершена=Ложь;
			Отказ=Истина;
		КонецЕсли;
	КонецЕсли; 
	
	
	//{ it_1c3 Гадецкий 25072014
	Если ЭтоНовый() тогда
		Если Завершена Тогда
			ДатаЗавершена=ТекущаяДата();
		КонецЕсли; 
	Иначе	
		СтрокаПО = ДокументОснование.Товары.Найти(ЭтотОбъект.Ссылка,"КСП_ПроверочнаяВедомость");		
		Если СтрокаПО=Неопределено Тогда
			возврат;
		КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(СтрокаПО.Характеристика) Тогда
			//Сервисныефункции.ВыдатьИнформацию("Не указана характеристика в строке прих. ордера ("+СокрЛП(ДокументОснование) +") "+СтрокаПО.НомерСтроки+"!!!");
			Сообщить("Не указана характеристика в строке прих. ордера ("+СокрЛП(ДокументОснование) +") "+СтрокаПО.НомерСтроки+"!!!");
			Характеристика = ЭтотОбъект.Ссылка.Характеристика;	
			Возврат;                                                                    
		Иначе 
			Если СтрокаПО.Характеристика <> Характеристика Тогда			
				//Сервисныефункции.ВыдатьИнформацию("Характеристика в шапке проверочной ведомости не соответствует характеристике в строке прих. ордера ("+СокрЛП(ДокументОснование) +") "+СтрокаПО.НомерСтроки+"!!!");
				Сообщить("Характеристика в шапке проверочной ведомости не соответствует характеристике в строке прих. ордера ("+СокрЛП(ДокументОснование) +") "+СтрокаПО.НомерСтроки+"!!!");
				Характеристика = СтрокаПО.Характеристика;	
				//Отказ = Истина;
				Возврат;
			КонецЕсли;	
		КонецЕсли;
		Если Завершена и Не Ссылка.Завершена=Завершена Тогда
			ДатаЗавершена=ТекущаяДата();
		КонецЕсли; 
	КонецЕсли;
	//**** Алекс Ц.
	Если Дата>Дата(2010,07,01) И РежимЗаписи=РежимЗаписиДокумента.Проведение И НЕ Завершена Тогда
		РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
	КонецЕсли;
	
	Если Дата<ДокументОснование.Дата+3 Тогда
		Дата=ДокументОснование.Дата+3;
	КонецЕсли; 
	//Курдюмов 06042016
	Если НовыйМеханизмПрихода тогда
		Если Не ДокументОснование.Проведен тогда
			РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
			Сообщить("Приходного ордера, должен быть проведен!",СтатусСообщения.Важное);
		КонецЕсли;
		Если Завершена тогда
			//Если Не ПроверкаНаСоответствиеПриходнойНакладной() тогда
			//	Сообщить("Данные по кол-ву в приходном ордере не совпадают с ко-вом в приходной накладной или приходная накладная не создана!");
			//	Отказ=Истина;
			//	Завершена=Ложь;
			//	РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
			//	возврат;
			//КонецЕсли;
			
			ФлагВведенПрихНакл=Истина;
			ДокПоступление=ДокументОснование.Распоряжение;
			Если Не ЗначениеЗаполнено(ДокПоступление) Тогда
				ФлагВведенПрихНакл=Ложь;
			иначеЕсли	Не ДокПоступление.Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
				ФлагВведенПрихНакл=Ложь;
			КонецЕсли; 
			Если Не ФлагВведенПрихНакл тогда
				РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
				Завершена=Ложь;
				Сообщить("Документ поступление, введенный на основе Приходного ордера, должен быть проведен!",СтатусСообщения.Важное);
			КонецЕсли;
			Если Завершена Тогда
				Завершена=ПроверкаНаРазмещениеАдресныйСклад();
			КонецЕсли; 		
		КонецЕсли;
	КонецЕсли; 
	//{Курдюмов А.Н.
	//Проверка на проведенный документ предварительный резерв
	//Если Не ЭтотОбъект.ЭтоНовый() и Не РольДоступна("ПолныеПрава") и Не ТолькоЗаписатьИнтДокумент тогда
	//	Если ВспомогательныеФункции.СуществуетПредварительныйРезервПофакту(Ссылка,Номенклатура,Характеристика,КлючСтроки) тогда
	//		Если Не ЗначениеЗаполнено(ДокументОснование.ДокументФактПрихода) тогда
	//			ОтветственныйМенеджер=ДокументОснование.ОтветственныйМенеджерСнабжения;
	//		иначе
	//			ОтветственныйМенеджер=ДокументОснование.ДокументФактПрихода.Ответственный;
	//		КонецЕсли;
	//		Сообщить("Существует созданное отделом Снабжения распределение под предварительный резерв ('Предварительный резерв по факту'). Чтобы изменить документ, менеджеру отдела снабжения "+СокрЛП(ОтветственныйМенеджер)+" снять с проведения свой документ 'Предварительный резерв по факту'",СтатусСообщения.Важное);
	//		Отказ=Истина;
	//		возврат;
	//	КонецЕсли;
	//КонецЕсли;
	//}Курдюмов А.Н.  
	Если ТипЗнч(ДокументОснование.Распоряжение) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		Если Не Контрагент=ДокументОснование.Распоряжение.Контрагент тогда
			Контрагент=ДокументОснование.Распоряжение.Контрагент;
		КонецЕсли;
	КонецЕсли;
	Если НовыйМеханизмПрихода  Тогда
		Если Не Дата>ДокументОснование.Дата Тогда
			Дата=ДокументОснование.Дата+1;
		КонецЕсли; 
		Если Не Завершена тогда
			РежимЗаписи=?(ЭтотОбъект.Проведен,РежимЗаписиДокумента.ОтменаПроведения,РежимЗаписиДокумента.Запись);	
		КонецЕсли; 
	КонецЕсли;

	ТекущийРежимЗаписиДокумента=РежимЗаписи;
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		ТолькоЗаписатьИнтДокумент=Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПлановаяДатаПотребности) Тогда
		ПлановаяДатаПотребности=ДатаПотребностиДляПриемкиНаСклад(Номенклатура,Характеристика);
	КонецЕсли; 

	
	Если Не РольДоступна("ПолныеПрава") и Не Ответственный = ПараметрыСеанса.ТекущийПользователь тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
	
	//Контроль проверки СТК и Конфекция с 17072020
	//Если Завершена и ДатаЗавершена>'20200719' и Номенклатура.ПринадлежитЭлементу(Справочники.Номенклатура.Фурнитура) и Номенклатура.ВнутреннийТовар.Владелец.Владелец.КонтрольСТК и (Не ПрошелКонтрольИнженерПО или Не КонтрольКачества) тогда
	//	Сообщить("Документ не прошел контроль СТК и Конфекционеров!",СтатусСообщения.Внимание);	
	//КонецЕсли;
КонецПроцедуры       
Функция ПроверкаНаРазмещениеАдресныйСклад(ВыводитьПредупреждения=Истина) экспорт
	//18-07-2015 Водолазова
	СкладДляПоступления=?(ЗначениеЗаполнено(Склад),Склад,ДокументОснование.Склад);
	Если СкладДляПоступления.ИспользоватьАдресноеХранение и СкладДляПоступления.ДатаНачалаАдресногоХраненияОстатков<=Дата и Не СпецТипНакладной=Перечисления.СпецТипНакладной.ПряжаЛот Тогда
		Запрос = Новый Запрос;	
		Запрос.Текст="ВЫБРАТЬ
		|	ОтборРазмещениеТоваров.Ссылка КАК ДокОтборРазмещение
		|ИЗ
		|	Документ.ОтборРазмещениеТоваров КАК ОтборРазмещениеТоваров
		|ГДЕ
		|	ОтборРазмещениеТоваров.Проведен
		|	И ОтборРазмещениеТоваров.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОтборовРазмещенийТоваров.ВыполненоБезОшибок)
		|	И ОтборРазмещениеТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтбораРазмещенияТоваров.Размещение)
		|	И ОтборРазмещениеТоваров.Распоряжение = &Распоряжение";
		
		Запрос.УстановитьПараметр("Распоряжение",Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если НЕ Выборка.Следующий() Тогда
			Если ВыводитьПредупреждения Тогда
				#Если Клиент Тогда
					Предупреждение("Невозможно провести документ. Склад хранения сырья с адресным хранением. Необходимо произвести размещение товаров");
				#КонецЕсли
				Сообщить("Невозможно провести документ. Склад хранения сырья с адресным хранением. Необходимо произвести размещение товаров");
			КонецЕсли; 
			Возврат Ложь;
		иначе
			//Если есть ошибка
			Если Выборка.ДокОтборРазмещение.ПолучитьОбъект().КорректностьОтборИРазмещение() тогда
				Если ВыводитьПредупреждения Тогда
					#Если Клиент Тогда
						Предупреждение("Невозможно провести документ. Склад хранения сырья с адресным хранением. Документ отбор и размещение не соответсвует по кол-ву распоряжению!",60);
					#КонецЕсли
					Сообщить("Невозможно провести документ. Склад хранения сырья с адресным хранением. Документ отбор и размещение не соответсвует по кол-ву распоряжению!");
				КонецЕсли; 
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	возврат Истина;
КонецФункции // ()
Функция ПолучитьСуммуПоступленияПоНоменклатуре(Номенклатура,Характеристика,КоличествоПоставщика=0) Экспорт
	ДокПоступления=ДокументОснование.ПолучитьОбъект().Распоряжение;
	Если Не ЗначениеЗаполнено(ДокПоступления) тогда
		возврат 0;
	КонецЕсли;
	СтрОтбора=новый Структура;
	СтрОтбора.Вставить("Номенклатура",Номенклатура);
	СтрОтбора.Вставить("Характеристика",Характеристика);
	Если ТипЗнч(ДокПоступления)=Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		НайдСтроки=ДокПоступления.Товары.НайтиСтроки(СтрОтбора);
	иначеЕсли ТипЗнч(ДокПоступления)=Тип("ДокументСсылка.ПоступлениеТоваровИзПереработки") Тогда
		возврат 0;
	КонецЕсли; 
	СуммаПоставщика=0;
	Для каждого ТекНайдСтрока Из НайдСтроки Цикл
		Если ЗначениеЗаполнено(КоличествоПоставщика) и Не КоличествоПоставщика=ТекНайдСтрока.Количество Тогда
			продолжить;	
		КонецЕсли; 
		Если НЕ ДокПоступления.ЦенаВключаетНДС Тогда
			СуммаПоставщика=СуммаПоставщика+ТекНайдСтрока.Сумма+ТекНайдСтрока.СуммаНДС;
		иначе
			СуммаПоставщика=СуммаПоставщика+ТекНайдСтрока.Сумма;
		КонецЕсли; 
	КонецЦикла; 
	Если НЕ ДокПоступления.Валюта=Константы.ВалютаРегламентированногоУчета.Получить() Тогда
		СуммаПоставщика = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(СуммаПоставщика,  ДокПоступления.Валюта,Константы.ВалютаРегламентированногоУчета.Получить(),
				   ДокПоступления.КурсЧислитель, 1,1,1);
	КонецЕсли; 
	возврат СуммаПоставщика;
КонецФункции

Функция ДатаПотребностиДляПриемкиНаСклад(Номенклатура,ХарактеристикаНоменклатуры) экспорт
	//Запрос = новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ДвиженияМатериаловОбороты.ЗаказНаВыпуск.ДатаЗапуска КАК ДатаЗапуска,
	//|	СУММА(ДвиженияМатериаловОбороты.ПланируемаяОтгрузкаСоСкладаОборот) КАК ПланируемаяОтгрузкаСоСкладаОборот
	//|ИЗ
	//|	РегистрНакопления.ДвиженияМатериалов.Обороты(&CДаты
	//|			,
	//|			,
	//|			,
	//|			Номенклатура  =  &Номенклатура
	//|				И ХарактеристикаНоменклатуры  =  &ХарактеристикаНоменклатуры) КАК ДвиженияМатериаловОбороты
	//|ГДЕ
	//|	ДвиженияМатериаловОбороты.ПланируемаяОтгрузкаСоСкладаОборот > 0
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ДвиженияМатериаловОбороты.ЗаказНаВыпуск.ДатаЗапуска
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ДатаЗапуска";

	//Запрос.УстановитьПараметр("CДаты",'20150902');
	//Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	//Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	возврат Выборка.ДатаЗапуска;	
	//КонецЕсли; 
	возврат Неопределено;
КонецФункции 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	////{Курдюмов А.Н.
	//ФлПровести=Истина;
	//Если Не Завершена тогда
	//	ФлПровести=Ложь;
	//Конецесли;
	//ВспомогательныеФункции.ДвижениеПоРегиструСписокДокументовНаОтработку(Ссылка,Номенклатура,ХарактеристикаНоменклатуры,КлючСтроки,,ФлПровести);
	////}Курдюмов А.Н.
	
    ДвижениеПоРегистрамПретензии();
	//Бурлаков М.Б. - начало
	//Заявка 6269 
	ДвиженияПоРегиструСведенияОПроверкеЗакупаемойНоменклатуры(Отказ);
	//Бурлаков М.Б. - конец 
	// < Кодерлайн Софт-портал 2024.07.29 Добрыгин Михаил
	// Проверка для выбора серий с признаком качество
	ДвижениеПоРегиструКачество(); 
	// >  Кодерлайн Софт-портал 2024.07.29 Добрыгин Михаил   
	КонецПроцедуры
Процедура ДвижениеПоРегиструКачество()
	//Кодерлайн Софт-портал 2024.07.29 Добрыгин Михаил
    Если Не Завершена Тогда
		возврат;
	КонецЕсли;
	Для каждого тов из Товары Цикл
		ОтборПоСериям= Новый Структура("Номенклатура,Характеристика",Тов.Номенклатура,Тов.Характеристика);
	    НайденныеСерии = Серии.НайтиСтроки(ОтборПоСериям);
		Если НайденныеСерии.Количество() = 0 Тогда
			ДвижениеПоКачеству=Движения.КСП_ПаспортКачества.Добавить();
			ДвижениеПоКачеству.Период=Дата;
			ДвижениеПоКачеству.Регистратор=Ссылка;
			ЗаполнитьЗначенияСвойств(ДвижениеПоКачеству,тов); 
		Иначе
			Для каждого стр из НайденныеСерии Цикл 
				ДвижениеПоКачеству=Движения.КСП_ПаспортКачества.Добавить();
				ДвижениеПоКачеству.Период=Дата;
				ДвижениеПоКачеству.Регистратор=Ссылка;
				ЗаполнитьЗначенияСвойств(ДвижениеПоКачеству,тов);
				ДвижениеПоКачеству.Серия=стр.Серия;				
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла;    
	Движения.КСП_ПаспортКачества.Записать();
КонецПроцедуры
Процедура ДвижениеПоРегистрамПретензии()
	
	Если Не Завершена Тогда
		возврат;
	КонецЕсли;
	//Бурлаков М.Б. - начало
	//Заявка 5305
	Если (Не СпецТипНакладной=Перечисления.КСП_СпецТипНакладной.ПряжаЛот) и (СпецТипНакладной <> Перечисления.КСП_СпецТипНакладной.Фурнитура) тогда
		возврат;
	КонецЕсли;
	//Бурлаков М.Б. - конец
	Если Не ЗначениеЗаполнено(Склад) Тогда
		Склад=ДокументОснование.Склад;
		//Если НовыйМеханизмПрихода тогда
		//	СкладСырья=ДокументОснование.СкладСырья;
		//КонецЕсли;
	КонецЕсли; 
	//Если Не СкладСырья=Справочники.Склады.УчастокПодготовкиИСкладированияТкани тогда
	//	//Бурлаков М.Б. - начало
	//	//Заявка 5305
	//	Если Номенклатура.ВидНоменклатуры <> Справочники.ВидыНоменклатуры.Фурнитура Тогда
	//		возврат;
	//	КонецЕсли;
	//	//Бурлаков М.Б. - конец		
	//КонецЕсли;
	
	
	ДвижениеПоПретензии=Движения.КСП_Претензии.Добавить();
	ДвижениеПоПретензии.Период=Дата;
	ДвижениеПоПретензии.Регистратор=Ссылка;
	ДвижениеПоПретензии.Номенклатура=Номенклатура;
	ДвижениеПоПретензии.Характеристика=Характеристика;
	ДвижениеПоПретензии.Документ=ДокументОснование;
	ДвижениеПоПретензии.КоличествоПоставщика=ЭтотОбъект.Товары.итог("КоличествоПоставщика");
	ДвижениеПоПретензии.КоличествоФакт=ЭтотОбъект.Товары.итог("Количество");
	ДвижениеПоПретензии.КоличествоБрак=ЭтотОбъект.Товары.итог("КоличествоБрак");
	ПроцентПоКоличеству=0;
	Если ДвижениеПоПретензии.КоличествоФакт<ДвижениеПоПретензии.КоличествоПоставщика Тогда
		ПроцентПоКоличеству=100-Окр(ДвижениеПоПретензии.КоличествоФакт*100/ДвижениеПоПретензии.КоличествоПоставщика,1);
	КонецЕсли; 
	СуммаПоставшика=ПолучитьСуммуПоступленияПоНоменклатуре(Номенклатура,Характеристика,ДвижениеПоПретензии.КоличествоПоставщика);
	
	//Если ДокументОснование.СпецТипНакладной=Перечисления.СпецТипНакладной.ПряжаЛот Тогда
	Если СпецТипНакладной=Перечисления.КСП_СпецТипНакладной.ПряжаЛот Тогда
		ДопустимыйМинимум=ДвижениеПоПретензии.КоличествоПоставщика*(1-ПроцентКондиции/100);
		ПроцентКолОтОбщегоКондиционногоОбъема=Окр(100-ДвижениеПоПретензии.КоличествоФакт*100/ДопустимыйМинимум,1);
		Если ДвижениеПоПретензии.КоличествоПоставщика<200 Тогда
			Если ПроцентКолОтОбщегоКондиционногоОбъема>1.5 и Окр(СуммаПоставшика*ПроцентКолОтОбщегоКондиционногоОбъема/100,2)>7000 Тогда
				Если Дата>'20161026' Тогда
					ПретензияПроцПоКоличеству=Макс(0,ПроцентКолОтОбщегоКондиционногоОбъема);
				иначе
					ПретензияПроцПоКоличеству=Макс(0,ПроцентПоКоличеству-Номенклатура.ДопустимыйПроцентПоКоличеству);
				КонецЕсли; 
			иначе
				ПретензияПроцПоКоличеству=0;
			КонецЕсли; 
		иначе
			Если ПроцентКолОтОбщегоКондиционногоОбъема>1.5 и Окр(СуммаПоставшика*ПроцентКолОтОбщегоКондиционногоОбъема/100,2)>15000 Тогда
				Если Дата>'20161026' Тогда
					ПретензияПроцПоКоличеству=Макс(0,ПроцентКолОтОбщегоКондиционногоОбъема);
				иначе
					ПретензияПроцПоКоличеству=Макс(0,ПроцентПоКоличеству-Номенклатура.ДопустимыйПроцентПоКоличеству);
				КонецЕсли; 
			иначе
				ПретензияПроцПоКоличеству=0;
			КонецЕсли; 
		КонецЕсли; 
	иначе
		Если ПроцентПоКоличеству>2 и Окр(СуммаПоставшика*ПроцентПоКоличеству/100,2)>15000 Тогда
			ПретензияПроцПоКоличеству=Макс(0,ПроцентПоКоличеству-Номенклатура.ДопустимыйПроцентПоКоличеству);
		иначе
			ПретензияПроцПоКоличеству=0;
		КонецЕсли; 
	КонецЕсли; 
	
	ДвижениеПоПретензии.СуммаПоставшика=СуммаПоставшика;
	ДвижениеПоПретензии.СуммаПретензииПоКоличеству=Окр(СуммаПоставшика*ПретензияПроцПоКоличеству/100,2);
	
	
	ДвижениеРегСведений=Движения.КСП_ДанныеПоПретензиям.Добавить();
	ДвижениеРегСведений.Период=Дата;
	ДвижениеРегСведений.Регистратор=Ссылка;
	ДвижениеРегСведений.Номенклатура=Номенклатура;
	ДвижениеРегСведений.Характеристика=Характеристика;
	ДвижениеРегСведений.Документ=ДокументОснование;
	ДвижениеРегСведений.ПроцентПоКоличеству=ПроцентПоКоличеству;
	ДвижениеРегСведений.СтатусПретензии=Справочники.КСП_СтатусыПретензии.ОформленПриходСкладом;
	
		
КонецПроцедуры
//}Курдюмов

//Бурлаков М.Б. - начало
//Заявка 6269 
Функция ПолучитьТаблицуДвиженийПоРегиструСведенияОПроверкеЗакупаемойНоменклатуры()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроверочнаяВедомостьТовары.Номенклатура КАК Номенклатура,
		|	ПроверочнаяВедомостьТовары.Характеристика КАК ХарактеристикаНоменклатуры,
		|	ПроверочнаяВедомостьТовары.Ссылка.ДокументОснование КАК ПриходныйОрдер,
		|	ПроверочнаяВедомостьТовары.Количество * ПроверочнаяВедомостьТовары.Коэффициент КАК Количество,
		|	ПроверочнаяВедомостьТовары.Ссылка КАК Регистратор,
		|	ПроверочнаяВедомостьТовары.Ссылка.Дата КАК Период,
		|	ИСТИНА КАК Активность
		|ИЗ
		|	Документ.КСП_ПроверочнаяВедомость.Товары КАК ПроверочнаяВедомостьТовары
		|ГДЕ
		|	ПроверочнаяВедомостьТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ДвиженияПоРегиструСведенияОПроверкеЗакупаемойНоменклатуры(Отказ)
	НаборДвижений = Движения.КСП_СведенияОПроверкеЗакупаемойНоменклатуры;
	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ПолучитьТаблицуДвиженийПоРегиструСведенияОПроверкеЗакупаемойНоменклатуры();
	
	Если Не Отказ Тогда
		Движения.КСП_СведенияОПроверкеЗакупаемойНоменклатуры.ВыполнитьДвижения();
		Движения.КСП_СведенияОПроверкеЗакупаемойНоменклатуры.Записать();
	КонецЕсли; 
КонецПроцедуры
//Бурлаков М.Б. - конец

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Очистить();
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
