
Функция КСП_НайтиПодарочныеСертификаты(Номер) Экспорт
	
	СтруктураВозврата = Новый Структура("Ссылка,Номинал,Штрихкод,СерийныйНомер,Активирован,ВидСертификата");
	
	СтруктураВозврата.Активирован = Ложь;
	
	Сертификат = Справочники.ПодарочныеСертификаты.НайтиПоКоду(Номер);
	
	Если ЗначениеЗаполнено(Сертификат) Тогда 
		
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодарочныеСертификаты.Ссылка КАК Ссылка,
		|	ПодарочныеСертификаты.Владелец КАК ВидСертификата,
		|	ПодарочныеСертификаты.Владелец.Номинал КАК Номинал,
		|	ПодарочныеСертификаты.Код КАК СерийныйНомер,
		|	ПодарочныеСертификаты.Штрихкод КАК Штрихкод,
		|	ВЫБОР
		|		КОГДА АктивацияПодарочныхСертификатов.ПодарочныйСертификат ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Активирован
		|ИЗ
		|	Справочник.ПодарочныеСертификаты КАК ПодарочныеСертификаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктивацияПодарочныхСертификатов КАК АктивацияПодарочныхСертификатов
		|		ПО ПодарочныеСертификаты.Ссылка = АктивацияПодарочныхСертификатов.ПодарочныйСертификат
		|ГДЕ
		|	ПодарочныеСертификаты.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Сертификат);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураВозврата, ВыборкаДетальныеЗаписи);
			
		КонецЦикла;
		
			
	КонецЕсли;
	
	
	Возврат СтруктураВозврата;
		
КонецФункции