// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт   
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ПустаяСсылка()));
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = ОбъектМетаданных.Имя;
	КомандаПечати.Представление = ОбъектМетаданных.Синоним;
	КомандаПечати.МенеджерПечати    = ОбъектМетаданных.ПолноеИмя();
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.Порядок = 10; 	
КонецПроцедуры
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт    	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;                                                            	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КСП_АктПриемкиПоКачеству") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "КСП_АктПриемкиПоКачеству", "Акт приемки по качеству", ПечатьАктаПриемкиПоКачеству(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПечатьАктаПриемкиПоКачеству(МассивСсылок, ОбъектыПечати = Неопределено) Экспорт
	Ссылка = МассивСсылок.Получить(0);
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 10;
	ТабДок.ПолеСлева = 20;
	ТабДок.ПолеСнизу = 10;
	ТабДок.ПолеСправа = 10;
	ТабДок.ТолькоПросмотр = Истина;
	
	Макет = ПолучитьМакет("АктПриемкиПоКачеству");
	ОбластьАкт = Макет.ПолучитьОбласть("Акт");
	ОбластьЗаголовокПриложение = Макет.ПолучитьОбласть("ЗаголовокПриложение");
	ОбластьИзображенияДефектов = Макет.ПолучитьОбласть("ИзображенияДефектов");
	
	ОбластьАкт.Параметры.Заполнить(Ссылка);
	ОбластьАкт.Параметры.Дата = Формат(Ссылка.Дата, "ДФ=dd.MM.yyyy");
	ФИООтветственный = ФизическиеЛицаУТ.ФамилияИмяОтчество(Ссылка.Ответственный.ФизическоеЛицо, Ссылка.Дата);
	ОбластьАкт.Параметры.Ответственный = ФИООтветственный.Фамилия + " " + ФИООтветственный.Имя + " " + ФИООтветственный.Отчество;
	ОбластьАкт.Параметры.ДатаПоступления = Ссылка.ДокументОснование.ДатаПоступления;
	ФирменныйБланк = ПолучитьСтандартПредприятияНаПечатнуюФорму(Ссылка, "АктПриемкиПоКачеству", "Акт");
	Если ТипЗнч(ФирменныйБланк) = Тип("ХранилищеЗначения") Тогда
		ФирменныйБланк = ФирменныйБланк.Получить();
	КонецЕсли;
	ОбластьАкт.Рисунки.ФирменныйБланк.Картинка = ФирменныйБланк;
	ЧекЛистПроверкиКачестваПряжи = Ссылка.ДокументОснование.ДокументОснование;
	ЧекЛистПроверкиКачестваТестовыхОтвязов = Ссылка.ДокументОснование;
	ТоварыИзПоступления = Ссылка.ДокументОснование.ДокументОснование.ДокументОснование.ДокументОснование.Товары;
	ПутьКПапкеИзображенийПоЧекЛистамПроверкиТестовыхОтвязов = Константы.ксп_ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваТестовыхОтвязов.Получить();
	ПустаяКартинка = Новый Картинка;
	ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи = Константы.ксп_ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи.Получить();
	Для Каждого СтрокаТовары Из Ссылка.Товары Цикл
		Если СтрокаТовары.НомерСтроки <> 1 Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ОбластьАкт.Параметры.Заполнить(СтрокаТовары);
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("КлючСтроки", СтрокаТовары.КлючСтроки);
		СтрокаОписанияНедостатков = Ссылка.ОписаниеНедостатков.НайтиСтроки(СтруктураПоиска);
		Если СтрокаОписанияНедостатков.Количество() > 0 Тогда
			ОбластьАкт.Параметры.ОписаниеВыявленныхНедостатковПродукции = СокрЛП(СтрокаОписанияНедостатков[0].ОписаниеВыявленныхНедостатковПродукции);
		КонецЕсли;
		ОбластьАкт.Параметры.ПроцентБрака = СтрокаТовары.КоличествоБрака * 100 / СтрокаТовары.Количество;
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура", СтрокаТовары.Номенклатура);
		СтруктураПоиска.Вставить("Характеристика", СтрокаТовары.Характеристика);
		ОбластьАкт.Параметры.ЧислоЛотов = ТоварыИзПоступления.НайтиСтроки(СтруктураПоиска).Количество();
		ТабДок.Вывести(ОбластьАкт);
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДок.Вывести(ОбластьЗаголовокПриложение);
		ОтборФотокПоПервомуЭтапу = Новый Структура;
		ОтборФотокПоПервомуЭтапу.Вставить("ЭтапПроверки", Перечисления.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.ВизуальныйКонтроль);
		ФотоПервогоЭтапа = ЧекЛистПроверкиКачестваПряжи.ФотоДефектов.НайтиСтроки(ОтборФотокПоПервомуЭтапу);
		КоличествоФотоПервогоЭтапа = ФотоПервогоЭтапа.Количество();
		ОтборФотокПоВторомуЭтапу = Новый Структура;
		ОтборФотокПоВторомуЭтапу.Вставить("ЭтапПроверки", Перечисления.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.КонтрольнаяПеремотка);
		ФотоВторогоЭтапа = ЧекЛистПроверкиКачестваПряжи.ФотоДефектов.НайтиСтроки(ОтборФотокПоВторомуЭтапу);
		КоличествоФотоВторогоЭтапа = ФотоВторогоЭтапа.Количество();
		Если КоличествоФотоПервогоЭтапа > КоличествоФотоВторогоЭтапа Тогда
			МаксимальноеКоличествоФотокПоЭтапу = КоличествоФотоПервогоЭтапа;
		Иначе
			МаксимальноеКоличествоФотокПоЭтапу = КоличествоФотоВторогоЭтапа;
		КонецЕсли;
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОбластьИзображенияДефектов);
		Для ПозицияФото = 0 По МаксимальноеКоличествоФотокПоЭтапу-1 Цикл
			Если ПозицияФото <= КоличествоФотоПервогоЭтапа - 1 Тогда
				Файл = ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи + СтрЗаменить(ФотоПервогоЭтапа[ПозицияФото].ПутьКФайлу, ".\\", "\");
				ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта1.Картинка = Новый Картинка(Файл);
			Иначе
				ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта1.Картинка = ПустаяКартинка;
			КонецЕсли;
			Если ПозицияФото <= КоличествоФотоВторогоЭтапа - 1 Тогда
				Файл = ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи + СтрЗаменить(ФотоВторогоЭтапа[ПозицияФото].ПутьКФайлу, ".\\", "\");
				ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта2.Картинка = Новый Картинка(Файл);
			Иначе
				ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта2.Картинка = ПустаяКартинка;
			КонецЕсли;
			Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок, МассивОбластейДляПроверки) Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ТабДок.Вывести(ОбластьИзображенияДефектов);
		КонецЦикла;
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("КлючСтроки", СтрокаТовары.КлючСтроки); 
		ФотоДефектов = ЧекЛистПроверкиКачестваТестовыхОтвязов.ФотоДефектов.НайтиСтроки(СтруктураОтбора);
		ИндексФото = 1;
		Для Каждого СтрокаФотоДефектов Из ФотоДефектов Цикл
			Файл = ПутьКПапкеИзображенийПоЧекЛистамПроверкиТестовыхОтвязов + СтрЗаменить(СтрокаФотоДефектов.ПутьКФайлу, ".\\", "\");
			Выполнить("ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта" + ИндексФото + ".Картинка = Новый Картинка(Файл)");
			Если ИндексФото < 2 Тогда
				ИндексФото = ИндексФото + 1;
			Иначе
				ИндексФото = 1;
				Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок, МассивОбластейДляПроверки) Тогда
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				ТабДок.Вывести(ОбластьИзображенияДефектов);
			КонецЕсли;
		КонецЦикла;
		Если ИндексФото <= 2 Тогда
			Для ТекущийИндексФото = ИндексФото По 2 Цикл
				Выполнить("ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта" + ТекущийИндексФото + ".Картинка = Новый Картинка");
			КонецЦикла;
			Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок, МассивОбластейДляПроверки) Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ТабДок.Вывести(ОбластьИзображенияДефектов);
		КонецЕсли;
	КонецЦикла; 
	
	Возврат ТабДок;
КонецФункции
//Общий механизм получения фирменных бланков и иных стандартизированных форм для макетов печатных форм
Функция ПолучитьСтандартПредприятияНаПечатнуюФорму(Объект, ИмяМакета, ИмяОбластиМакета) Экспорт
	//ТипВид = ТипЗначенияСтр(Объект);
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПечатныеФормыСтандартыПредприятия.Картинка.Хранилище КАК Картинка
	//	|ИЗ
	//	|	Справочник.КСП_ПечатныеФормыСтандартыПредприятия КАК ПечатныеФормыСтандартыПредприятия
	//	|ГДЕ
	//	|	ПечатныеФормыСтандартыПредприятия.Владелец = &Организация
	//	|	И ПечатныеФормыСтандартыПредприятия.ТипОбъекта = &ТипОбъекта
	//	|	И ПечатныеФормыСтандартыПредприятия.ВидОбъекта = &ВидОбъекта
	//	|	И ПечатныеФормыСтандартыПредприятия.Макет = &ИмяМакета
	//	|	И ПечатныеФормыСтандартыПредприятия.ОбластьМакета = &ИмяОбластиМакета";

	//Запрос.УстановитьПараметр("ВидОбъекта", ТипВид.Вид);
	//Запрос.УстановитьПараметр("ИмяМакета", ИмяМакета);
	//Запрос.УстановитьПараметр("ИмяОбластиМакета", ИмяОбластиМакета);
	//Запрос.УстановитьПараметр("Организация", Объект.Организация);
	//Запрос.УстановитьПараметр("ТипОбъекта", ТипВид.Тип);

	//Результат = Запрос.Выполнить();

	//ВыборкаДетальныеЗаписи = Результат.Выбрать();

	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	Возврат ВыборкаДетальныеЗаписи.Картинка;
	//КонецЦикла;

	Возврат БиблиотекаКартинок.Параметры;   
КонецФункции
//Бурлаков М.Б. - конец         
//Бурлаков М.Б. - начало
Функция ТипЗначенияСтр(Знач Объект) Экспорт 	
	Если ТипЗнч(Объект) = Тип("Массив") Тогда
		СписокТипов = Новый Массив;
		СписокВидов = Новый Массив;
		Для Каждого ТекОбъект Из Объект Цикл
			ТипСтр = ТипЗначенияСтр(ТекОбъект);
			Если СписокТипов.Найти(ТипСтр.Тип) = Неопределено Тогда
				СписокТипов.Добавить(ТипСтр.Тип);
			КонецЕсли;
			Если СписокВидов.Найти(ТипСтр.Вид) = Неопределено Тогда
				СписокВидов.Добавить(ТипСтр.Вид);
			КонецЕсли;
		КонецЦикла;
		
		Результат = Новый Структура;
		Результат.Вставить("Тип","");
		Результат.Вставить("Вид","");
		
		Если СписокТипов.Количество() = 1 Тогда
			Результат.Тип = СписокТипов[0];
			Если СписокВидов.Количество() = 1 Тогда
				Результат.Вид = СписокВидов[0];
			КонецЕсли;
		Иначе
			Результат.Тип = "Неопределенный";
		КонецЕсли; 			
	Иначе
		Если ТипЗнч(Объект) = Тип("Тип") Тогда
			ТипЗначения = Объект;
			Объект = Метаданные.НайтиПоТипу(Объект);
			
		ИначеЕсли ТипЗнч(Объект) = Тип("ОписаниеТипов") Тогда
			Результат = ТипЗначенияСтр(Объект.Типы());
			Возврат Результат;
			
		ИначеЕсли ТипЗнч(Объект) <> Тип("ОбъектМетаданных") Тогда
			ТипЗначения = ТипЗнч(Объект);
			Объект = Метаданные.НайтиПоТипу(ТипЗначения);
		КонецЕсли;
		
		Результат = Новый Структура;
		Результат.Вставить("Тип","");
		Результат.Вставить("Вид","");

		Если Объект <> Неопределено Тогда
			Если Метаданные.Справочники.Содержит(Объект) Тогда
			    Результат.Тип = "Справочник";
			ИначеЕсли Метаданные.Документы.Содержит(Объект) Тогда
			    Результат.Тип = "Документ";
			ИначеЕсли Метаданные.Перечисления.Содержит(Объект) Тогда
			    Результат.Тип = "Перечисление";
			ИначеЕсли Метаданные.Отчеты.Содержит(Объект) Тогда
			    Результат.Тип = "Отчет";
			ИначеЕсли Метаданные.Обработки.Содержит(Объект) Тогда
			    Результат.Тип = "Обработка";
			ИначеЕсли Метаданные.ЖурналыДокументов.Содержит(Объект) Тогда
			    Результат.Тип = "ЖурналДокументов"; //Или Журналы документов?
			ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(Объект) Тогда
			    Результат.Тип = "ПланВидовХарактеристик"; //Или Планы видов характеристик?
			ИначеЕсли Метаданные.ПланыСчетов.Содержит(Объект) Тогда
			    Результат.Тип = "ПланСчетов"; //Или Планы счетов?
			ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(Объект) Тогда
			    Результат.Тип = "ПланВидовРасчета"; //Или Планы видов расчета?
			ИначеЕсли Метаданные.РегистрыСведений.Содержит(Объект) Тогда
			    Результат.Тип = "РегистрСведений"; //Или Регистры сведений?
			ИначеЕсли Метаданные.РегистрыНакопления.Содержит(Объект) Тогда
			    Результат.Тип = "РегистрНакопления"; //Или Регистры накопления?
			ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(Объект) Тогда
			    Результат.Тип = "РегистрБухгалтерии"; //Или Регистры бухгалтерии?
			ИначеЕсли Метаданные.РегистрыРасчета.Содержит(Объект) Тогда
			    Результат.Тип = "РегистрРасчета"; //Или Регистры расчета?
			ИначеЕсли Метаданные.БизнесПроцессы.Содержит(Объект) Тогда
			    Результат.Тип = "БизнесПроцесс"; //Или Бизнес-процессы?
			ИначеЕсли Метаданные.Задачи.Содержит(Объект) Тогда
			    Результат.Тип = "Задача"; //Или Задачи?
			КонецЕсли;
			Результат.Вид = Объект.Имя;
		Иначе
			Результат.Тип = Строка(ТипЗначения);
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;
КонецФункции

