Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	РегламентированнаяОтчетность.ДобавитьПрефиксОрганизации(ЭтотОбъект, Префикс);
КонецПроцедуры

Функция ПроверкаЗавершенияКонтроляКачестваТестовыхОтвязов(ЧекЛистПроверкиКачестваТестовыхОтвязов)
	ПроверкаКачестваТестовыхОтвязовЗавершена = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.НомерСтроки,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Номенклатура,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Характеристика
		|ИЗ
		|	Документ.КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов.Товары КАК ЧекЛистПроверкиКачестваТестовыхОтвязовТовары
		|ГДЕ
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Ссылка = &ЧекЛистПроверкиКачестваТестовыхОтвязов
		|	И ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.ПроверкаЗавершена = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ЧекЛистПроверкиКачестваТестовыхОтвязов", ЧекЛистПроверкиКачестваТестовыхОтвязов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПроверкаКачестваТестовыхОтвязовЗавершена = Ложь;
		Сообщить("В документе основании по номенклатуре " + ВыборкаДетальныеЗаписи.Номенклатура + " " + ВыборкаДетальныеЗаписи.Характеристика + " в строке " + ВыборкаДетальныеЗаписи.НомерСтроки + " не был выполнен контроль качества.", СтатусСообщения.Внимание);
	КонецЦикла;
	
	Если Не ПроверкаКачестваТестовыхОтвязовЗавершена Тогда
		Сообщить("Ввод на основании невозможен. Сначала завершите контроль качества!", СтатусСообщения.Важное);
	КонецЕсли;
	
	Возврат ПроверкаКачестваТестовыхОтвязовЗавершена;
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов") Тогда    		
		Если Не ПроверкаЗавершенияКонтроляКачестваТестовыхОтвязов(ДанныеЗаполнения) Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		// Заполнение шапки
		ПереченьНормативнойДокументации = "ГОСТ 6611.0-73 (СТ СЭВ 2462-80) Нити текстильные. Правила приемки (с Изменениями №1, 2, 3, 4)";
		КлиматическиеУсловия = "Относительная влажность воздуха - (65+-2)%, температура воздуха - (20+-2) С";
		Комментарий = " Введен на основании " + ДанныеЗаполнения;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Для Каждого ТекСтрокаКонтрольКачества Из ДанныеЗаполнения.КонтрольКачества Цикл
			НоваяСтрока = КонтрольКачества.Добавить();
			НоваяСтрока.КлючСтроки = ТекСтрокаКонтрольКачества.КлючСтроки;
			НоваяСтрока.Норматив = ТекСтрокаКонтрольКачества.Норматив;
			НоваяСтрока.Отклонение = ТекСтрокаКонтрольКачества.Отклонение;
			НоваяСтрока.ПунктПроверки = ТекСтрокаКонтрольКачества.ПунктПроверки;
			НоваяСтрока.Факт = ТекСтрокаКонтрольКачества.Факт;
		КонецЦикла;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
			НоваяСтрока.КлючСтроки = ТекСтрокаТовары.КлючСтроки;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.КоличествоБрака = ТекСтрокаТовары.КоличествоБрака;
			НоваяСтрока.КоличествоДляТестовогоОтвяза = ТекСтрокаТовары.КоличествоДляТестовогоОтвяза;
			НоваяСтрока.Коэффициент = ТекСтрокаТовары.Коэффициент;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.ПоЛотам = ТекСтрокаТовары.ПоЛотам;
			НоваяСтрока.Характеристика = ТекСтрокаТовары.Характеристика;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТаблицуРезультатыПриемкиПряжиПоКачеству()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктПриемкиПоКачествуТовары.Ссылка.Организация КАК Организация,
		|	АктПриемкиПоКачествуТовары.Ссылка.Контрагент КАК Контрагент,
		|	АктПриемкиПоКачествуТовары.Номенклатура КАК Номенклатура,
		|	АктПриемкиПоКачествуТовары.Характеристика КАК Характеристика,
		|	АктПриемкиПоКачествуКонтрольКачества.Норматив КАК Норматив,
		|	АктПриемкиПоКачествуКонтрольКачества.Факт КАК Факт,
		|	АктПриемкиПоКачествуКонтрольКачества.Отклонение КАК Отклонение,
		|	АктПриемкиПоКачествуОписаниеНедостатков.ОписаниеВыявленныхНедостатковПродукции КАК ОписаниеВыявленныхНедостатковПродукции,
		|	АктПриемкиПоКачествуТовары.Ссылка КАК Регистратор,
		|	ИСТИНА КАК Активность,
		|	АктПриемкиПоКачествуТовары.Ссылка.Дата КАК Период,
		|	АктПриемкиПоКачествуКонтрольКачества.ПунктПроверки КАК ПунктПроверки
		|ИЗ
		|	Документ.КСП_АктПриемкиПоКачеству.Товары КАК АктПриемкиПоКачествуТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КСП_АктПриемкиПоКачеству.КонтрольКачества КАК АктПриемкиПоКачествуКонтрольКачества
		|		ПО АктПриемкиПоКачествуТовары.Ссылка = АктПриемкиПоКачествуКонтрольКачества.Ссылка
		|			И АктПриемкиПоКачествуТовары.КлючСтроки = АктПриемкиПоКачествуКонтрольКачества.КлючСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КСП_АктПриемкиПоКачеству.ОписаниеНедостатков КАК АктПриемкиПоКачествуОписаниеНедостатков
		|		ПО АктПриемкиПоКачествуТовары.Ссылка = АктПриемкиПоКачествуОписаниеНедостатков.Ссылка
		|			И АктПриемкиПоКачествуТовары.КлючСтроки = АктПриемкиПоКачествуОписаниеНедостатков.КлючСтроки
		|ГДЕ
		|	АктПриемкиПоКачествуТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборДвижений = Движения.КСП_РезультатыПриемкиПряжиПоКачеству;  
	НаборДвижений.мТаблицаДвижений   = ПолучитьТаблицуРезультатыПриемкиПряжиПоКачеству();
	НаборДвижений.ВыполнитьДвижения();
КонецПроцедуры
