Функция ПолучитьЗначениеПараметра(Параметр)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	               |	КСП_ЗначенияПроизвольныхПараметров.Значение КАК ЗначениеПараметра
	               |ИЗ
	               |	РегистрСведений.КСП_ЗначенияПроизвольныхПараметров КАК КСП_ЗначенияПроизвольныхПараметров
	               |ГДЕ
	               |	КСП_ЗначенияПроизвольныхПараметров.Параметр = &Параметр";
	
	Запрос.УстановитьПараметр("Параметр",Параметр);
	
	ВыборкаЗапрос = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаЗапрос.Следующий() Тогда
		Возврат ВыборкаЗапрос.ЗначениеПараметра;
	Иначе
		Возврат null;
	КонецЕсли;
	
КонецФункции