
// +++ УваровДС 13/12/2023
// Возврат договора в форму документа
&НаКлиенте
Процедура Выбрать(Команда)
	ОповеститьОВыборе(Элементы.Список.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Контрагент = Параметры.Контрагент;
	Партнер = Параметры.Партнер;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
  	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
  	ЭлементОтбора.Использование = Истина;
  	ЭлементОтбора.ПравоеЗначение = Контрагент;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партнер");
  	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
  	ЭлементОтбора.Использование = Истина;
  	ЭлементОтбора.ПравоеЗначение = Партнер;
	
КонецПроцедуры
// --- УваровДС
