
&НаСервере
Процедура КСП_КонтрагентПриИзмененииПослеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.Наименование КАК Наименование,
		|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
		|	Контрагенты.СтранаРегистрации КАК СтранаРегистрации,
		|	ЕСТЬNULL(Контрагенты.СтранаРегистрации.Наименование, ""1"") <> ""РОССИЯ"" КАК Нерезидент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Контрагент.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		УстановитьВидимостьКонтрагентаИПФ(Выборка.Нерезидент);	
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКонтрагентаИПФ(Нерезидент)
	
	Если Нерезидент Тогда	
		Элементы.КСП_ТаможенныйОрган.Видимость = Истина;
		Элементы.ПодменюПечатьОбычное__ДекларацияАрмения.Видимость = Истина;
		Элементы.ПодменюПечатьОбычное__ДекларацияБеларусь.Видимость = Истина;
		Элементы.ПодменюПечатьОбычное__СпецификацияНаТовар.Видимость = Истина;
		Элементы.ПодменюПечатьОбычное__СоставТкани.Видимость = Истина;
		Элементы.ПодменюПечатьОбычное__ВесИСостав.Видимость = Истина;
	Иначе
		Элементы.КСП_ТаможенныйОрган.Видимость = Ложь;
		Элементы.ПодменюПечатьОбычное__ДекларацияАрмения.Видимость = Ложь;
		Элементы.ПодменюПечатьОбычное__ДекларацияБеларусь.Видимость = Ложь;
		Элементы.ПодменюПечатьОбычное__СпецификацияНаТовар.Видимость = Ложь;
		Элементы.ПодменюПечатьОбычное__СоставТкани.Видимость = Ложь;
		Элементы.ПодменюПечатьОбычное__ВесИСостав.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КСП_КонтрагентПриИзмененииПосле(Элемент)
	КСП_КонтрагентПриИзмененииПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура КСП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	КСП_КонтрагентПриИзмененииПослеНаСервере();
	
	Если НЕ ЗначениеЗаполнено(Объект.КСП_ДекларацияСсылка) Тогда
		
		ЗаполнитьДекларацияСсылка();
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДекларацияСсылка()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ТаможеннаяДекларацияЭкспорт.ДокументыОснования КАК ТаможеннаяДекларацияЭкспортДокументыОснования
		|ГДЕ
		|	ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Объект.КСП_ДекларацияСсылка = Выборка.Ссылка;		
		
	КонецЦикла;	
	
КонецПроцедуры
