
&НаСервере
Процедура СформироватьНаСервере()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ПланыПродаж.Номенклатура КАК Номенклатура,
	//               |	ПланыПродаж.Характеристика КАК Характеристика,
	//               |	ПланыПродаж.Количество КАК План,
	//               |	ПланыПродаж.КЗаказу КАК Обеспечено,
	//               |	ПланыПродаж.Количество - ПланыПродаж.КЗаказу КАК ОсталосьОбеспечить,
	//               |	ПланыПродаж.Регистратор КАК ПланПродаж
	//               |ИЗ
	//               |	РегистрНакопления.ПланыПродаж КАК ПланыПродаж
	//               |ГДЕ
	//               |	ПланыПродаж.Сценарий = &СценарийПолный
	//               |	И ПланыПродаж.Сценарий = &СценарийТекущий
	//               |	И ПланыПродаж.Статус = &Статус
	//               |	И ПланыПродаж.Период МЕЖДУ &ДатаНачала И &ДатаОкончания"; 
	//
	//Запрос.УстановитьПараметр("ДатаНачала",		ЭтотОбъект.ДатаНачала);
	//Запрос.УстановитьПараметр("ДатаОкончания",	ЭтотОбъект.ДатаОкончания);
	//Запрос.УстановитьПараметр("СценарийПолный", ЭтотОбъект.СценарийПолный);
	//Запрос.УстановитьПараметр("СценарийТекущий",	ЭтотОбъект.СценарийТекущий);
	//Запрос.УстановитьПараметр("Статус", ЭтотОбъект.Статус);
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
   
   Схема = ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
   Настройки = Схема.НастройкиПоУмолчанию;
      
   КомпоновщикНастроекДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
   КомпоновщикНастроекДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
   КомпоновщикНастроекДанных.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
   КомпоновщикНастроекДанных.ЗагрузитьПользовательскиеНастройки(Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
   
   ЭД = КомпоновщикНастроекДанных.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачала");
   ЭД.Значение = ЭтотОбъект.ДатаНачала;
   ЭД.Использование = Истина;
   
   ЭД = КомпоновщикНастроекДанных.Настройки.ПараметрыДанных.Элементы.Найти("ДатаОкончания");
   ЭД.Значение = ЭтотОбъект.ДатаОкончания;
   ЭД.Использование = Истина;

   ЭД = КомпоновщикНастроекДанных.Настройки.ПараметрыДанных.Элементы.Найти("СценарийПолный");
   ЭД.Значение = ЭтотОбъект.СценарийПолный;
   ЭД.Использование = Истина;
   
   ЭД = КомпоновщикНастроекДанных.Настройки.ПараметрыДанных.Элементы.Найти("СценарийТекущий");
   ЭД.Значение = ЭтотОбъект.СценарийТекущий;
   ЭД.Использование = Истина;

   ЭД = КомпоновщикНастроекДанных.Настройки.ПараметрыДанных.Элементы.Найти("Статус");
   ЭД.Значение = ЭтотОбъект.Статус;
   ЭД.Использование = Истина;
   
   КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
   Макет = КомпоновщикМакета.Выполнить(Схема, КомпоновщикНастроекДанных.ПолучитьНастройки());
   
   ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
   ПроцессорКомпоновки.Инициализировать(Макет);
   
   ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
   ПроцессорВывода.УстановитьДокумент(Результат);
   ПроцессорВывода.Вывести(ПроцессорКомпоновки);   
   
     //ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
   //ПроцессорВывода.УстановитьОбъект(ДеревоОтчета);
   //ПроцессорВывода.Вывести(ПроцессорКомпоновки);
      
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
