
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.КаталогЗагрузки = Константы.КСП_КаталогЗагрузкиЗаказовКлиента.Получить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьФайлНаСервере(ДвоичДанные, Расширение)
	КСП_ЗагрузкаЗаказовКлиентов.ЗагрузкаЗаказа(ДвоичДанные,Расширение);	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФыбораФайла.Фильтр = "Книга Excel(*.xls; *.xlsx)|*.xls; *.xlsx";
	ДиалогФыбораФайла.Заголовок = "Выберите файл";
	ДиалогФыбораФайла.ПредварительныйПросмотр = Ложь;
	ДиалогФыбораФайла.ИндексФильтра = 0;
	Если ДиалогФыбораФайла.Выбрать() Тогда		
        ИмяФайла = ДиалогФыбораФайла.ПолноеИмяФайла;
	КонецЕсли;	
	
	нФайл = Новый Файл(ИмяФайла);
	
	//Если НЕ нФайл.Существует() Тогда
	//	Возврат;
	//КонецЕсли;
	
	ДвоичДанные = Новый ДвоичныеДанные(ИмяФайла);
	
	ЗагрузитьФайлНаСервере(ДвоичДанные, нФайл.Расширение);
	
КонецПроцедуры

&НаКлиенте
Процедура РегламентноеЗадание(Команда)
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьБланЗаказаНаСервере()
	ТабДок = Новый ТабличныйДокумент;
	Макет = Обработки.КСП_АРМЗагрузчикЗаказовКлиента.ПолучитьМакет("КСП_Макет");
	Область = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(Область);
	ТабДок.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьБланЗаказа(Команда)
		ТабДок = Новый ТабличныйДокумент;
	Макет = Объект.ПолучитьМакет("КСП_Макет");
	Область = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(Область);
	ТабДок.Показать();
   //ВыгрузитьБланЗаказаНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьИзКаталогаНаСервере()

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзКаталога(Команда)
	НайденныеФайлы = НайтиФайлы(ЭтаФорма.КаталогЗагрузки, "*.xls");
	Для каждого текФайл Из НайденныеФайлы Цикл
		ДвоичДанные = Новый ДвоичныеДанные(текФайл.ПолноеИмя);
		ЗагрузитьФайлНаСервере(ДвоичДанные, текФайл.Расширение);
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура КаталогЗагрузкиПриИзмененииНаСервере(КаталогЗагрузки)
	Константы.КСП_КаталогЗагрузкиЗаказовКлиента.Установить(КаталогЗагрузки);
КонецПроцедуры

&НаКлиенте
Процедура КаталогЗагрузкиПриИзменении(Элемент)
	КаталогЗагрузкиПриИзмененииНаСервере(ЭтаФорма.КаталогЗагрузки);
КонецПроцедуры

&НаКлиенте
Процедура КаталогЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогФыбораФайла.Заголовок = "Выберите каталог";
	ДиалогФыбораФайла.ПредварительныйПросмотр = Ложь;
	ДиалогФыбораФайла.ИндексФильтра = 0;
	Если ДиалогФыбораФайла.Выбрать() Тогда		
        ЭтаФорма.КаталогЗагрузки = ДиалогФыбораФайла.Каталог;
	КонецЕсли;	
    КаталогЗагрузкиПриИзмененииНаСервере(ДиалогФыбораФайла.Каталог);
КонецПроцедуры
