
Процедура ОбработкаПроведения(Отказ, Режим)
	////{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//// Данный фрагмент построен конструктором.
	//// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//// регистр ПорядковыеНомераНоменклатурыДляПоказа
	//Движения.ПорядковыеНомераНоменклатурыДляПоказа.Записывать = Истина;
	//Для Каждого ТекСтрокаТовар Из Товар Цикл
	//	Движение = Движения.ПорядковыеНомераНоменклатурыДляПоказа.Добавить();
	//	Движение.Номенклатура = ТекСтрокаТовар.Номенклатура;
	//	Движение.ПорядковыйНомер = ТекСтрокаТовар.ПорядковыйНомер;
	//КонецЦикла;

	////}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//
	//
	////++ it_1c4 Водолазова И.А. 10.08.2019 построим соответствия характеристикам размеров и ростов чтоб ускорить проведение заявки на будущее с товаром производственного бизнеса
	////с помощью регистра быстрее будем находить соответсвия при построении таблицы товаров из таблицы ТоварыДляВвода
	//Если Подразделение = Справочники.Подразделения.НайтиПоНаименованию("ПРОИЗВОДСТВЕННЫЙ БИЗНЕС") Тогда	
	//	//получим информацию для записи в регистр сведений СоответствияХарактеристикРазмеруРосту
	//	Запрос	= Новый Запрос;
	//	Запрос.Текст	= 
	//	"ВЫБРАТЬ
	//	|	ЗарисовкаРоста.Ссылка КАК ДокЗарисовка,
	//	|	ЗарисовкаРоста.Рост КАК Рост,
	//	|	NULL КАК ПрочийРазмер,
	//	|	ЗарисовкаРоста.Ссылка.МинимальныйРазмер.Код КАК МинимальныйРазмер,
	//	|	ЗарисовкаРоста.Ссылка.МаксимальныйРазмер.Код КАК МаксимальныйРазмер
	//	|ПОМЕСТИТЬ РостРазмер
	//	|ИЗ
	//	|	Документ.Зарисовка.Роста КАК ЗарисовкаРоста
	//	|ГДЕ
	//	|	ЗарисовкаРоста.Рост <> ЗНАЧЕНИЕ(Справочник.Рост.ПустаяСсылка)
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ЗарисовкаСписокРазмерРостов.Ссылка,
	//	|	NULL,
	//	|	ЗарисовкаСписокРазмерРостов.РазмероРост,
	//	|	NULL,
	//	|	NULL
	//	|ИЗ
	//	|	Документ.Зарисовка.СписокРазмерРостов КАК ЗарисовкаСписокРазмерРостов
	//	|ГДЕ
	//	|	ЗарисовкаСписокРазмерРостов.РазмероРост <> ЗНАЧЕНИЕ(Справочник.РазмероРостПрочий.ПустаяСсылка)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	УстановкаПорядковыхНомеровНоменклатурыДляПоказаТовар.Номенклатура КАК Номенклатура,
	//	|	ВЫБОР
	//	|		КОГДА УстановкаПорядковыхНомеровНоменклатурыДляПоказаТовар.Номенклатура.ВидНоменклатуры.Наименование = ""Одежда""
	//	|			ТОГДА РостРазмер.Рост
	//	|		ИНАЧЕ РостРазмер.ПрочийРазмер
	//	|	КОНЕЦ КАК РостРазмер,
	//	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	//	|	ХарактеристикиНоменклатуры.Размер.Код КАК Размер
	//	|ИЗ
	//	|	Документ.УстановкаПорядковыхНомеровНоменклатурыДляПоказа.Товар КАК УстановкаПорядковыхНомеровНоменклатурыДляПоказаТовар
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РостРазмер КАК РостРазмер
	//	|		ПО УстановкаПорядковыхНомеровНоменклатурыДляПоказаТовар.Номенклатура.ВнутреннийТовар.Зарисовка = РостРазмер.ДокЗарисовка
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	//	|		ПО УстановкаПорядковыхНомеровНоменклатурыДляПоказаТовар.Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
	//	|ГДЕ
	//	|	УстановкаПорядковыхНомеровНоменклатурыДляПоказаТовар.Ссылка = &Ссылка
	//	|	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Номенклатура,
	//	|	Характеристика";
	//	
	//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	
	//	// ВишневскийАС  { 28.01.2022 : 
	//	// так как есть дубли в записях , в зарисовке несколько размеров , что бы разобраться с проблемой я написал висьмо Исаковой Валерии , но ответа нет , а 
	//	// документ проводить надо , переделаю временно на менеджер записи 
	//	
	//	НаборЗаписей = РегистрыСведений.СоответствияХарактеристикРазмеруРосту.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка); 
	//	
	//	НоменклатураПред   = Неопределено;
	//	ХарактеристикаПред = Неопределено;
	//	
	//	Пока Выборка.Следующий() Цикл 
	//		Если НоменклатураПред = Выборка.Номенклатура и ХарактеристикаПред = Выборка.Характеристика Тогда   // так как запрос упорядочен по номенклатуре дублей быть не должно 
	//			Продолжить;
	//		иначе
	//			НоменклатураПред = Выборка.Номенклатура;
	//			ХарактеристикаПред = Выборка.Характеристика;
	//		КонецЕсли;
	//	   НоваяЗапись = НаборЗаписей.Добавить(); 
	//	   ЗаполнитьЗначенияСвойств(НоваяЗапись,Выборка);
	//	КонецЦикла; 
	//	НаборЗаписей.Записать(); 
	//	// ВишневскийАС  : 28.01.2022 }
	//	
	//КонецЕсли;
	////-- it_1c4 Водолазова И.А. 10.08.2019
	
	
КонецПроцедуры
