// Возввращает сумму документа без скидок (наценок)
//  Товары - Табличная часть
//
// Параметры:
//  Объект	-	Объект по которму нужна сумма 
// 
// Возвращаемое значение:
//  СуммаДокументаБезСкидок - Число, сумма документа без скидок (наценок)
//
Функция ПолучитьСуммуДокументаБезСкидокНаценк(Знач Объект) Экспорт
	
	СуммаДокументаБезСкидокНаценок = 0;
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Товары.Цена КАК Цена,
			|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
			|	Товары.Отменено КАК Отменено
			|ПОМЕСТИТЬ втТовары
			|ИЗ
			|	&Товары КАК Товары
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(ВЫБОР
			|			КОГДА НЕ втТовары.Отменено
			|				ТОГДА втТовары.Цена * втТовары.КоличествоУпаковок
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК СуммаДокументаБезСкидокНаценок
			|ИЗ
			|	втТовары КАК втТовары";
		
		Запрос.УстановитьПараметр("Товары", Объект.Товары);
		
		ВыборкаСкидок = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаСкидок.Следующий() Тогда
			СуммаДокументаБезСкидокНаценок = ВыборкаСкидок.СуммаДокументаБезСкидокНаценок
		Иначе
			Возврат 0;
		КонецЕсли;

	КонецЕсли;
	
	Возврат СуммаДокументаБезСкидокНаценок;
	
КонецФункции

// Возвращает сумму оплаченную по заказу по РН РасчетыСКлиентамиПоСрокам
//
// Параметры:
//  Заказ	 - ЗаказКлиентаСсылка	 - Заказ по которому необходимо посчиать оплату
// 
// Возвращаемое значение:
//  Сумма - Число, оплаченная сумма по заказу
//
Функция СуммаОплатПоЗаказу(Знач Заказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыСКлиентами.ОбъектРасчетов.Объект КАК ОбъектРасчетовОбъект,
		|	-РасчетыСКлиентами.СуммаОстаток КАК Оплачено
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Остатки(, ОбъектРасчетов.Объект = &Заказ) КАК РасчетыСКлиентами";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Сумма = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сумма = ВыборкаДетальныеЗаписи.Оплачено;
	КонецЦикла;	
	
	Возврат Сумма;
		
КонецФункции