
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	// Разработать новый справочник Период вывески. 
	// Реквизит «Код» должен заполняться автоматически по следующей маске [День].[Месяц].
	
	СтандартнаяОбработка = Ложь;
	
	МаскаКода = "" + Строка(День) + Строка(Месяц);
	Код = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(МаскаКода, 30, "0", "Слева");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#Иначе
	
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	
#КонецЕсли
