
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИДВызова = ЗАпись.ИндексЛога;
	Если ЗначениеЗаполнено(ИДВызова) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИДВызова",ИдВызова);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛогСообщений.Ссылка КАК Сообщение,
		               |	ЛогСообщений._Владелец КАК Владелец,
		               |	ЛогСообщений.Наименование,
		               |	ЛогСообщений.ВидСообщения КАК ВидСообщения
		               |ИЗ
		               |	Справочник.мис_ЛогСообщений КАК ЛогСообщений
		               |ГДЕ
		               |	ЛогСообщений._Владелец В ИЕРАРХИИ(&ИдВызова)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЛогСообщений._Владелец.ВремяВызова,
		               |	ЛогСообщений.ДатаВремя
		               |ИТОГИ ПО
		               |	Владелец ИЕРАРХИЯ
		               |АВТОУПОРЯДОЧИВАНИЕ";
		Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		ЗначениеВДанныеФормы(Дерево,СписокОшибок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Сообщение) Тогда
		ОткрытьЗначение(Элемент.ТекущиеДанные.Сообщение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОтчет(Команда)
	
	мис_ЛоггерКлиент.ОткрытьОтчетПоЛогу(Запись.ИндексЛога);
	
КонецПроцедуры
