
&НаСервере
Функция ПолучитьИмеющиесяИдентификаторы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КСП_ИдентификаторыТоваровДляПоказа.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.КСП_ИдентификаторыТоваровДляПоказа КАК КСП_ИдентификаторыТоваровДляПоказа
		|
		|СГРУППИРОВАТЬ ПО
		|	КСП_ИдентификаторыТоваровДляПоказа.Идентификатор";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Идентификатор");
	
	возврат РезультатЗапроса;
	
КонецФункции

&НаКлиенте
Процедура СформироватьИдентификаторы(Команда)
	МассивИмеющихсяИдентификаторов = ПолучитьИмеющиесяИдентификаторы();
	ГЕН = Новый ГенераторСлучайныхЧисел();
	Для каждого текСтрока Из Объект.Идентификаторы Цикл
		Если НЕ ЗначениеЗаполнено(текСтрока.Идентификатор) И ЗначениеЗаполнено(текСтрока.Номенклатура) Тогда
			Число1 = ГЕН.СлучайноеЧисло(0, 4000000000);
			Число2 = ГЕН.СлучайноеЧисло(0, 3000000000);
			Число3 = ГЕН.СлучайноеЧисло(0, 2999999999);
			текСтрока.Идентификатор = Число1 + Число2 + Число3;
			Пока МассивИмеющихсяИдентификаторов.Найти(текСтрока.Идентификатор) <> Неопределено Цикл
				текСтрока.Идентификатор = ГЕН.СлучайноеЧисло(0, 9999999999);
			КонецЦикла;
			МассивИмеющихсяИдентификаторов.Добавить(текСтрока.Идентификатор);
		КонецЕсли;
	КонецЦикла
КонецПроцедуры
