
&ИзменениеИКонтроль("ТаблицаОбъектовДляПечатиКомплектно")
Функция КСП_ТаблицаОбъектовДляПечатиКомплектно()

	ТаблицаОбъектов = Новый ТаблицаЗначений();
	ТаблицаОбъектов.Колонки.Добавить("ТипОбъекта");
	ТаблицаОбъектов.Колонки.Добавить("Представление");
	ТаблицаОбъектов.Колонки.Добавить("ЕстьОрганизация");
	ТаблицаОбъектов.Колонки.Добавить("ЕстьПартнер");
	
	#Вставка
	// ТаможеннаяДекларацияЭкспорт
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипОбъекта = Метаданные.Документы.ТаможеннаяДекларацияЭкспорт.ПолноеИмя();
	НоваяСтрока.Представление = Метаданные.Документы.ТаможеннаяДекларацияЭкспорт.Представление();
	НоваяСтрока.ЕстьОрганизация = Истина;
	НоваяСтрока.ЕстьПартнер = Истина;	
	#КонецВставки
	
	// Заказ клиента
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыКлиентов") Тогда
		НоваяСтрока = ТаблицаОбъектов.Добавить();
		НоваяСтрока.ТипОбъекта = Метаданные.Документы.ЗаказКлиента.ПолноеИмя();
		НоваяСтрока.Представление = Метаданные.Документы.ЗаказКлиента.Представление();
		НоваяСтрока.ЕстьОрганизация = Истина;
		НоваяСтрока.ЕстьПартнер = Истина;
	КонецЕсли;

	// Заявка на возврат товаров от клиента
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаВозвратТоваровОтКлиентов") Тогда
		НоваяСтрока = ТаблицаОбъектов.Добавить();
		НоваяСтрока.ТипОбъекта = Метаданные.Документы.ЗаявкаНаВозвратТоваровОтКлиента.ПолноеИмя();
		НоваяСтрока.Представление = Метаданные.Документы.ЗаявкаНаВозвратТоваровОтКлиента.Представление();
		НоваяСтрока.ЕстьОрганизация = Истина;
		НоваяСтрока.ЕстьПартнер = Истина;
	КонецЕсли;

	// Счет на оплату
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСчетаНаОплатуКлиентам") Тогда
		НоваяСтрока = ТаблицаОбъектов.Добавить();
		НоваяСтрока.ТипОбъекта = Метаданные.Документы.СчетНаОплатуКлиенту.ПолноеИмя();
		НоваяСтрока.Представление = Метаданные.Документы.СчетНаОплатуКлиенту.Представление();
		НоваяСтрока.ЕстьОрганизация = Истина;
		НоваяСтрока.ЕстьПартнер = Истина;
	КонецЕсли;

	// Доверенность
	Если ПолучитьФункциональнуюОпцию("ИспользоватьДоверенностиНаПолучениеТМЦ") Тогда
		НоваяСтрока = ТаблицаОбъектов.Добавить();
		НоваяСтрока.ТипОбъекта = Метаданные.Документы.ДоверенностьВыданная.ПолноеИмя();
		НоваяСтрока.Представление = Метаданные.Документы.ДоверенностьВыданная.Представление();
		НоваяСтрока.ЕстьОрганизация = Истина;
		НоваяСтрока.ЕстьПартнер = Истина;
	КонецЕсли;

	// Приходный кассовый ордер
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипОбъекта = Метаданные.Документы.ПриходныйКассовыйОрдер.ПолноеИмя();
	НоваяСтрока.Представление = Метаданные.Документы.ПриходныйКассовыйОрдер.Представление();
	НоваяСтрока.ЕстьОрганизация = Истина;
	НоваяСтрока.ЕстьПартнер = Ложь;

	// Реализация товаров и услуг
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипОбъекта = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
	НоваяСтрока.Представление = Метаданные.Документы.РеализацияТоваровУслуг.Представление();
	НоваяСтрока.ЕстьОрганизация = Истина;
	НоваяСтрока.ЕстьПартнер = Истина;

	// Акт выполненных работ
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипОбъекта = Метаданные.Документы.АктВыполненныхРабот.ПолноеИмя();
	НоваяСтрока.Представление = Метаданные.Документы.АктВыполненныхРабот.Представление();
	НоваяСтрока.ЕстьОрганизация = Истина;
	НоваяСтрока.ЕстьПартнер = Истина;

	// Перемещение товаров
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПеремещениеТоваров") Тогда
		НоваяСтрока = ТаблицаОбъектов.Добавить();
		НоваяСтрока.ТипОбъекта = Метаданные.Документы.ПеремещениеТоваров.ПолноеИмя();
		НоваяСтрока.Представление = Метаданные.Документы.ПеремещениеТоваров.Представление();
		НоваяСтрока.ЕстьОрганизация = Истина;
		НоваяСтрока.ЕстьПартнер = Ложь;
	КонецЕсли;

	// Передача товаров хранителю
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПередачуНаОтветственноеХранениеСПравомПродажи") Тогда
		НоваяСтрока = ТаблицаОбъектов.Добавить();
		НоваяСтрока.ТипОбъекта = Метаданные.Документы.ПередачаТоваровХранителю.ПолноеИмя();
		НоваяСтрока.Представление = Метаданные.Документы.ПередачаТоваровХранителю.Представление();
		НоваяСтрока.ЕстьОрганизация = Истина;
		НоваяСтрока.ЕстьПартнер = Истина;
	КонецЕсли;

	// Отгрузка товаров с хранения
	ИспользоватьПередачуНаОтветственноеХранениеСПравомПродажи =
	ПолучитьФункциональнуюОпцию("ИспользоватьПередачуНаОтветственноеХранениеСПравомПродажи");
	//++ НЕ УТКА
	ИспользоватьПередачуНаОтветственноеХранениеСПравомПродажи =
	ИспользоватьПередачуНаОтветственноеХранениеСПравомПродажи
	Или ПолучитьФункциональнуюОпцию("ИспользоватьПроизводствоИзДавальческогоСырья2_5");
	//-- НЕ УТКА
	Если ИспользоватьПередачуНаОтветственноеХранениеСПравомПродажи Тогда
		НоваяСтрока = ТаблицаОбъектов.Добавить();
		НоваяСтрока.ТипОбъекта = Метаданные.Документы.ОтгрузкаТоваровСХранения.ПолноеИмя();
		НоваяСтрока.Представление = Метаданные.Документы.ОтгрузкаТоваровСХранения.Представление();
		НоваяСтрока.ЕстьОрганизация = Истина;
		НоваяСтрока.ЕстьПартнер = Истина;
	КонецЕсли;

	//++ НЕ УТКА

	// Отчет давальцу
	//++ Устарело_Переработка24
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПроизводствоИзДавальческогоСырья") Тогда
		НоваяСтрока = ТаблицаОбъектов.Добавить();
		НоваяСтрока.ТипОбъекта = Метаданные.Документы.ОтчетДавальцу.ПолноеИмя();
		НоваяСтрока.Представление = Метаданные.Документы.ОтчетДавальцу.Представление();
		НоваяСтрока.ЕстьОрганизация = Истина;
		НоваяСтрока.ЕстьПартнер = Истина;
	КонецЕсли;
	//-- Устарело_Переработка24

	Если ПолучитьФункциональнуюОпцию("ИспользоватьПроизводствоИзДавальческогоСырья2_5") Тогда
		НоваяСтрока = ТаблицаОбъектов.Добавить();
		НоваяСтрока.ТипОбъекта      = Метаданные.Документы.ОтчетДавальцу2_5.ПолноеИмя();
		НоваяСтрока.Представление   = Метаданные.Документы.ОтчетДавальцу2_5.Представление();
		НоваяСтрока.ЕстьОрганизация = Истина;
		НоваяСтрока.ЕстьПартнер     = Истина;
	КонецЕсли;
	//-- НЕ УТКА

	// Выкуп возвратной тары клиентом
	Если ПолучитьФункциональнуюОпцию("ИспользоватьМногооборотнуюТару") Тогда
		НоваяСтрока = ТаблицаОбъектов.Добавить();
		НоваяСтрока.ТипОбъекта = Метаданные.Документы.ВыкупВозвратнойТарыКлиентом.ПолноеИмя();
		НоваяСтрока.Представление = Метаданные.Документы.ВыкупВозвратнойТарыКлиентом.Представление();
		НоваяСтрока.ЕстьОрганизация = Истина;
		НоваяСтрока.ЕстьПартнер = Ложь;
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("ИспользоватьОказаниеАгентскихУслугПриЗакупке") Тогда
		НоваяСтрока = ТаблицаОбъектов.Добавить();
		НоваяСтрока.ТипОбъекта = Метаданные.Документы.ОтчетКомитентуОЗакупках.ПолноеИмя();
		НоваяСтрока.Представление = Метаданные.Документы.ОтчетКомитентуОЗакупках.Представление();
		НоваяСтрока.ЕстьОрганизация = Истина;
		НоваяСтрока.ЕстьПартнер = Ложь;
	КонецЕсли;

	Возврат ТаблицаОбъектов;

КонецФункции
