
&НаСервере
Процедура КСП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ тзДоговоры
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Контрагент = &Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КСП_ДоговорыБанковскаяГарантияСрезПоследних.Договор КАК Договор,
		|	КСП_ДоговорыБанковскаяГарантияСрезПоследних.ЕстьБанковскаяГарантия КАК ЕстьБанковскаяГарантия,
		|	КСП_ДоговорыБанковскаяГарантияСрезПоследних.Период КАК Период,
		|	КСП_ДоговорыБанковскаяГарантияСрезПоследних.РазмерПредоплаты КАК РазмерПредоплаты,
		|	КСП_ДоговорыБанковскаяГарантияСрезПоследних.Сумма КАК Сумма
		|ПОМЕСТИТЬ тзБанковскаяГарантия
		|ИЗ
		|	РегистрСведений.КСП_ДоговорыБанковскаяГарантия.СрезПоследних(&ТекущаяДата, Договор.Контрагент = &Контрагент) КАК КСП_ДоговорыБанковскаяГарантияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тзДоговоры.Ссылка КАК Договор,
		|	тзБанковскаяГарантия.ЕстьБанковскаяГарантия КАК ЕстьБанковскаяГарантия,
		|	тзБанковскаяГарантия.Период КАК Дата,
		|	тзБанковскаяГарантия.РазмерПредоплаты КАК РазмерПредоплаты,
		|	тзБанковскаяГарантия.Сумма КАК Сумма
		|ИЗ
		|	тзДоговоры КАК тзДоговоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ тзБанковскаяГарантия КАК тзБанковскаяГарантия
		|		ПО тзДоговоры.Ссылка = тзБанковскаяГарантия.Договор";
	
	Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ЭтаФорма.БанковскаяГарантияДоговоры.Загрузить(РезультатЗапроса);

КонецПроцедуры

&НаСервере
Процедура КСП_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтаФорма.Объект.КСП_ИмеетсяБанковскаяГарантия Тогда
		Для каждого текСтрока Из ЭтаФорма.БанковскаяГарантияДоговоры Цикл
			Если ЗначениеЗаполнено(текСтрока.Дата) ИЛИ ЗначениеЗаполнено(текСтрока.РазмерПредоплаты) ИЛИ (текСтрока.Сумма) Тогда
				НаборЗаписей = РегистрыСведений.КСП_ДоговорыБанковскаяГарантия.СоздатьМенеджерЗаписи();
				НаборЗаписей.Период = текСтрока.Дата;
				НаборЗаписей.Договор = текСтрока.Договор;
				НаборЗаписей.ЕстьБанковскаяГарантия = текСтрока.ЕстьБанковскаяГарантия;
				НаборЗаписей.РазмерПредоплаты = текСтрока.РазмерПредоплаты;
				НаборЗаписей.Сумма = текСтрока.Сумма;
				НаборЗаписей.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
