
&После("ОбработкаЗаполнения")
Процедура КСП_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//Попытка м = Основание.Метаданные(); Исключение Возврат; КонецПопытки;  
	////**** Алекс Ц.	для исключения возможности возникновения двух "Поступлений товара" на основании одного "Приходного ордера"
	//Если ТипЗнч(Основание)=Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
	//	МассивПодчиненныхДокументов = СервисныеФункции.ПолучитьМассивПодчиненныхДокументов(Основание);
	//	//МассивПодчиненныхДокументов = КритерииОтбора.СтруктураПодчиненности.Найти(Основание);
	//	Для Каждого ТекДокум Из МассивПодчиненныхДокументов Цикл
	//		Если ТипЗнч(ТекДокум)=Тип("ДокументСсылка.ПоступлениеТоваровУслуг") и ТекДокум<>ЭтотОбъект.Ссылка Тогда
	//		#Если Клиент Тогда
	//			Если ТекДокум.Проведен Тогда
	//				Предупреждение("На основании документа " + Основание + " уже есть введенные документ ""Поступления товаров и услуг"" (" + ТекДокум + ")",5);
	//				Если Вопрос("Эта накладная - исправительная взамен отсторнированной?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.нет тогда
	//					Если НЕ РольДоступна("ПолныеПрава") Тогда				
	//						Возврат;
	//					КонецЕсли;
	//				Иначе
	//	             	Предупреждение("На закладке 'Прочее' введите исправляемый документ!",5);
	//				КонецЕсли;	
	//			Иначе
	//			КонецЕсли;
	//		#КонецЕсли
	//		#Если Сервер Тогда
	//			Сообщить("На основании документа " + Основание + " уже есть введенные документ ""Поступления товаров и услуг"" (" + ТекДокум + ")");
	//		#КонецЕсли
	//		ИначеЕсли ТипЗнч(ТекДокум)=Тип("ДокументСсылка.АвансовыйОтчет") и ТекДокум.Проведен и ТекДокум<>ЭтотОбъект.Ссылка Тогда
	//		#Если Клиент Тогда
	//			Предупреждение("На основании документа " + Основание + " уже есть введенные документ ""Авансовый отчет"" (" + ТекДокум + ")",5);
	//			Если НЕ РольДоступна("ПолныеПрава") Тогда
	//				Возврат;
	//			КонецЕсли;
	//		#КонецЕсли
	//		#Если Сервер Тогда
	//			Сообщить("На основании документа " + Основание + " уже есть введенные документ ""Авансовый отчет"" (" + ТекДокум + ")");
	//		#КонецЕсли
	//		ИначеЕсли ТипЗнч(ТекДокум)=Тип("ДокументСсылка.ПоступлениеТоваровИзПереработки") и ТекДокум.Проведен и ТекДокум<>ЭтотОбъект.Ссылка Тогда
	//		#Если Клиент Тогда
	//			Предупреждение("На основании документа " + Основание + " уже есть введенные документ ""Поступления товаров из переработки"" (" + ТекДокум + ")",5);
	//			Если НЕ РольДоступна("ПолныеПрава") Тогда
	//				Возврат;
	//			КонецЕсли;
	//		#КонецЕсли
	//		#Если Сервер Тогда
	//			Сообщить("На основании документа " + Основание + " уже есть введенные документ ""Поступления товаров из переработки"" (" + ТекДокум + ")");
	//		#КонецЕсли
	//		КонецЕсли;
	//	КонецЦикла;	
	//	СпецТипНакладной = Основание.СпецТипНакладной;
	//КонецЕсли;
	////****
	
	// Установим вид операции.
	ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	
	//// Заполним реквизиты по документу основанию.
	//ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);

	////**** Алекс Ц.
	//Если ТипЗнч(Основание)=Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
	//	ОтражатьВУправленческомУчете	= Истина;
	//	ОтражатьВБухгалтерскомУчете		= Истина;
	//	ОтражатьВНалоговомУчете			= Истина;
	//КонецЕсли;
	////****
	//
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
			Основание = ДанныеЗаполнения.ДокументОснование;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Основание = ДанныеЗаполнения;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		//ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
		НаименованиеВходящегоДокумента = Основание.Метаданные().Синоним; 
		ЦенаВключаетНДС = Основание.ЦенаВключаетНДС;
		//20171201 водол
		Если Основание.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН","040740007900") Тогда//Ср.Азия
			//И (Основание.Склад = Справочники.Склады.КазахстанПредзаказ ИЛИ Основание.Склад = Справочники.Склады.КазахстанРаспределение)  Тогда
			//05.02.2021 Власенко +++ Задача № 5283 
			//Если ЗначениеЗаполнено(Основание.ДокументОснование) 
			//	И ТипЗнч(Основание.ДокументОснование) = Тип("ДокументСсылка.ПартияНаОтгрузкуЭкспорт")
			//	И Основание.ДокументОснование.ПризнакПартияНаАТП Тогда
			//	
			//	СкладОрдер = Справочники.Склады.АЛМАТЫ_Физический;
			//	Склад = Справочники.Склады.АЛМАТЫ_Физический;
			//	
			//Иначе
			//	СкладОрдер = Справочники.Склады.АЛМАТЫ_ФизическийУдаленный;
			//	Склад = Справочники.Склады.АЛМАТЫ_ФизическийУдаленный;
			//КонецЕсли;
			//Если ЗначениеЗаполнено(Основание.ДокументОснование) И ТипЗнч(Основание.ДокументОснование) = Тип("ДокументСсылка.ПартияНаОтгрузкуЭкспорт") Тогда  
			//	СкладОрдер = Основание.ДокументОснование.СкладПоставки;
			//	Склад = СкладОрдер;	
			//Иначе
			//	СкладОрдер = Справочники.Склады.АЛМАТЫ_ФизическийУдаленный;
				Склад = Справочники.Склады.НайтиПоНаименованию("Казахстан Физический Удаленный");
			//КонецЕсли;
			//05.02.2021 Власенко ---
			//СкладХранения = СкладОрдер.СкладХранения;
			КСП_Основание = Основание;
		//Иначе//**
		//	СкладОрдер     = Основание.Склад;
		КонецЕсли;

		ОрганизацияКонтрагента = Справочники.Организации.НайтиПоРеквизиту("ИНН",Лев(Основание.Контрагент.ИНН,10));

		Если ЗначениеЗаполнено(ОрганизацияКонтрагента) Тогда
			
			// Документ не отражается в управленческом учете (внутреняя передача товара),
			// поменяем организацию и контрагента местами.
			Организация = ОрганизацияКонтрагента;
			//20171201 водол
			Если Основание.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН","040740007900")  Тогда
			
				Контрагент =  Справочники.Контрагенты.НайтиПоНаименованию("Элис Фэшн Рус (АО)"); 
				Партнер = Контрагент.Партнер;
			//Иначе//**

				//Контрагент  = УправлениеВзаиморасчетами.ПолучитьКонтрагентаПоОрганизации(Основание.Организация);
			КонецЕсли;

			//ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;

			// Заполним номер и дату вхоящего документа.
			НомерВходящегоДокумента = Основание.Номер;
			ДатаВходящегоДокумента  = Основание.Дата;
			
			//УправлениеВзаиморасчетами.ПриИзмененииЗначенияКонтрагента(ЭтотОбъект);
			
		Иначе
			//переносить контрагента и договор нет смысла при такой цепочке
            Контрагент = "";
			Договор = "";
		КонецЕсли;

		//СтруктураКурсаВзаиморасчетов = ОбщегоНазначения.ПолучитьКурсВалюты(ДоговорКонтрагента.ВалютаВзаиморасчетов, Дата);
		//КурсВзаиморасчетов           = СтруктураКурсаВзаиморасчетов.Курс;
		//КратностьВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Кратность;

		// Заполним табличные части.
		//ЗаполнитьТоварыПоОснованиюРеализация(Основание); 
		Товары.Загрузить(Основание.Товары.Выгрузить());
		//ЗаполнитьУслугиПоОснованиюРеализация(Основание);
		//ЗаполнитьВозвратнуюТаруПоОснованиюРеализация(Основание);
		//
		//
		//Если Основание.Контрагент = Справочники.Контрагенты.НайтиПоКоду("000000379") Тогда //Ср.Азия
		//	ДокСФ = УчетНДС.НайтиПодчиненныйДокумент(Основание, "СчетФактураВыданный");
		//	ДатаСчетФактурыВыданной = ДокСФ.Дата;
		//	НомерСчетФактурыВыданной = ДокСФ.Номер;
		//КонецЕсли;

	КонецЕсли;
КонецПроцедуры
