&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Картинка = ПоместитьВоВременноеХранилище(Объект.Картинка.Хранилище.Получить(), УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ХранилищеДополнительнойИнформации") Тогда
		Если НЕ Объект.Картинка = ВыбранноеЗначение Тогда
			Объект.Картинка = ВыбранноеЗначение;
		КонецЕсли;
		Картинка = ПоместитьВоВременноеХранилище(Объект.Картинка.Хранилище.Получить(), УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РаботаСФайлами.ОткрытьФормуИзображения(ЭтаФорма, Объект.Картинка, Объект.Ссылка);
КонецПроцедуры
